[{"chunk": "SOLICITATION/CONTRACT/ORDER FOR COMMERCIAL PRODUCTS AND COMMERCIAL SERVICES---1. REQUISITION NO. CIO20230155---PAGE 1 OF---28OFFEROR TO COMPLETE BLOCKS 12, 17, 23, 24, & 30---2. CONTRACT NO.3. AWARD/EFFECTIVE DATE---4. ORDER NO.5. SOLICITATION NUMBER---6. SOLICITATION ISSUE DATE---030ADV23Q005102-15-20237. FOR SOLICITATION---INFORMATION CALL:a. NAME---Schuman, Michael---b. TELEPHONE NO. (No Collect Calls) (202) 707-1088---", "chunk_id": 1}, {"chunk": "8. OFFER DUE DATE/LOCAL---TIME---03-07-2023 17:00EST---9. ISSUED BY---CODE---030010. THIS ACQUISITION IS---X---UNRESTRICTED OR---SET ASIDE:% FOR:Contracts and Grants Directorate Library of Congress---101 Independence Ave. SE LA 325 Washington DC 20540-9411SMALL BUSINESS---HUBZONE SMALL BUSINESS---SERVICE-DISABLED VETERAN-OWNED SMALL BUSINESS---WOMEN-OWNED SMALL BUSINESS (WOSB) ELIGIBLE UNDER THE WOMEN-OWNED SMALL BUSINESS PROGRAM---", "chunk_id": 2}, {"chunk": "EDWOSB---NAICS:SIZE STANDARD:8(A)11. DELIVERY FOR FOB DESTINA-TION UNLESS BLOCK IS MARKED---SEE SCHEDULE---12. DISCOUNT TERMS---13a. THIS CONTRACT IS A RATED ORDER UNDER DPAS (15 CFR 700)---13b. RATING---N/A---14. METHOD OF SOLICITATION X---RFQ---IFB---RFP---15. DELIVER TO---CODE---DELIVERY---16. ADMINISTERED BY---CODE---9411See Section F for delivery instructions.Contracts & Grants Directorate Library of Congress LA 325 101 Independence Av SE Washington DC 20540-9411", "chunk_id": 3}, {"chunk": "17a. CONTRACTOR/OFFEROR---CODE---FACILITY CODE---18a. PAYMENT WILL BE MADE BY---CODE---9110Submit Invoices through https://www.ipp.gov Washington DC 20540---PHONE:FAX:TELEPHONE NO.UEI:EFT:18b. SUBMIT INVOICES TO ADDRESS SHOWN IN BLOCK 18a UNLESS BLOCK BELOW IS CHECKED17b. CHECK IF REMITTANCE IS DIFFERENT AND PUT SUCH ADDRESS IN OFFER---SEE ADDENDUM---19. ITEM NO.", "chunk_id": 4}, {"chunk": "SCHEDULE OF SUPPLIES/SERVICES---20.See CONTINUATION Page---21. QUANTITY---22. UNIT---23. UNIT PRICE---24. AMOUNT---(Use Reverse and/or Attach Additional Sheets as Necessary)---25. ACCOUNTING AND APPROPRIATION DATA---See CONTINUATION Page---26. TOTAL AWARD AMOUNT (For Govt. Use Only)---X---27a. SOLICITATION INCORPORATES BY REFERENCE FAR 52.212-1, 52.212-4. FAR 52.212-3 AND 52.212-5 ARE ATTACHED. ADDENDA", "chunk_id": 5}, {"chunk": "X---ARE---ARE NOT ATTACHED.27b. CONTRACT/PURCHASE ORDER INCORPORATES BY REFERENCE FAR 52.212-4. FAR 52.212-5 IS ATTACHED. ADDENDAARE---ARE NOT ATTACHED---28. CONTRACTOR IS REQUIRED TO SIGN THIS DOCUMENT AND RETURN _______________ COPIES TO ISSUING OFFICE. CONTRACTOR AGREES TO FURNISH AND DELIVER ALL ITEMS SET FORTH OR OTHERWISE IDENTIFIED ABOVE AND ON ANY ADDITIONAL SHEETS SUBJECT TO THE TERMS AND CONDITIONS SPECIFIED29. AWARD OF CONTRACT: REF. ___________________________________ OFFER DATED ________________________________. YOUR OFFER ON SOLICITATION (BLOCK 5), INCLUDING ANY ADDITIONS OR CHANGES WHICH ARE SET FORTH HEREIN IS ACCEPTED AS TO ITEMS:", "chunk_id": 6}, {"chunk": "30a. SIGNATURE OF OFFEROR/CONTRACTOR---31a. UNITED STATES OF AMERICA (SIGNATURE OF CONTRACTING OFFICER)---30b. NAME AND TITLE OF SIGNER (TYPE OR PRINT)---30c. DATE SIGNED---31b. NAME OF CONTRACTING OFFICER (TYPE OR PRINT)---Schuman, Michael---31c. DATE SIGNED---AUTHORIZED FOR LOCAL REPRODUCTION PREVIOUS EDITION IS NOT USABLE---STANDARD FORM 1449 Prescribed by GSA - FAR (48 CFR) 53.212---(REV. NOV 2021)030ADV23Q0051", "chunk_id": 7}, {"chunk": "Table of Contents---SECTION A.....................................................................................................................................................................1A.1 SF 1449 SOLICITATION/CONTRACT/ORDER FOR COMMERCIAL PRODUCTS AND COMMERCIAL SERVICES .....1---SECTION B - SUPPLIES OR SERVICES AND PRICE/COSTS..................................................................................................4B.1 PRICE/COST SCHEDULE........................................................................................................................................4 ITEM INFORMATION ...........................................................................................................................................4 B.2 LC52.212-1 ORDER OF PRECEDENCE (JUL 2017)................................................................................................4 B.3 LC52.216-3 CONTRACT TYPE (JUN 2016) ...........................................................................................................4SECTION C - DESCRIPTION/SPECIFICATIONS/STATEMENT OF WORK..............................................................................5SECTION D - PACKAGING AND MARKING.......................................................................................................................9D.1 LC52.232-2 SCHEDULE OF PAYMENTS (JUN 2015) ............................................................................................9 D.2 LC52.211-1 DELIVERIES (APR 2015) ...................................................................................................................9 D.3 LC52.231-1 PAYMENT OF POSTAGE FEES (MAY 2015) ......................................................................................9SECTION F - DELIVERIES OR PERFORMANCE.................................................................................................................10F.1 DELIVERY SCHEDULE ..........................................................................................................................................10 F.2 LC52.215-5 PLACE AND PERIOD OF PERFORMANCE (JAN 2019) .....................................................................10SECTION G - CONTRACT ADMINISTRATION DATA ........................................................................................................11G.1 LC52.201-3 CONTRACT ADMINISTRATION (AUG 2015)...................................................................................11 G.2 LC52.232-1 LIBRARY OF CONGRESS INVOICE INSTRUCTIONS (DEC 2022).......................................................12SECTION H - SPECIAL CONTRACT REQUIREMENTS........................................................................................................13H.1 LC52.201-1 CONTRACTING OFFICER'S REPRESENTATIVE (COR) APPOINTMENT AND AUTHORITY (JAN 2016) .................................................................................................................................................................................13 H.2 LC52.203-1 CONTRACTOR PUBLICITY (OCT 2013) ...........................................................................................13 H.3 LC52.204-3 INFORMATION SYSTEMS SECURITY (SEP 2018) ............................................................................14 H.4 LC52.204-4 CONTRACTOR EMPLOYEE FITNESS (JAN 2022).............................................................................14 H.5 LC52.204-27 HANDLING OF FEDERAL RECORDS (JUL 2021) ............................................................................15 H.6 LC52.237-1 KEY PERSONNEL (AUG 2014) ........................................................................................................17 H.7 LC52.239-1 INFORMATION SECURITY (APR 2021)...........................................................................................17 H.8 LC52.239-2 SYSTEMS DEVELOPMENT LIFE CYCLE (SEP 2018) .........................................................................19PART II - CONTRACT CLAUSES .....................................................................................................................................20SECTION I - CONTRACT CLAUSES ................................................................................................................................20I.1 LC52.212-4 CONTRACT TERMS AND CONDITIONS - COMMERCIAL ITEMS (DEV) (FEB 2016) ...........................20 I.2 LC52.212-5 CONTRACT TERMS AND CONDITIONS REQUIRED TO IMPLEMENT STATUTES OR EXECUTIVE ORDERS - COMMERCIAL ITEMS (DEV) (MAY 2015) .................................................................................................20 I.3 LC52.232-25 PROMPT PAYMENT (DEV) (JUL 2013) ..........................................................................................20 I.4 LC52.233-1 52.233-1 (DEV) DISPUTES (MAY 2014)...........................................................................................21PART III - LIST OF DOCUMENTS, EXHIBITS AND OTHER ATTACHMENTS ........................................................................22", "chunk_id": 8}, {"chunk": "Page 2---030ADV23Q0051SECTION J - LIST OF ATTACHMENTS .............................................................................................................................22SECTION L - INSTRUCTIONS, CONDITIONS, AND NOTICES TO OFFERORS ......................................................................23L.1 LC52.233-2 PROTESTS TO THE LIBRARY OF CONGRESS (DEC 2013).................................................................23 L.2 Instructions, Conditions, and Notices to Schedule Contractors........................................................................23SECTION M - EVALUATION FACTORS FOR AWARD .......................................................................................................26", "chunk_id": 9}, {"chunk": "Page 3---030ADV23Q0051Section B---SECTION B - SUPPLIES OR SERVICES AND PRICE/COSTS---B.1 PRICE/COST SCHEDULE---ITEM INFORMATION---ITEM NUMBE R---DESCRIPTION OF SUPPLIES/SERVICES---QUANTITY UNIT---UNIT PRICE---AMOUNT---00011.00 LOT_______________ __________________ ___IMS Software Enhancements, O&M, and Technical Support Contract Period: Base POP Begin: 04-17-2023 POP End: 04-16-2024 See Sections C.3.1, C.3.2, and C.3.3 for requirements.", "chunk_id": 10}, {"chunk": "GRAND TOTAL---_______________ ___B.2 LC52.212-1 ORDER OF PRECEDENCE (JUL 2017)This is an order pursuant to contract GSA MAS # TBD and the terms and conditions set forth herein. The terms and conditions of the contract are incorporated into this order along with the terms and conditions set forth herein. In the event of a conflict, the Library’s terms and conditions take precedence.", "chunk_id": 11}, {"chunk": "(End of Clause)---B.3 LC52.216-3 CONTRACT TYPE (JUN 2016)This is a Firm-Fixed-Price contract.(End of Clause)---Page 4---030ADV23Q0051Section C---SECTION C - DESCRIPTION/SPECIFICATIONS/STATEMENT OF WORK---Statement of Work (SOW)---National Library Service for the Blind and Print Disabled (NLS) Inventory Management System (IMS) Enhancements & Technical Support1.OVERVIEW / BACKGROUND:NLS develops library materials and services, including audio books, proprietary audio players, braille in digital formats, and various operating platforms to the blind and print disabled patrons in the USA and abroad. Patrons currently read these audio books using purpose-built audio players that are loaned free of charge, or patron Bring Your Own Device (BYOD) (smart-phones, tablets) using an NLS reading application.The goal is to procure the services of a software support team to enhance and maintain NLS’ Inventory Management System (IMS) built with ServiceNow Asset management module and Nuvolo software. The development/support team will support and enhance IMS in a Library cloud environment and operate the system. The net result will be a robust perpetual engine that will continue to allow NLS to get visibility, control of assets, scale growth appropriately, and effect customer service delivery and product catalog decisions. The work under this requirement shall consist of performing maintenance, technical support and enhancements.NLS’ IMS was previously developed and implemented via Library of Congress Order LCCIO20F0125, awarded to Accenture Federal Services via GSA Schedule Contract GS-35F-540GA.2.", "chunk_id": 12}, {"chunk": "SCOPE---The Contractor shall provide technical support, software enhancements, and Operations and Maintenance (O&M) services for the duration of the contract.3.REQUIREMENTS---The contractor shall provide   Operations and Maintenance ServicesSoftware Enhancements that are WCAG 2.2 compliant Technical Services for bug/defect fixes Training on any new functionality and enhancements", "chunk_id": 13}, {"chunk": "3.1 Software Enhancements---The contractor shall provide software enhancements requested by the NLS. The contractor will follow the Agile Development Management Plan (ADMP) to plan, develop, test, and deploy the requested enhancements. A notional Sprint Plan is included as attachment J1. The Contractor shall also provide technical services to fix newly discovered bugs/defects. The below requirements correlate with and will be tracked via the attached notional sprint plan.", "chunk_id": 14}, {"chunk": "Page 5---030ADV23Q0051Section C---1. The contractor shall update the existing NLS IMS barcode functionality to support hand held scanner real-time barcoding integration. The hand-held scanner solution shall allow warehouse staff the ability to update existing bin quantity levels, and add quantities to new bins/locations. This will allow for real-time updates to the system inventory levels and allow warehouse staff to easily engage in re-inventory activities across a wider scale. 2. Enhance the order fulfilment process by integration of WOW2 and USPS to deliver intelligent barcode service.The contractor shall update the current shipment solution by adding new fields and use web services to get print ready label for free matter and non-free matter packages3. The contractor shall provide WCAG 508 compliant Wish list feature in the WOW2 portal. The contractor shall update the item ordering process by allowing users to add, delete, hold items in a cart for future processing4. The contractor shall perform ServiceNow upgrades in all WOW2 environments 5. The contractor shall perform Nuvolo upgrades in all WOW2 environments 6. The contractor shall provide new KPI reports and enhance dashboard 7. The contractor shall continue to enhance WOW2 portal usability, accessibility for blind users, satisfy WCAG 2.2", "chunk_id": 15}, {"chunk": "compliance---8. The contractor shall continue to enhance automated workflows, notifications and alerts 9. The contractor shall enhance the individual facilities parts module to support device tracking and management 10. The contractor shall enhance the dashboard to include device repair reports 11. The contractor shall enhance the individual facilities parts module to support device repair data analysis, datatransformation and migration from external circulation system to the existing NLS IMS.12. The contractor shall create workflows to support repair device assignment", "chunk_id": 16}, {"chunk": "3.2 Training---The contractor shall provide virtual training and self-styled on demand learning tools for Library users. This training shall train the users on all necessary functions to perform all administrative functions for any implemented enhancements. The contractor shall conduct the training and provide all training material in an accessible manner such that a visually impaired or blind user could use the materials and successfully complete the training.", "chunk_id": 17}, {"chunk": "3.3 Operations, Maintenance, and Technical Support---The contractor shall provide technical support services via telephone and email during normal business hours, defined in Section F. The contractor technical support services will support the users performing administrative functions in the IMS.The contractor shall respond to all support requests, which are tracked via email to the contractor, within 24 hours of submission of the support request from either NLS or the third-party company contracted with NLS to administer the inventory management system. The contractor shall make a good faith effort to resolve the support request within 72 hours of submission. If a support request cannot be resolved within 72 hours, the contractor will provide an explanation as to the reason for being unable to resolve the issue and provide an estimate as to the date in which the support request will be resolved.All support requests both in progress and resolved, shall be included as part of the contractor's monthly status", "chunk_id": 18}, {"chunk": "report.---4CONTRACT PERFORMANCE---Page 6---030ADV23Q0051Section C---The contractor shall submit a Project Management Plan (PMP) aligned to the Library’s agile development practices to support the contractor’s proposed approach to agile software development and management of the technical process, scoping and envisioning for the projects, descriptions of resources, management team structure, team makeup, reporting process, schedule, risk management approach, and prioritization of work. A copy of the Library’s Agile Methodology is included in Attachment J2 – Agile at the Library. As part of the PMP, the Contractor shall document the management of the User Story Determination Process for determining the complexity of developing, estimating, integrating, and/or delivering Technical Services. The PMP shall be in a contractor-specified format.The contractor shall provide a notional release schedule which maps the proposed iteration cycle to the Period of Performance. This release schedule shall include relevant governance process checkpoints such as Technical Reviews and Iteration Releases, as well as agile methodology functions such as Iteration Planning, Iteration Reviews, and Retrospectives.", "chunk_id": 19}, {"chunk": "4.1 Schedule of Events and Deliverables---Contractor is required to submit a monthly status report detailing all deliverables completed in the report month.Description of Event/Deliverable---Due Date---Kickoff---Within 10 business days of project award---Final Project Management Plan (PMP)---Within twenty business days of project kickoff---", "chunk_id": 20}, {"chunk": "Quality Control Plan (QCP)---Within twenty business days of project kickoff---Prioritized Sprint Backlog---At the beginning of every sprint---Deployable, Production-Ready Software---At conclusion of every sprint---Sprint Demonstration---At conclusion of every sprint---Training and System Documentation---Before every major release, as part of the applicable sprint---Accessibility Report---", "chunk_id": 21}, {"chunk": "Before every major release---Operations, Maintenance, and Technical Support---Ongoing throughout the period of performance4.2 The contractor shall develop and maintain an effective quality control program to ensure services are performed in accordance with this contract. The contractor shall develop and implement procedures to identify, prevent, and ensure non-recurrence of defective services. The contractor’s quality control program is the means by which it assures itself and the Government that its work complies with the requirement of the contract.", "chunk_id": 22}, {"chunk": "Quality Control---4.2.1 Quality Control Plan The contractor shall describe a proposed Quality Control Plan (QCP) and Performance Measurement approach, including how proposed performance standards will be monitored, evaluated, and reported. The purpose of the QCP is to provide the Library with an understanding of how measures and metrics will be applied based on the proposed technical solution.", "chunk_id": 23}, {"chunk": "Page 7---030ADV23Q0051Section C---The Library will approve or deny the rationale for the proposed performance standards and performance measurement methodology and assess whether the total solution will ensure that the performance standards are met.4.2.2 The contractor shall ensure proper control and coordination of all deliverables to ensure they are on time. Unless otherwise stated, the Government will review deliverables and notify the contractor of acceptance or non-acceptance within 5 business days. Representatives of the contractor shall meet with the COR and other members of the Government as necessary to review status of deliverables.", "chunk_id": 24}, {"chunk": "Inspection and Acceptance---4.2.3 Notice Regarding Late Delivery The Contractor shall notify the COR, or other authorized representative designated in each Contract, as soon as it becomes apparent to the Contractor that a scheduled delivery will be late. The Contractor shall include in the notification the rationale for late delivery, the expected date for the delivery, and the project impact of the late delivery. Such notification in no way limits any Government contractual rights or remedies, including, but not limited to, termination.5", "chunk_id": 25}, {"chunk": "GOVERNMENT FURNISHED PROPERTY---The contractor will have access to Library of Congress information and systems in order to complete required duties. The Library will provide contractor’s access through its Citrix application.6STAFFING---6.1Staff and Contractor Qualifications---Contractor personnel provided to LOC, under this SOW shall have the background and experience necessary to perform the tasks outlined in the SOW6.2", "chunk_id": 26}, {"chunk": "Key Personnel---The following position is considered key personnel:Technical Consultant---The contractor technical consultant shall be responsible for developing and applying advanced methods in the configuration and customization of COTS solutions to meet business requirements. Provides technical expertise in creation of specification/requirements, system configurations, and maintenance/ design/build /test phases of systems and applications. The technical consultant must be a ServiceNow Certified System Administrator or Certified Implementation Specialist.7", "chunk_id": 27}, {"chunk": "CONTRACTOR TRAVEL---All work to be performed is expected to be remote. Travel is not authorized and will not be reimbursed by the Library.(End of Statement of Work)---Page 8---030ADV23Q0051Section D---SECTION D - PACKAGING AND MARKING---D.1 LC52.232-2 SCHEDULE OF PAYMENTS (JUN 2015)The contractor must submit invoices for payment upon delivery of the items or successful performance of the events identified below pursuant to the standards and acceptance criteria defined in this contract.The contractor shall deliver monthly status reports detailing all work completed in the stated month. These details shall include all O&M, technical support, and sprint deliverables. The COR will review each report to determine all work has been completed in accordance with the Library’s and Contractor’s quality standards outlined in the Statement of Work. The contractor may invoice upon Government acceptance of each monthly report. Associated prices for deliverables are stated below:", "chunk_id": 28}, {"chunk": "Description---Qty---Unit Amount---Monthly O&M Services---12 Mo---$______________ per Month4 Week Sprint---12 EA---$______________ per Sprint, upon delivery and Government acceptance.---(End of Clause)---D.2 LC52.211-1 DELIVERIES (APR 2015)All deliveries submitted to the CO or the COR or other Library personnel designated to receive deliverables shall clearly indicate the following information:a. Agency/Requiring Library Service Unit and MAIL STOP/Room Number b. Description of information/data being submitted c. Contract Number d. Contractor Name and Address", "chunk_id": 29}, {"chunk": "(End of Clause)---D.3 LC52.231-1 PAYMENT OF POSTAGE FEES (MAY 2015)All postage and fees related to submission of information, including forms, and reports, etc., to the Contracting Officer or Contracting Officer’s Representative (COR) or other persons designated to receive, shall be paid by the Contractor.", "chunk_id": 30}, {"chunk": "(End of Clause)---Page 9---030ADV23Q0051Section F---SECTION F - DELIVERIES OR PERFORMANCE---F.1 DELIVERY SCHEDULE---ITEM NUMBER---QUANTITY DELIVERY DATE---00011.00 04-16-2024F.2 LC52.215-5 PLACE AND PERIOD OF PERFORMANCE (JAN 2019) Place of Performance: All work to be performed shall takeplace remotely at the contractor's facilities.---The overall period of performance shall be as stated in section B.The contractor is responsible for determining its hours of operation in fulfilling the requirements of this contract. The Library’s standard operating hours are from 8:30 AM through 5:30 PM, Monday through Friday, excluding Federal holidays. The contractor shall coordinate with the COR for any work to be conducted at Library facilities.", "chunk_id": 31}, {"chunk": "(End of Clause)---Page 10---030ADV23Q0051Section G---SECTION G - CONTRACT ADMINISTRATION DATA---G.1 LC52.201-3 CONTRACT ADMINISTRATION (AUG 2015)This contract will be administered by:Library Contracting Officer: Schuman, Michael---Address: Contracts & Grants Directorate---Library of Congress---LA 325Washington DC 20540-9411---Phone: (202) 707-1088Email: mschuman@loc.govLibrary Contract Specialist: Cartheuser, Quinn---Address: Contracts & Grants Directorate---", "chunk_id": 32}, {"chunk": "Library of Congress---LA 325Washington DC 20540-9411---Phone: (202) 707-2339Email: qcart@loc.govLibrary Contracting Officer Representative:---Address:---Page 11---030ADV23Q0051Section G---Phone:---Email:---Contractor Contract Administrator: Provided at time of awardAddress: Provided at time of awardProvided at time of awardProvided at time of awardProvided at time of awardPhone:---Email:---G.2 LC52.232-1 LIBRARY OF CONGRESS INVOICE INSTRUCTIONS (DEC 2022)The Contractor must prepare and submit invoices electronically to: https://www.ipp.gov. The Contractor may submit payment requests using other than electronic means only when alternate procedures are authorized by the contracting officer in writing. Assistance is available via the IPP Help Desk via email at: ippcustomersupport@fiscal.treasury.gov or by commercial telephone at (866) 973-3131. Invoices shall contain the information required in FAR 52.212-4, paragraph (g).", "chunk_id": 33}, {"chunk": "(End of Clause)---Page 12---030ADV23Q0051Section H---SECTION H - SPECIAL CONTRACT REQUIREMENTS---H.1 LC52.201-1 CONTRACTING OFFICER'S REPRESENTATIVE (COR) APPOINTMENT AND AUTHORITY (JAN 2016)(a) Performance of work under this contract is subject to the technical direction of the COR. The term “technical direction” includes, without limitation, direction to the contractor that directs or redirects the labor effort, shifts the work between work areas or locations, and/or fills in details and otherwise serves to ensure that tasks outlined in the contract are accomplished satisfactorily.(b) Technical direction must be within the scope of the contract specification(s)/work statement. The COR does not have authority to issue technical direction that:", "chunk_id": 34}, {"chunk": "(1) Constitutes additional work outside the contract specification(s)/work statement;---(2) Constitutes a change as defined in the “Changes” clause of this contract;(3) Causes an increase or decrease in the contract price, or the time required for contract performance;(4) Changes any of the terms, conditions, or specification(s)/work statement of the contract;(5) Interferes with the contractor's right to perform under the terms and conditions of the contract; or(6) Directs, supervises or otherwise controls the actions of the contractor's employees.(c) Technical direction may be oral or in writing. The COR must confirm oral direction in writing within five workdays, with a copy to the Contracting Officer.(d) The Contractor shall proceed promptly with performance resulting from the technical direction issued by the COR. If, in the opinion of the contractor, any direction of the COR or the designated representative falls within the limitations of (b) above, the contractor shall immediately notify the Contracting Officer no later than the beginning of the next Government work day.(e) Failure of the Contractor and the Contracting Officer to agree that technical direction is within the scope of the contract shall be subject to the terms of the “Disputes” clause of this contract.", "chunk_id": 35}, {"chunk": "(End of Clause)---H.2 LC52.203-1 CONTRACTOR PUBLICITY (OCT 2013)The Contractor, or any entity or representative acting on behalf of the Contractor, may not refer to the equipment or services furnished pursuant to the provisions of this contract in any news release or commercial advertising, or in connection with any news release or commercial advertising, without first obtaining explicit written consent to do so from the Contracting Officer. Should any reference to such equipment or services appear in any news release or", "chunk_id": 36}, {"chunk": "Page 13---030ADV23Q0051Section H---commercial advertising issued by or on behalf of the Contractor without the required consent, the Government will consider institution of all remedies available under applicable law.(End of Clause)---H.3 LC52.204-3 INFORMATION SYSTEMS SECURITY (SEP 2018)(1) Computer Security Policy. The Library requires anyone using or accessing its digital assets (including networks, servers, workstations, systems, data, web pages, and email) to protect them and use them only for official business, and only in accordance with Library regulations and applicable Library bargaining agreements. Unauthorized or inappropriate use may be grounds for termination or other contractual remedy.(2) Privacy Policy. No one has the right to privacy while using any Library computer system, including internet or email services. Usage may be monitored.(3) Level of Access. The Host Office will determine the level of access to the Library’s IT equipment, staff and software needed to successfully perform under this Contract. Access may include, for example, email, word processing, internet, and intranet.(4) Mandatory IT Security Training. Contractor personnel must successfully complete mandatory information systems security training prior to use of or access to any of the Library’s digital assets. The required training is available online at http://www.loc.gov/extranet/cld/. Contractor staff with access to Library digital assets shall complete the information systems security training annually. The training is available on the Library intranet at: http://www.loc.gov/staff/cld/.", "chunk_id": 37}, {"chunk": "(End of Clause)---H.4 LC52.204-4 CONTRACTOR EMPLOYEE FITNESS (JAN 2022)“Contractor employee fitness” means fitness based on character and conduct for work for or on behalf of the Government as a contractor employee.Work under this contract is unclassified. However, the Library of Congress has a contractor employee fitness program, which includes background investigations of contractor personnel who will have 1) regular, ongoing, unescorted access to the Library’s buildings, grounds, or collections, 2) access to Library information technology systems, and/or 3) access to Library information not available to the public including information determined to be Controlled Unclassified Information (CUI) to ensure they meet basic standards of honesty and trustworthiness pursuant to Library regulations.(1) Any access to non-public Library facilities and information technology systems will require completion and successful vetting of a security application request (release forms, fingerprints, and, if applicable, E-QIP background investigation). Contracts should anticipate a minimum of two weeks for the process, provided no adverse or incomplete information is received.(2) The Library does not determine the fitness of employees to work for the contractor firm that hires them. The Library’s interest is in determining whether contractor personnel should be granted greater access than the general public to Library facilities, Library information technology systems and/or non-public Library information.", "chunk_id": 38}, {"chunk": "Page 14---030ADV23Q0051Section H---(3) To facilitate the fitness determination, contractors shall submit complete and accurate information as identified on the e-qip site at: www.opm.gov/e-qip. Contractors should anticipate a minimum of two weeks for the process, provided all requested information is timely, accurate and complete and that no adverse information is received.(4) The contractor will ensure the Library’s Personnel Security Division is notified of all changes to personnel performing work on this contract. The Personnel Security Division can be notified at the following email address: PSD@loc.gov and contacted via phone at: (202) 707-5618.(5) The fact that the Library may conduct background investigations on assigned contractor personnel does not relieve the contractor of the responsibility to provide qualified, reliable personnel of sound character and conduct.(6) The Library may require removal of contractor staff from Library facilities and revocation of access to Library information technology systems and non-public Library information if investigative results raise concerns regarding a contractor employee’s fitness. In such cases, the Contracting Officer or Contracting Officer Representative (COR) will notify the contractor of the unfit determination and need for the contractor employee to return all government equipment such as badges, keys and network tokens if issued. Contractor management staff may be required to escort the contractor employee from the premises.", "chunk_id": 39}, {"chunk": "(End of Clause)---H.5 LC52.204-27 HANDLING OF FEDERAL RECORDS (JUL 2021)(a) Definitions “Records,” as defined in 36 C.F.R. § 703.4(a), includes all books, papers, maps, photographs, reports, and other documentary materials, exclusive of materials in the Library’s collections, regardless of physical form or characteristics, made or received and under the control of the Library in pursuance of law or in connection with the transaction of public business, and retained, or appropriate for retention, by the Library as evidence of the organization, functions, policies, decisions, procedures, operations, or other activities of the government or because of the informational value of data contained therein. The term refers only to such items in being and under the control of the Library. It does not include the compiling or procuring of a record, nor does the term include objects or articles, such as furniture, paintings, sculpture, three-dimensional models, structures, vehicles, and equipment. All data created for Government use and delivered to, or falling under the legal control of, the Government are Federal records subject to the provisions of 44 U.S.C. chapters 21, 29, 31, and 33, the Privacy Act of 1974 (5 U.S.C. 552a), as amended, and Library of Congress regulations at 36 CFR Part 703.", "chunk_id": 40}, {"chunk": "(b) Requirements---1. Contractor shall comply with all applicable records management laws and regulations, as well as National Archives and Records Administration (NARA) records policies, including but not limited to the Federal Records Act (44 U.S.C. chs. 21, 29, 31, 33), NARA regulations at 36 CFR Chapter XII Subchapter B, Library of Congress regulations at 36 CFR Part 703 and those policies associated with the safeguarding of records covered by the Privacy Act of 1974 (5 U.S.C. 552a). These policies include the preservation of all records, regardless of form or characteristics, mode of transmission, or state of completion.2. In accordance with 36 CFR 1222.32, Contractor shall manage and schedule records for disposition only as permitted by statute or regulation.", "chunk_id": 41}, {"chunk": "Page 15---030ADV23Q0051Section H---3. The Contractor shall not retain, use, sell, or disseminate copies of any deliverable that contains information covered by the Privacy Act of 1974 or which is exempted from public disclosure by 36 C.F.R. 703.5.4. The Library of Congress shall own the rights to all data and records produced as part of this contract. All deliverables under the contract are the property of the U.S. Government for which the Library of Congress shall have unlimited rights to use, dispose of, or disclose such data contained therein as it determines to be in the public interest. Any Contractor rights in the data or deliverables must be identified as required by FAR 52.227-11 through FAR 52.227- 20.5. In accordance with 36 CFR 1222.32, Contractor shall maintain and manage all records in accordance with Federal law. Electronic records and associated metadata must be accompanied by sufficient technical documentation to permit understanding and use of the records and data.6. The Contractor shall only remove records from the legal custody of the Library of Congress or destroy them in accordance with the provisions of the agency records schedules and with the written concurrence of the Head of the Contracting Activity. Willful and unlawful destruction, damage or alienation of Federal records is subject to the fines and penalties imposed by 18 U.S.C. 2701. In the event of any unlawful or accidental removal, defacing, alteration, or destruction of records, Contractor must report the event to the Contracting Officer.7. The Contractor shall ensure that the appropriate personnel, administrative, technical, and physical safeguards are established to ensure the security and confidentiality of this information, data, documentary material, records and/or equipment is properly protected. The Contractor shall not remove material from Government facilities or systems, or facilities or systems operated or maintained on the Government’s behalf, without the express written permission of the Head of the Contracting Activity. When information, data, documentary material, records and/or equipment is no longer required, it shall be returned to Library of Congress control unless otherwise directed by the Contracting Officer.8. Items returned to the Government shall be hand carried, mailed, emailed, or securely electronically transmitted to the Contracting Officer or address prescribed in the contract vehicle in accordance with instructions provided by the Contracting Officer. Destruction of records is EXPRESSLY PROHIBITED unless in accordance with Paragraph (4).9. The Contractor shall not create or maintain any records containing any non-public Library of Congress information that are not specifically authorized by the contract.10. All Contractor employees assigned to this contract who create, work with, receive, store, or otherwise handle records shall take Library of Congress-provided records management training. The Contractor shall be responsible for confirming training has been completed.11. The Contractor shall obtain the Contracting Officer’s approval prior to engaging in any contractual relationship (sub-contractor) in support of this contract requiring the disclosure of information, documentary material and/or records generated under, or relating to, contracts.12. The Contractor (and any sub-contractor) shall abide by Government and Library of Congress guidance for protecting sensitive, proprietary information, classified, and controlled unclassified information. The Contractor shall immediately notify the Contracting Officer upon discovery of any inadvertent or unauthorized disclosures of information, data, documentary materials, records or equipment.", "chunk_id": 42}, {"chunk": "(c) Flowdown of requirements to subcontractors---Page 16---030ADV23Q0051Section H---1. The Contractor shall incorporate the substance of this clause, its terms and requirements including this paragraph, in all subcontracts under this contract vehicle, and require written subcontractor acknowledgment of same.2. Violation by a subcontractor of any provision set forth in this clause will be attributed to the Contractor.", "chunk_id": 43}, {"chunk": "(End of Clause)---H.6 LC52.237-1 KEY PERSONNEL (AUG 2014)The personnel designated as key personnel in this contract are considered to be essential to the work being performed hereunder. At least 30 days prior to diverting any of the specified individuals to other programs or contracts or as soon as possible if an individual must be replaced, for example, as a result of leaving the employ of the contractor, the contractor shall notify the contracting officer and identify proposed substitutions. No diversion or substitution shall be made by the contractor without written consent of the contracting officer.The following personnel have been identified as Key Personnel in the performance of this contract:", "chunk_id": 44}, {"chunk": "Position/Labor Category---Name---Technical Consultant---(End of Clause)---H.7 LC52.239-1 INFORMATION SECURITY (APR 2021)The work to be conducted is considered Controlled Unclassified Information (CUI) pursuant to National Institute of Standards and Technology (NIST) Special Publication (SP) 800-53 (rev 4) or current version. The Contractor shall ensure that all non-public Library information processed under this contract shall be protected from unauthorized use and mishandling by the Contractor. Information includes both hard copy (paper) formats and soft copy (stored in electronic form, e.g., hard disks, tapes, flash drives, CD-ROM/CD-R, etc.)(a) The Contractor shall store hard copies and soft copies contained on removable media (e.g., tapes, floppy disks, flash drives, CD-ROM/CD-R, etc.) in a government-approved storage container per the direction of the Contracting Officer Representative (COR) or the Library of Congress Project Manager when not under the direct control of Contractor Key Personnel.(b) The Contractor shall treat any information developed on security vulnerabilities and any Government provided non- public information as “CUI”.(c) The Contractor personnel shall label and protect this information as “Security Category: Moderate”, placing this designation in the footer.", "chunk_id": 45}, {"chunk": "Page 17---030ADV23Q0051Section H---(d) The Contractor shall ensure that all documents designated “Security Category: Moderate”, “Security Category: High” and “Limited Official Use Only” are not emailed to or from an external email system. These documents may only be emailed between Library of Congress email accounts, or within a secured corporate email network.(e) The Contractor shall ensure that all documents designated “Security Category: Moderate”, “Security Category: High” and “Limited Official Use Only” are shredded, burned, or otherwise destroyed before being disposed of in accordance with applicable corporate and federal records management policies.(f) The Contractor shall dispose of all documents designated “Security Category: Moderate”, “Security Category: High” and “Limited Official Use Only” remaining in the Contractor’s possession at the end of the contract term.(g) The Contractor shall ensure that all Contractor workstations used to process Library information utilizes anti-virus and anti-spyware utilities that are configured to continuously monitor and to automatically update as well as having automatic operating system patching in place.(h) The Contractor shall ensure that all Contractor workstations used to process Library information employ a firewall that can either be software running on the workstation or a stand-alone firewall that protects the workstation from unauthorized access from any other devices, including devices on the Contractor’s corporate network.(i) The Contractor shall ensure that all Library information that is labeled “Security Category: Moderate”, “Security Category: High” and “Limited Official Use Only” is encrypted using a Federal Information Processing Standards Publication (FIPS) 140-2 validated application configured in FIPS mode. This includes information stored on internal hard drives and removable devices (e.g., CD-Rs, flash drives, etc.)(j) The Contractor must provide a written list of anti-virus, anti-spyware, firewall, encryption products, versions and proof of licenses, along with the automatic operating system patching status, MAC address (if applicable) and user name for each system being used to process Library information.(k) In accordance with NIST SP 800-61 (rev 2, as updated), the Contractor shall report to infosec@loc.gov, the Contracting Officer, and the COR any adverse events (adverse events are currently defined as events with a negative consequence, such as system crashes, packet floods, unauthorized use of system privileges, unauthorized access to sensitive data, and execution of malware that destroys data) that are computer security related or computer security incidents (computer security incident is currently a violation or imminent threat of violation of computer security polices, acceptable use policies, or standard security practices) concerning Library CUI within 24-hours of its discovery. The contractor shall coordinate its response to such an event or incident with the Library.(l) The Contractor shall not provide any government-furnished non-public documents, information, or licensed material in any form to anyone other than the Contracting Officer, the COR, or the Library of Congress Project Manager without the written approval of the Contracting Officer, the COR, or the Library of Congress Project Manager during the period of this contract or at any time afterwards.(m) The Contractor shall not release any government documents or information related to IT Security in any form without the written approval of the Library’s IT Security Group.(n) The Contractor shall ensure that all Contractor personnel sign nondisclosure agreements (NDAs).(o) The Contractor shall ensure that all Contractor personnel complete the Library of Congress IT Security Awareness Training on an annual basis.", "chunk_id": 46}, {"chunk": "Page 18---030ADV23Q0051Section H---(End of Clause)---H.8 LC52.239-2 SYSTEMS DEVELOPMENT LIFE CYCLE (SEP 2018)The Information Technology to be provided under this contract is subject to the procedures established in the Library’s Systems Development Life Cycle (SDLC) as follows:(a) Requirements: The Contractor shall gather and analyze requirements and produce a system requirements document (SRD) accordingly.(b) Design: The Contractor shall perform design analysis and complete a Systems Design Document which satisfies the requirements in the aforementioned SRD.(c) Development: The Contractor shall develop, customize and/or configure the system according to system requirements and design specifications.(d) Testing: The Contractor shall test the solution to ensure it satisfies all requirements, including security requirements documented in Library of Congress Directive (LCD) 5-410.1, Information Technology Security Policy. The Contractor shall remediate any identified vulnerabilities and weaknesses in accordance with LCD 5-410.1.(e) Implementation: The Contractor shall support implementation and deployment of the tested solution into the Library’s production environment.(f) Documentation: The Contractor must either use the Library’s SDLC templates, which will be provided by the COR upon request, or use an alternative format which satisfies all SDLC requirements as stated in (a) through (e) above. The COR will approve all SDLC deliverables.", "chunk_id": 47}, {"chunk": "(End of Clause)---Page 19---030ADV23Q0051Section I---PART II - CONTRACT CLAUSES---SECTION I - CONTRACT CLAUSES---I.1 LC52.212-4 CONTRACT TERMS AND CONDITIONS - COMMERCIAL ITEMS (DEV) (FEB 2016)FAR 52.212-4, Contract Terms and Conditions – Commercial Items. The clause is modified as follows:(1) The Library will apply FAR 52.243-1 (Changes – Fixed Price) to any changes under this contract instead of section (c).(2) The reference in section (d) to the Disputes clause at FAR 52.233-1 refers to the clause as modified by the Library.(3) The references in section (g)(2) and (i)(2) to the Prompt Payment Act (31 U.S.C. 3903) and prompt payment regulations at 5 C.F.R. part 1315 refer instead to the Prompt Payment clause at FAR 52.232-25 as modified by the Library.", "chunk_id": 48}, {"chunk": "(End of Clause)---I.2 LC52.212-5 CONTRACT TERMS AND CONDITIONS REQUIRED TO IMPLEMENT STATUTES OR EXECUTIVE ORDERS - COMMERCIAL ITEMS (DEV) (MAY 2015)FAR 52.212-5, The clause is modified as follows:(1) The Librarian of Congress has the same rights and access provided to the Comptroller General in FAR 52.212-5.", "chunk_id": 49}, {"chunk": "(End of Clause)---I.3 LC52.232-25 PROMPT PAYMENT (DEV) (JUL 2013)The Library of Congress is not an agency subject to the Prompt Payment Act. 31 U.S.C. 3901(a)(1). The clause is modified as follows:(1) The following new paragraph (iv) is added to the conditions for paying interest penalty payments in section (a)(4): “(a)(4)(iv) The contract or purchase order contained a provision that expressly required the Library of Congress to pay an interest penalty.”(2) The reference in section (a)(5)(ii) to the Disputes clause at FAR 52.233-1 refers to the clause as modified by the Library.(3) Section (a)(6) is replaced with the following: “Interest penalty payments shall be handled in accordance with the Prompt Payment clause at FAR 52.232-25 as modified by the Library.”", "chunk_id": 50}, {"chunk": "Page 20---030ADV23Q0051Section I---(4) Section (b) relating to Contract Financing Payment is deleted.(End of Clause)---I.4 LC52.233-1 52.233-1 (DEV) DISPUTES (MAY 2014)To reflect the provisions of the Legislative Branch Appropriations Act, 2008 (Pub. L. 110-161, div. H., title I, § 1501, Dec. 26, 2007, 121 Stat. 2249, 31 U.S.C. 702 note), the clause is modified as follows:The amount in sections (c), (d)(2)(i), and (e) is $50,000 instead of $100,000.See also regulations of the Government Accountability Office Contract Appeals Board at 4 C.F.R. part 22.", "chunk_id": 51}, {"chunk": "(End of Clause)---Page 21---030ADV23Q0051Section J---PART III - LIST OF DOCUMENTS, EXHIBITS AND OTHER ATTACHMENTS---SECTION J - LIST OF ATTACHMENTS---Description---Date---Number of Pages---Attachment J1 – Notional Sprint Plan---01/19/20234Attachment J2 – Agile at the Library---01/19/202339Attachment J3 – Questions Template---01/19/20231Page 22---030ADV23Q0051Section L---SECTION L - INSTRUCTIONS, CONDITIONS, AND NOTICES TO OFFERORS---L.1 LC52.233-2 PROTESTS TO THE LIBRARY OF CONGRESS (DEC 2013)Offerors may submit a protest directly to the Contracting Officer or to the Government Accountability Office. Protests filed with the contracting officer will be decided promptly, and may be appealed to the Library’s Senior Procurement Executive for purposes of conducting an independent review of the contracting officer’s decision.", "chunk_id": 52}, {"chunk": "(End of Provision)---L.2 Instructions, Conditions, and Notices to Schedule Contractors---Schedule Contractors must comply with the submission instructions stated herein. If the Quote does not comply with the submission instructions for the method of submission, as well as format and content, the Schedule Contractor may be ineligible for award.", "chunk_id": 53}, {"chunk": "L.2.1. Due Date---All Quotes shall be submitted electronically via GSA e-Buy no later than the date specified in block 8 of the solicitation.L.2.2. Clarification Questions---Questions related to this solicitation must be submitted in writing via email to the contracting officer Michael Schuman at mschuman@loc.gov and the contract specialist Quinn Cartheuser at qcart@loc.gov no later than February 21, 2023. Schedule Contractors must use Attachment J3 – Questions Template to submit questions. Questions submitted not following this template are not guaranteed an answer. Answers to questions of a substantive nature will be provided to all Schedule Contractors. The Library will not guarantee answers to questions received after this date.", "chunk_id": 54}, {"chunk": "L.2.3. Quote Format---Each page is to be numbered and labeled with the name of the Schedule Contractor in the header or footer. The document must have single-spaced typed lines, at least 1 inch margins, and the text font must not be smaller than Times New Roman 10-point. A limited amount of smaller text size and/or font may be used within graphics or charts, but must be legible. No hyperlinks to external reference information should be included in any section of your Quote. Quote sections may be submitted as separate files, or, as one combined file with clearly identified sections.", "chunk_id": 55}, {"chunk": "L.2.4. Quote Content---Schedule Contractors must include any ground rules, assumptions, exceptions, and/or deviations that are inherent in their Quote. Exceptions and deviations must indicate a clear reference to the solicitation term(s) or condition(s) that is(are) excepted or modified. Any ground rules, assumptions, exceptions, and/or deviations are not accepted by the Library unless approved by the Contracting Officer in writing. Silence by the Contracting Officer does not provide acceptance.", "chunk_id": 56}, {"chunk": "Page 23---030ADV23Q0051Section L---The Quote must contain the following sections, in the stated order, labeled as indicated:L.2.4.1. Technical Approach and Staffing---Offerors shall submit a project plan to include a description of the effort, goals, objectives, resources, assumptions, delivery schedule, milestones, performance measures, reporting, roles, and responsibilities. Offerors shall describe an approach to managing performance and shall propose effective means by which the Library can measure success, including any incentives that would optimize results. Contractors shall not merely restate the solicitation requirements, but present a rational methodology for fulfillment of the requirements.Contractors may propose any labor mix that they believe will fulfill the requirements of the solicitation and that aligns with their proposed technical approach and the required Key Personnel in the Statement of Work, Section C.6, where minimum qualification requirements are also listed. Contractors must meet or exceed the qualification requirements for key personnel. Contractors must provide an overarching description of their proposed team composition that includes: (a) labor category/contract role; (b) relative qualifications and experience for the named key personnel; and (c) labor hours per position/employee. Sufficient information should be provided to support the proposed team’s ability to fulfill the requirements of the solicitation.For key personnel, Contractors must submit the following minimum information in resume format:(1)Proposed position title / labor category;(2)Name of proposed employee;(3)", "chunk_id": 57}, {"chunk": "Relationship to the contractor (direct employee or sub-contractor, etc.);---(4) contractor team and within the contractor’s organization;Proposed role within proposed contractor team, organizational position between proposed(5)Certifications/Education;---(6)Relevant experience that clearly relates to the solicitation requirements(7)Resumes of any named staff---The Technical Approach and Staffing section is limited to 15 pages, not including cover pages, indexes, table of contents, or resumes (limited to 2 pages each).", "chunk_id": 58}, {"chunk": "L.2.4.2. Corporate Experience---Contractors must submit a Corporate Experience section that includes examples of at least one (1) but no more than two (2) current contracts and/or completed contracts (Government or commercial) performed within five years from the solicitation release date that are relevant to this procurement. Contractors shall provide a description of:(i) How the submitted reference demonstrates the Contractor’s performance as a prime or subcontractor for a contract of similar size and scope and the same type of services being solicited under this RFQ;", "chunk_id": 59}, {"chunk": "Page 24---030ADV23Q0051Section L---(ii) The Contractor’s overall management control of any subcontractor(s) for this contract and how this relationship provided quality service to the customer;(iii) The quality of technical support the Contractor provided to the customers under this contract and the Contractor’s ability to face challenges resulting from such an effort; and(iv) What solutions and how the Contractor provided solutions to resolve any problems encountered for the referenced contract.", "chunk_id": 60}, {"chunk": "(v) Date(s) of performance---(vi) The total dollar amount of the contract---The Corporate Experience quote section has a limit of 10 pages), not including cover pages, indexes, or table of contentsL.2.4.3. PriceThe price section of the quote shall be submitted in Microsoft Excel format and include a firm-fixed-price for all of the deliverables stated in the Statement of Work, Section 4.1.Schedule Contractors shall submit a list of all quoted labor categories, hours, fully-loaded rates, and any other direct cost(s), required to complete the work required in the Statement of Work. Rates must be at or lower than the Schedule Contractor’s GSA rates. No blended rates will be allowed.The Library has estimated 4-week sprints of about 176 hours per sprint.The Library has provided a reference payment schedule in Section G. Schedule Contractors must submit a payment schedule it feels is best suited to the performance of this work that clearly outlines each of the deliverables in the statement of work. The Library has a policy of paying only for fixed deliverables.", "chunk_id": 61}, {"chunk": "(End of Provision)---Page 25---030ADV23Q0051Section M---SECTION M - EVALUATION FACTORS FOR AWARD---Note: The term “Schedule Contractor” shall be construed to include subcontractors, consultants, and related entities.M.1 Evaluation Methodology Award will be made to the Schedule Contractor whose quote is determined to represent the “Best Value” to the Library after consideration of all evaluation factors in accordance with FAR 8.4.A “trade-off” analysis approach will be performed through an integrated assessment of price and non-price factors.M.2 Evaluation Factors The following evaluation factors apply to this acquisition, listed in descending order of importance:Factor 1 – Technical Approach and Staffing Factor 2 – Corporate Experience Factor 3 – PriceNon-price factors combined are significantly more important than priceM.2.1 Factor 1 – Technical Approach and Staffing The Library will evaluate the degree to which the Schedule Contractor’s technical approach will ensure fulfillment of all requirements in Section C and minimizes risk to the Library. Offers that exceed the requirements in a beneficial way may be rated higher for their technical approach. Schedule Contractors that merely restate the solicitation requirements may be rated as unacceptable.The Library will evaluate the contractor’s labor mix for reasonableness. The Library will evaluate contractor staff’s demonstrated experience in providing the services required in the Statement of Work.M.2.2 Factor 2 – Corporate Experience The Library will evaluate the contractor’s overall demonstrated experience in providing the services required in the Statement of Work for the solicitation to determine the likelihood of successful performance.", "chunk_id": 62}, {"chunk": "M.2.3 Factor 3 – Price---Page 26---030ADV23Q0051Section M---The Library will assess the reasonableness of the proposed total firm fixed price and the associated labor rates, inclusive of all discounts, to complete the requirements of the solicitation. The total evaluated price will be the sum of all fixed price deliverables.M.3 Award on Initial Responses/Exchanges with Best Valued The government anticipates selecting the best-valued contractor from initial responses, without engaging in exchanges with contractors. Contractors are strongly encouraged to submit their best technical solutions and price in response to this solicitation.Once the government determines the contractor that is the best-valued (i.e., the apparent successful contractor), the government reserves the right to communicate with only that contractor to address any remaining issues, if necessary, and finalize a task order with that contractor. These issues may include technical and price. If the parties cannot successfully address any remaining issues, as determined pertinent at the sole discretion of the government, the government reserves the right to communicate with the next best-valued contractor based on the original analysis and address any remaining issues.", "chunk_id": 63}, {"chunk": "End of Document---Page 27---", "chunk_id": 64}]