[{"chunk": "Schedule of Deliverables - ATTACHMENT 2---The contractor shall provide the deliverables as described in the table below. All contractor deliverables or work products shall remain categorized as \"Official Use Only.” The release of any portion must be authorized in writing by the Government. The deliverables and work products will be provided in electronic format and shall comply with all applicable standards of Section 508 of the Rehabilitation Act. The below table defines the Task Order deliverables at a high level and should not be considered all inclusive. Each Task Order will identify the specific deliverables required for that Task Order and the final format and content requirements will be mutually developed and agreed upon among the IRS Program Manager (PM), the contractor and the contracting officer’s technical representative (COR). The Task Order shall also specify the required delivery dates and timeframes.Task Area 1, Transition Management Support---Deliverable No. Deliverable---Due Date/Frequency---1Program vision and charter---TBD*2Program meeting agendas presentations and minutes---TBD---3Process and procedure documentation---TBD---4Analysis of alternatives---TBD---5Program reports---TBD---6Program risk and issue register---TBD---7Strategic roadmaps and operating models---TBD---8Contingency plans---TBD---Task Area 2, Release Management Support---Deliverable No. Deliverable---Due Date/Frequency---9Integrated release planTBD---10Release dependencies list---TBD---11Release risk and issue register---TBD---112Release status reports---TBD---13Release meeting agendas, presentations, and minutes---TBD---14Lessons Learned---TBD---Task Area 3, Project Management Support---", "chunk_id": 1, "page_no": 2}, {"chunk": "Deliverable No. Deliverable---Due Date/Frequency---15Project management documentation---TBD---16Project schedules---TBD---17Project status reports---TBD---18Process and procedure documentation---TBD---19Project meeting agendas, presentations, and minutes---TBD---20Lessons learnedTBD---Task Area 4, ELC Support---Deliverable No. Deliverable---Due Date/Frequency---21Artifact strategy---TBD---Task Area 5, Program Integration Deliverable No. Deliverable---Due Date/Frequency---22Stakeholder engagement process and interaction model---TBD---23Program integrated master scheduleTBD---Task Area 6, Technical Integration---Deliverable No. Deliverable---Due Date/Frequency---Technical dependencies, integration points and impact analyses---24TBD---25Non-functional requirements---TBD---Dependencies List identifying the intersection of functional and non-functional requirements26TBD---227Technical integration plans---TBD---Task Area 7, Business Analysis Support---Deliverable No. Deliverable---Due Date/Frequency---Business process descriptions, process flows, diagrams and presentations---28TBD---29Business process impacts and recommendations---TBD---Best practices for business process analysis and reengineering---30TBD---Task Area 8, Requirements Engineering Support---Deliverable No. Deliverable---Due Date/Frequency---Program requirements, functional and non-functional---31TBD---32System, project and build-to requirements---TBD---33Requirements traceability reports---TBD---Task Area 9, Configuration and Change Management Support---Deliverable No. Deliverable---Due Date/Frequency---34Configuration items list---TBD---35Implementation packages---TBD---36Audit plans and reports---TBD---Task Area, 10, Change Management and Change Control Support---Deliverable No. Deliverable---Due Date/Frequency---37Change request process---TBD---38UWR/CR Analysis---TBD---Task Area 11, Organizational Readiness Support---Deliverable No. Deliverable---Due Date/Frequency---339Organizational readiness plans and reports---TBD---Task Area 12, Organizational Change Management Support---Deliverable No. Deliverable---Due Date/Frequency---40Organizational change assessments---TBD---41Organizational change plans and reports---TBD---42Communication plans---TBD---43Training plans---TBD---Task Area 13, Engineering and Architecture Support---Deliverable No. Deliverable---Due Date/Frequency---44Technical analyses and assessments---TBD---Task Area 14, Enterprise Testing Support---Deliverable No. Deliverable---Due Date/Frequency---45Test plans---TBD---46Test results reports---TBD---47Test integration analysis and recommendations---TBD---Task Area 15, Cybersecurity Support---", "chunk_id": 2, "page_no": 4}, {"chunk": "Deliverable No. Deliverable---Due Date/Frequency---48Security and privacy requirements---TBD---Security and privacy risk management plans and reports---49TBD---50Defect analysis reports and recommendations---TBD---51Security test plans---TBD---52Security test results reports---TBD---Task Area 16, Applications Development Support---4Deliverable No. Deliverable---Due Date/Frequency---53Requirements management plans---TBD---54Test plans---TBD---55Technical review results and recommendations---TBD---56Communications plans---TBD---57Risk management plans---TBD---Task Area 17, Enterprise Operations Support---Deliverable No. Deliverable---Due Date/Frequency---58Best practices recommendations---TBD---59Knowledge transfer plans---TBD---60Technical review results and recommendations---TBD---Task Area 18, Cloud Services Activities---Deliverable No. Deliverable---Due Date/Frequency---61Knowledge transfer plans---TBD---62Transition plans---TBD---Section 8.1.1, Kickoff Meeting---Deliverable No. Deliverable---Due Date/Frequency---63Kickoff Meeting (Task Order Level)---TBD---Section 6.1.1, Kickoff Meeting---Within 5 business days of contract award---64Kickoff Meeting (BPA Level)---8.1.2, Quality Control Plan (QCP)---Within 30 calendar days of contract award---65Quality Control Plan---5Task Area 19, Cloud Services---Task Area 19, Cloud Services---Task Area 19, Cloud Services---Deliverable No. Deliverable---Due Date/Frequency---66Cloud Strategy Plan---TBD---67Cloud Transition Plan---TBD---68Cloud Implementation Plan---TBD---TBD – To Be Determined6", "chunk_id": 3, "page_no": 6}]