[{"child_chunk": "REQUEST FOR PROPOSAL (RFP)FOR---Appointment of Public Sector Undertaking for Planning, Designing and Construction of Administrative, Training, Hostel, Auditorium and Sports facilities for the Zonal Training Institute of the National Academy of Customs, Indirect Taxes & Narcotics at Nolambur, Chennai”Principal Additional Director General,", "chunk_id": 1}, {"child_chunk": "National Academy of Customs, Indirect Taxes & Narcotics, Chennai.---Tel. No. 044 26250157/59, Fax No. 044 26250155/56 E mail: nacin.chennai@gov.in, vnair1966@gmail.comDISCLAIMER---The information contained in this Request for Proposal document (“RFP”) or subsequently provided to bidders, whether verbally or in documentary or any other form by or on behalf of Principal / Additional Director General, NACIN (hereinafter referred to as “Principal / Additional Director General”) or any of its employees or advisers, is provided to bidders on the terms and conditions set out in this RFP and such other terms and conditions subject to which", "chunk_id": 2}, {"child_chunk": "its employees or advisers, is provided to bidders on the terms and conditions set out in this RFP and such other terms and conditions subject to which such information is provided.This RFP is not an agreement and is neither an offer nor invitation by Principal / Additional Director General to the prospective bidders or any other person. The purpose of this RFP is to provide interested Bidders with information that may be useful to them in the formulation of their Proposals pursuant to this RFP. This RFP includes statements, which reflect various assumptions and assessments arrived at by Principal / Additional Director General in relation to the project. Such assumptions, assessments and statements do not purport to contain all the information that each bidder may require. This RFP may not be", "chunk_id": 2}, {"child_chunk": "the project. Such assumptions, assessments and statements do not purport to contain all the information that each bidder may require. This RFP may not be appropriate for all persons, and it is not possible for Principal / Additional Director General, its employees or advisers to consider the objectives, technical expertise and particular needs of each Bidder who reads or uses this RFP. The assumptions, assessments, statements and information contained in this RFP, may not be complete, accurate, adequate or correct. Each Bidder should, therefore, conduct its own investigations and analysis and should check the accuracy, adequacy, correctness, reliability and completeness of the assumptions, assessments and information contained in this RFP and obtain independent advice from appropriate sources.Information provided in this RFP", "chunk_id": 2}, {"child_chunk": "correctness, reliability and completeness of the assumptions, assessments and information contained in this RFP and obtain independent advice from appropriate sources.Information provided in this RFP to the bidders is on a wide range of matters, some of which depends upon interpretation of law. The information given is not an exhaustive account of statutory requirements and should not be regarded as a complete or authoritative statement of law. Principal / Additional Director General accepts no responsibility for the accuracy or otherwise for any interpretation or opinion on the law expressed herein.Principal / Additional Director General,NACIN its employees and advisers make no representation or warranty and shall have no liability to any person including any bidder under any law, statute, rules or regulations or tort, principles of restitution or unjust enrichment or otherwise for any", "chunk_id": 2}, {"child_chunk": "no liability to any person including any bidder under any law, statute, rules or regulations or tort, principles of restitution or unjust enrichment or otherwise for any loss, damages, cost or expense which may arise from or be incurred or suffered on account of anything contained in this RFP or otherwise, including the accuracy, adequacy, correctness, reliability or completeness of the RFP and any assessment, assumption, statement or information contained therein or deemed to form part of this RFP or arising in any way in this Selection Process.Principal / Additional Director General, NACIN also accepts no liability of any nature whether resulting from negligence or otherwise, howsoever caused, arising from reliance of any bidder upon the statements contained in this RFP.Principal / Additional Director", "chunk_id": 2}, {"child_chunk": "whether resulting from negligence or otherwise, howsoever caused, arising from reliance of any bidder upon the statements contained in this RFP.Principal / Additional Director General may in its absolute discretion, but without being under any obligation to do so, update, amend or supplement the information, assessment or assumption contained in this RFP.The issue of this RFP does not imply that Principal / Additional Director General is bound to select a bidder or to appoint the selected bidder, as the case may be, for the Project services and Principal / Additional Director General reserves the right to reject all or any of the Proposals without assigning any reasons whatsoever.", "chunk_id": 2}, {"child_chunk": "Page 2 of 46---The bidder shall bear all its costs associated with or relating to the preparation and submission of its Proposal including but not limited to preparation, copying, postage, delivery fees, expenses associated with any demonstrations or presentations which may be required by Principal / Additional Director General or any other costs incurred in connection with or relating to its Proposal. All such costs and expenses will remain with the Bidder and Principal / Additional Director General shall not be liable in any manner whatsoever for the same or for any other costs or other expenses incurred by a bidder in preparation or submission of the Proposal, regardless of the conduct or outcome of the Selection Process.***", "chunk_id": 3}, {"child_chunk": "Page 3 of 46---Section 1---INTRODUCTION---1. BACKGROUND:The Office of the Principal / Additional Director General invites online e-Tender through eprocure.gov.in for the following works on service charges from any Public Sector undertaking set up by the Central / State Govt. or any other Central / State Govt. organization / PSU which may be notified for such purpose competent to provide Project Services “hereinafter referred to as ‘Project’ or ‘’Contract’’ or ‘Services’ ’’ including the Design proposal for the construction of Integrated NACIN Complex, Nolambur Chennai. This RFP is issued in terms of Rule 133(3) of GFR, 2017.", "chunk_id": 4}, {"child_chunk": "1.2 Project:---NACIN, Chennai Zonal Training Institute (ZTI) owns a plot of land measuring about 13192.75 sqm, situated at Nolambur Chennai. The plot was transferred to the Principal / Additional Director General on as-is-where-is basis and physical possession of the plot was taken in April 2015. The plot is located at very prime residential location of Chennai and well connected through various roads to other places. The land is fully secured from any kind of encroachment since its possession. Principal / Additional Director General proposes to build an Integrated Administrative, Training, Hostel and Sports facilities utilizing the maximum FSA available as per norms. It is with these broad objectives that Principal / Additional Director General wishes to secure the services of Government Agency which is designated as Competent Authority from amongst the public sector undertakings set up by the Central / State Govt. or any other Central/State Govt. organization/PSU which may be notified by the Ministry of Urban Development for such purpose.", "chunk_id": 5}, {"child_chunk": "Tentative Space Requirements for the Integrated NACIN Complex.---Complex for administrative, training and auditorium shall be housed in one towerwhile the hostel and indoor sports facilities shall be in another tower.Tentative Space Requirements are provided below.The total land usage should be kept at the minimum keeping in mind the", "chunk_id": 6}, {"child_chunk": "regulations of the local municipal and other regulatory agencies.---Water Supply: UG pump and OHT provided for domestic requirement - Developments: Internal roads/paths, sewer lines, storm water drains anddevelopment of surrounding area etc.The construction work shall be purely on CPWD rates wherever PAR Rates are", "chunk_id": 7}, {"child_chunk": "available / applicable norms.---The project shall be GRIHA-III/IV norms compliant and should have the sewagetreatment plant (STP), water recycling plant and self-sufficiency in power by way---of use of solar energy or other renewable sources of energy.---Page 4 of 46---The proposed features and tentative space requirements are as below:", "chunk_id": 8}, {"child_chunk": "ADMINISTRATIVE & ACADEMIC WING---ADMINISTRATIVE AREA---Sl. No. Designation/ Description---Sanction ed Strength / Quantity---Eligible Area in Sq. Mtr per OfficerTotal area as per eligibility---123456Principal ADG's Chamber with attached toilet Meeting / Conference attached with chamber for Pr. ADG Senior PS Chamber Waiting Space for visitors for Pr.ADG /DG etc., Kitchenette/Pantry Visiting Senior Officer's Chamber {Board Room}111111232014.510523232014.5105237", "chunk_id": 9}, {"child_chunk": "Addl./JD Chamber with attached toilet---12323810Meeting/conference Room attached with the chambers of Additional/joint Directors Waiting Space for visitors for Additional/Joint Directors etc.,112211221111DD/AD Chamber with attached toilet---818144121314 15Visitors Room for Deputy/Assistant Directors Kitchenette/Pantry (Water cooler room, store room etc.,) CAO Chamber Superintendent Chambers111 68518 14.58518 8716", "chunk_id": 10}, {"child_chunk": "Inspectors' chambers---8118817 18192021 22 232425A.O. Chamber Tax Assistant (1) Work station Driver Spl. Gr. (1) & Driver Gr.I (1) Combined Office work station Hd. Havildar (2) & Multi-Tasking Staff (1) Combined Office work station Entrance Hall with reception Toilets on every floor * Visitor waiting lounge in every floor** Stores for keeping training material / Stationery Photocopier room1 1232111 5558822221211 5101588441226", "chunk_id": 11}, {"child_chunk": "Rest rooms (toilets) -Ladies---316.549.527Rest rooms (toilets) -Gents---316.549.5Page 5 of 46---28Reading Room (for inter-session use of participants for keeping magazines, newspapers etc.,)12020293032 33 34 36Communication Room (EPBAX, WAN etc.,) Dining Hall for faculty, Senior Officers and VIP guests Rest room for out-sourced drivers Archives/ Exhibition Hall Generator Room Record rooms for new records111 1 1 122406 50 40 5022406 50 40 5037", "chunk_id": 12}, {"child_chunk": "Record rooms for old records---1Total---6571013.5TRAINING AREA---Description---Qty---Tentative Area---1234567891011Lecture Halls with seating capacity of 35- 40 in semi-circle shape Lecture Halls with seating capacity of 50 in semi-circle shape Lecture Halls with seating capacity of 100 in semi-circle shape Group Discussion Rooms with one room for group of 15-20 officers Library & Reading Room Computer training hall to Accommodate 40-50 trainers Counters for Registration and distribution of training materials * Audio-visual/Teaching aids/Equipment Room for storage of all teaching aids. Waiting Lounge for trainees Tea / Coffee room (to organize for tea / coffee between consecutive training sessions, common in all training institutes Toilets on every floor *3214121311501803503615020010202240450360350144150400206640", "chunk_id": 13}, {"child_chunk": "Total---11581980Auditorium---Qty---Tentative Area---1Auditorium with seating capacity of 500 persons with green rooms, rest rooms and common area for refreshments1500500Simulation---1Firing Simulation---1300300Page 6 of 46---HOSTEL WING---Sl.No Description---Quantity---Area in Sq. Mtr per unitTotal Area---A. Hostel---1Entrance Hall with reception & lounge.---1606034568910Double rooms with attached bath Five suites -air-conditioned rooms with ante-room and attached bath (to be used as temporary accommodation of senior officers/visiting faculties Air-conditioned rooms with attached bath (to be used as temporary accommodation for officers/ visiting faculties) Computer room with provisions for 5 terminals and internet facilities for trainees Kitchen and washing area Cafeteria for Trainee Officers and Officers and Staff of NACIN Dining Hall for Faculty and Senior Officers605101111303020305015050180015020030501505011", "chunk_id": 14}, {"child_chunk": "Supply Counter---1181812Store Room for Canteen---1202013Room for canteen staff---1151514Store Room for storing mattresses, pillows, furnishings, plastic buckets etc.1202015Room for Washing Machine and for Pressing clothes (Ironing)---11515Total---5082578Indoor Sports---Sl.No Description---1Gymnasium---Quantity---1Area in Sq. Mtr 200---Total Area---2002Yoga and meditation---12002003Badminton Court---11601604TV & Music Lounge---180805Billiards room---125256Table Tennis room---12525", "chunk_id": 15}, {"child_chunk": "Squash Court---164647Other indoor games like carrom, Chess etc.---150508Newspaper & magazine room---13030Page 7 of 46---9Caretaker room for sports complex---1151510 Watchman's room---1151511Store room---11515Total---879879Total carpet area for Administrative Wing---: 1013.5 Sq. mtrTotal carpet area for Academic Wing---: 1980 Sq. mtrTotal carpet area for Auditorium---", "chunk_id": 16}, {"child_chunk": ": 500 Sq. mtr---Total carpet area for Firing Simulation: 300 Sq. mtr---Total carpet area for Hostel---: 2578 Sq. mtrTotal carpet area for Indoor sports---: 879 Sq. mtr--------------------------------------------------------------------------- Total carpet area : 7250.5 Sq. mtr ------------------------------------------------------------------------The space requirement is only indicative carpet area. Total plinth area would include in addition to carpet area, area for passage, walls, toilets, foyer and other common facilities and amenities as may be required. Toilet size would depend on the number of users in the floor.** Total area depends on the number of floors.OUTDOOR SPORTS FACILITIES:1. Swimming Pool (12m x 8m x 1.8m)", "chunk_id": 17}, {"child_chunk": "2. Tennis Court (as per International Standards)---3. Basket Ball Court (as per International Standards).---1.3 The proposed project should meet the following objectives:To ensure that land resources are put to optimum use,  The activities should not be conflicting to any other main activity and shouldnot affect other operation,Create a world class infrastructure, with Administrative, training, Hostel and", "chunk_id": 18}, {"child_chunk": "Sports facilities---Ensure energy & environment sustainability, propose energy efficiency solutions, encourage use of renewable energy and meet all environment guidelines,Maximize the land use out of the available land parcels,1.4 Request for Proposal: Principal / Additional Director General, Chennai wishes to invite bids from the Public Sector Undertakings (PSU) set up by the Central / State Govt. The Agency shall be appointed through a limited bidding process based on evaluation of Technical and Financial Proposal of Eligible Applicants by a Committee constituted for this purpose by the Director General, NACIN, Faridabad from amongst the Public Sector Undertakings (PSU) set up by the Central / State Govt. which may be notified by the Page 8 of 46Ministry of Urban Development for such purpose. The construction work shall be purely on CPWD / applicable norms. This RFP is being issued as per Rule 133(3) of GFR, 2017.The amended GFR 133(3) states that:-As an alternative to 133(2), a Ministry or Department may award repair works estimated to cost above Rupees thirty Lakhs and original works of any value to:(i)", "chunk_id": 19}, {"child_chunk": "(ii)---any Public Sector Undertaking set up by the Central or State Government to carry out civil or electrical works or to any other Central / State Government organisation /PSU which may be notified by the Ministry of Urban Development (MoUD) for such purpose after evaluating their financial strength and technical competence.For the award of work under this sub-rule, the Ministry/ Department shall ensure competition among such PSUs / Organisations. This competition shall be essentially on the lump sum service charges to be claimed for execution of work.In exceptional cases, for award of work under (i) and (ii) above, on nomination basis, the conditions contained in Rule 194 would apply. The work under these circumstances shall also be awarded only on the basis of lump sum service chargeNOTE: The bidder shall quote only one number which should be the lump sum fee.", "chunk_id": 20}, {"child_chunk": "1.5 Scope of Work---The detailed scope of work as envisaged by the Principal / Additional Director General has been defined under Section 5 Appendix – I – Terms of Reference (TOR).Page 9 of 46---Section 2---INSTRUCTIONS TO BIDDERS---2.1 Due diligence by bidders---Bidders are encouraged to inform themselves fully about the assignment and the local conditions before submitting the Proposal by paying a visit to the Project site at Nolambur, Chennai and obtaining the required information from Officer in-charge or Assistant Director (Infrastructure) Tel No. 044 26250143 Email – vnair.1966@gov.in, vnair1966@gmail.com by sending written queries addressed to Principal / Additional Director General, and attending a Pre-Proposal Conference on the date and time specified in this document.", "chunk_id": 21}, {"child_chunk": "2.2 Sale of RFP Document---The whole process of selection of PSU would be done through E-Procurement under Central Public Procurement Portal mode as mandated by the GFR Rules. The interested Bidders may download the web sites at the Proposal documents www.eprocure.gov.in.The Proposal Document can be downloaded from the website eprocure.gov.in on payment of Indian Rupees 5,000/- (non - refundable). The payment is to be made by hand or by way Registered Post through Demand Draft / Banker`s Cheque drawn in favour of “ADDITIONAL DIRECTOR NACEN CHENNAI“ (on any Scheduled/Nationalized Bank having its branch at Chennai). The original copy of Demand Draft/Banker’s Cheque shall be delivered to The Principal / Additional Director General, National Academy of Customs, Indirect Taxes and Narcotics, Plot No: 3/86E, ATC Road, 2nd Main Road, Ambattur Industrial Estate, Chennai – 600 058 on any working day from 10.00 hrs to 16.00 hrs.", "chunk_id": 22}, {"child_chunk": "from---The document can also be viewed on www.cbic.gov.in or www.nacen.gov.in. The payment of Rs. 5000 (non - refundable) by Demand Draft/ Banker`s Cheque will be a part of the technical proposal. No editing, addition/deletion of matter shall be permitted. If such action is observed at any stage, such proposals are liable for outright rejection.", "chunk_id": 23}, {"child_chunk": "2.3 Validity of Proposal:---The proposal shall be valid for a period of 30 days from the date of opening of Technical Proposal.2.4 Brief Description of the Selection Process:---Principal / Additional Director General has adopted a Single stage two Envelop selection process (collectively the “Selection Process”) for evaluating the Proposals comprising Technical and Financial bids to be submitted in two separate pdf files. In the first stage, technical evaluation will be carried out as specified in Clause 3.1.6.1. The evaluation committee shall allocate marks for Approach and Methodology Proposed Concept design and presentation according to the Evaluation Criteria as specified in Clause 3.1.6.1.In the next stage, a financial evaluation will be carried out as specified in Clause 3.1.8. The work shall be awarded on the basis of highest score as determined by Evaluation Committee as explained in clause 3.1.9.", "chunk_id": 24}, {"child_chunk": "Page 10 of 46---2.5 Schedule of Selection Process:---Principal / Additional Director General would endeavor to adhere to the following schedule:Sr. No.---Activity---Schedule---i)---Publishing of RFP on CPP Portal (eprocure.gov.in)---02.01.2019ii)---Last date of receiving queries11.01.2019iii)---Pre-bid meeting---11.30 hrs on 14.01.2019iv)---Responses queries---to---the Pre-bid---Maximum by 16.01.2019v)---Last date of submission of bids (Proposal Due Date)---Till 16.00 hrs on 01.02.2019", "chunk_id": 25}, {"child_chunk": "vi)---Opening of 1st cover (technical bid)---04.02.2019vii)---Presentation of Concept Design---11.02.2019 (Tentative)viii)---Opening of 2nd cover (financial bid)---15.02.2019 (Tentative)2.5.1 Pre-Proposal visit to the Site and inspection of data:---Prospective bidders should visit the Site and review the available data at any time prior to the Proposal Due Date to obtain first-hand information on the assignment and on the local conditions. Agencies are advised to pay a visit to the project site before submitting a proposal. Visit to site will be facilitated by NACIN Chennai upon written request from the Agencies giving particulars of visiting personnel.", "chunk_id": 26}, {"child_chunk": "2.5.2 Pre-Bid Meeting and Presentation of Concept Design:---The tentative venue of the Pre-Proposal Conference and Presentation of Concept Design shall be as follows:Conference Hall - First Floor National Academy of Customs, Indirect Taxes and Narcotics, Plot No: 3/86E, A.T.C. Road, 2nd Main Road, Ambattur Industrial Estate, Chennai – 600 058. Tel No. 044 26250143 Email – vnair.1966@gov.in, vnair1966@gmail.com", "chunk_id": 27}, {"child_chunk": "Page 11 of 46---2.5.3 Communications:---All communications including the submission of Proposal would be done through eprocure.gov.in. The bidder can address all queries to:National Academy of Customs, Indirect Taxes and Narcotics, Plot No: 3/86E, A.T.C. Road, 2nd Main Road, Ambattur Industrial Estate, Chennai – 600 058. Tel No. 044 26250143 Email – vnair.1966@gov.in, vnair1966@gmail.com", "chunk_id": 28}, {"child_chunk": "2.5.4 Web site address:---The Official Website of Principal / Additional Director General, Chennai www.nacen.gov.in---is:2.6 General Instructions:---Detailed description of the objectives, scope of services, deliverables and other requirements relating to this project are specified in this RFP. In case any bidder possesses the requisite experience and capabilities required for undertaking the project, it may participate in the Selection Process in response to this invitation. The term bidder means the Sole Firm i.e. Public Sector Undertaking. The manner in which the Proposal is required to be submitted, evaluated and accepted is explained in this RFP.Bidders are advised that the selection of PSU shall be on the basis of an evaluation by the Evaluation Committee appointed by", "chunk_id": 29}, {"child_chunk": "accepted is explained in this RFP.Bidders are advised that the selection of PSU shall be on the basis of an evaluation by the Evaluation Committee appointed by the Director General, NACIN through the Selection Process specified in this RFP.Bidders shall be deemed to have understood and agreed that no explanation or justification for any aspect of the Selection Process will be given and that Principal / Additional Director General’s decisions are without any right of appeal whatsoever.The bidder shall submit its Proposal in the form and manner as specified in the RFP. The Technical proposal shall be submitted in the forms at Section -4, Forms 1 to 10 along with Key Submissions & Approach & Methodology & Concept Design and the Financial Proposal shall be submitted in the forms", "chunk_id": 29}, {"child_chunk": "Forms 1 to 10 along with Key Submissions & Approach & Methodology & Concept Design and the Financial Proposal shall be submitted in the forms 7A& 7B at Section – 4. Upon selection, the bidder shall be required to enter into an agreement with Principal / Additional Director General which will be mutually deliberated & finalized between the Principal / Additional Director General & the selected bidder as per applicable GFR.", "chunk_id": 29}, {"child_chunk": "2.7 Key Personnel:---The PSU’s team (the “Team”) shall consist of the following key personnel (the “Key Personnel”) who shall discharge their respective responsibilities as specified below:A) Architect and Urban Planner---B) Infrastructure Designer & Structural engineer---C) Environment Expert---D) Legal Expert---Page 12 of 46---", "chunk_id": 30}, {"child_chunk": "2.8 Eligibility criteria for Bidders:--- Bidders must read carefully the minimum eligibility criteria provided herein. Proposals of only those Bidders who satisfy the eligibility criteria will be considered for evaluation. To be eligible for evaluation of its Proposal, the Bidder shall fulfill the following: The Public Sector Undertakings set up by the Central / State Govt. which may be notified by the Ministry of Urban Development, Government of India for such purpose.o Should have completed at least 1 similar project of min Rs. 100 crores.o Similar work means the designing, development, DPR, supervision of construction work of Training Establishment including facilities for training, hostel, administration and sports facilities. In case any bidding Agency", "chunk_id": 31}, {"child_chunk": "designing, development, DPR, supervision of construction work of Training Establishment including facilities for training, hostel, administration and sports facilities. In case any bidding Agency proposes to have innovative structure, then the similar work shall mean work similar to as proposed in the proposal submission, by the Agency. The cost of similar work in that case shall include the 50% cost of work as being proposed under the proposal by the bidder.o Should have had average annual financial turn-over of Rs. 500 crores from the PSU activities on construction works during the last three years ending March 2017. (Scanned copy of the relevant portion of audited Balance sheet to be uploaded).o Any entity which has been barred by the Central Government, any State Government, a", "chunk_id": 31}, {"child_chunk": "of the relevant portion of audited Balance sheet to be uploaded).o Any entity which has been barred by the Central Government, any State Government, a statutory authority or a public sector undertaking, as the case may be, from participating in any project, and the bar subsists as on the date of Proposal, shall not be eligible to submit a Proposal either by itself or through its Associate.o The bidder should have, during the last three years, neither failed to perform on any agreement, as evidenced by imposition of a penalty by an arbitral or judicial authority or a judicial pronouncement or arbitration award against the Bidder, nor been expelled from any project or agreement nor have had any agreement terminated for breach by such Bidder. While submitting a", "chunk_id": 31}, {"child_chunk": "the Bidder, nor been expelled from any project or agreement nor have had any agreement terminated for breach by such Bidder. While submitting a Proposal, the Bidder should attach clearly marked and referenced continuation sheets in the event that the space provided in the specified forms in the Appendices is insufficient. Alternatively, Bidders may format the specified forms making due provision for incorporation of the requested information.2.9", "chunk_id": 31}, {"child_chunk": "Submissions:--- List of works in hand and list of works carried out by them for Central / StateGovt. Departments / Agencies indicating---i)---Agency for whom executedii)---Value of Work---iii)---Completion time as stipulated and actual or present position of work.---Page 13 of 46--- Financial Turn Over certified by Chartered Accountant.---", "chunk_id": 32}, {"child_chunk": " Profit & Loss statement certified by Chartered Accountant.--- List of SIMILAR WORKS completed in last 7 years indicatingi)---Agency for whom executedii)---Value of Work,iii)---Stipulated and actual time of completion. List of Works in Hand indicatingi)---Agency,ii)---Value of Work,iii)---Stipulated time of completion/present position.---", "chunk_id": 33}, {"child_chunk": " Registration certificate, if any.--- Certificates of Work Experience / Performance Certificates.--- Certificate of Registration for GST.--- TIN registration certificate--- PAN (Permanent Account Number) Registration.--- Undertaking that the eligible similar work(s) have not been executed throughanother contractor on back to back basis.", "chunk_id": 34}, {"child_chunk": " Integrity Pact--- Demand Draft of any Scheduled Bank towards cost of Tender Document forRs.5, 000/- if downloaded from the website.NOTE: - The department reserves the right to accept / reject any prospective applicationwithout assigning any reasons thereof. Short-listing of the agencies shall be subject to thorough verification of their credential and inspection of works carried out by them through a technical evaluation committee of experts constituted by the department. If any information furnished by the applicant is found to be incorrect at a later stage they shall be liable to be debarred from tendering / taking works in this department", "chunk_id": 35}, {"child_chunk": "2.10 Conflict of Interest---The bidder shall not have a conflict of interest that may affect the Selection Process or the project (the “Conflict of Interest”). Any bidder found to have a Conflict of Interest shall be disqualified.It is required that the PSU provides professional, objective, and impartial advice and at all times hold Principal / Additional Director General’s interests paramount, avoid conflicts with other assignments or its own interests, and act without any consideration for future work. The Agency shall not accept or engage in any assignment that would be in conflict with its prior or current obligations to other clients, or that may place it in a position of not being able to carry out the assignment in the best interests of Principal / Additional Director General.", "chunk_id": 36}, {"child_chunk": "Page 14 of 46---2.11 Cost of Proposal:---The bidders shall be responsible for all of the costs associated with the preparation of their Proposals and their participation in the Selection Process including subsequent negotiation visits to Principal / Additional Director General, Project site etc. Principal / Additional Director General will not be responsible or in any way liable for such costs, regardless of the conduct or outcome of the Selection Process.2.12", "chunk_id": 37}, {"child_chunk": "Site visit and verification of information:---Bidders are encouraged to submit their respective Proposals after visiting the Project site and ascertaining for themselves the site conditions, traffic, location, surroundings, climate, access to the site, availability of drawings and other data with Principal / Additional Director General, Applicable Laws and regulations or any other matter considered relevant by them.", "chunk_id": 38}, {"child_chunk": "2.13 Acknowledgement by bidder:---It shall be deemed that by submitting the Proposal, the bidder has:(a) made a complete and careful examination of the RFP;(b) received all relevant information requested from Principal / Additional DirectorGeneral;---(c) acknowledged and accepted the risk of inadequacy, error or mistake in the information provided in the RFP or furnished by or on behalf of Principal / Additional Director General or relating to any of the matters referred to in Clause 2.8 above;(d) satisfied itself about all matters, things and information, including matters referred to in Clause 2.8 herein above, necessary and required for submitting an informed Application and performance of all of its obligations thereunder;(e)", "chunk_id": 39}, {"child_chunk": "to in Clause 2.8 herein above, necessary and required for submitting an informed Application and performance of all of its obligations thereunder;(e) acknowledged that it does not have a Conflict of Interest; and(f) Agreed to be bound by the undertaking provided by it under and in terms hereof.The Principal / Additional Director General shall not be liable for any omission, mistake or error on the part of the bidder in respect of any of the above or on account of any matter or thing arising out of or concerning or relating to RFP or the Selection Process, including any error or mistake therein or in any information or data given by the Principal / Additional Director General.2.14 Right to reject any or all Proposals:Notwithstanding anything", "chunk_id": 39}, {"child_chunk": "or in any information or data given by the Principal / Additional Director General.2.14 Right to reject any or all Proposals:Notwithstanding anything contained in this RFP, the Principal / Additional Director General reserves the right to accept or reject any Proposal and to annul the Selection Process and reject all Proposals, at any time without any liability or any obligation for such acceptance, rejection or annulment, and without assigning any reasons thereof. Without prejudice to the generality of Clause 2.15, Principal / Additional Director General reserves the right to reject any Proposal if: (a) At any time, a material misrepresentation is made or discovered, or (b) The bidder does not provide, within the time specified by Principal /", "chunk_id": 39}, {"child_chunk": "At any time, a material misrepresentation is made or discovered, or (b) The bidder does not provide, within the time specified by Principal / Additional Director General, the supplemental information sought by Principal / Additional Director General for evaluation of the Proposal.", "chunk_id": 39}, {"child_chunk": "Page 15 of 46---Misrepresentation/ improper response by the bidder may lead to the disqualification of the bidder. If such disqualification / rejection occurs after the Proposals have been opened and the highest ranking bidder gets disqualified / rejected, then Principal / Additional Director General reserves the right to consider the next best bidder or take any other measure as may be deemed fit in the sole discretion of Principal / Additional Director General, including annulment of the Selection Process.2.15", "chunk_id": 40}, {"child_chunk": "Contents of the RFP---This RFP comprises the Disclaimer set forth herein above, all the contents of the RFP Document and will additionally include any Addendum / Amendment / Clarification issued.2.16 Pre-Bid Meeting:---The Bidder or his authorized representative is advised to attend a Pre-Bid meeting which will be convened at the office of the Principal / Additional Director General on 14th January, 2019 at 11.30 Hrs.The purpose of the meeting will be to clarify issues on proposal and to answer queries on any matter that may be raised at that stage. No queries received after the Pre-Bid meeting will be entertained.The bidders are requested to submit any query in writing so as to reach the Principal", "chunk_id": 41}, {"child_chunk": "No queries received after the Pre-Bid meeting will be entertained.The bidders are requested to submit any query in writing so as to reach the Principal / Additional Director General not later than one (1) day before the date of Pre-Bid meeting. The queries would be preferred by emails. For this purpose they may send their queries on e-mail vnair.1966@gov.in & vnair1966@gmail.com. Hard copies may also be submitted on the Letter Head of the Bidder.Any modification of the Proposal Documents, which may become necessary as a result of the Pre-Bid meeting, may be made by Principal / Additional Director General exclusively through the issuance of an addendum. The pre-bid responses and all the related addendum or", "chunk_id": 41}, {"child_chunk": "may be made by Principal / Additional Director General exclusively through the issuance of an addendum. The pre-bid responses and all the related addendum or corrigendum will be posted on NACIN website.", "chunk_id": 41}, {"child_chunk": "2.17 Amendment of RFP:---At any time before the due date for submission of proposals, the Principal / Additional Director General may, for any reasons, whether at its own initiative or in response to a clarification requested by the firms, modify the RFP documents by amendment. The amendment will be notified in writing either through email to all firms who have purchased the bid document and will be binding on them. The amendments will also be uploaded in the Website. The Principal / Additional Director General may at its discretion extend the deadlines for the submission of proposals.", "chunk_id": 42}, {"child_chunk": "2.18 PREPARATION AND SUBMISSION OF PROPOSAL---2.18.1 Language---The Proposal with all accompanying documents (the “Documents”) and all communications in relation to or concerning the Selection Process shall be in English language. No supporting document or printed literature shall be submitted with the Proposal unless specifically asked for.", "chunk_id": 43}, {"child_chunk": "Page 16 of 46---2.18.2 Format and signing of Proposal---The Bidder shall provide all the information sought under this RFP. Principal / Additional Director General would evaluate only those Proposals that are received in the specified forms and complete in all respects.The bidder shall prepare one original set of the Proposal (together with originals / copies of Documents required to be submitted along therewith pursuant to this RFP) and clearly marked “ORIGINAL”. In addition, the Bidder shall submit 2 (two) copies of only Technical Proposals, along with Documents, marked “COPY”. In the event of any discrepancy between the original and its copies, the original shall prevail.The Proposal, and its copy, shall be typed or written", "chunk_id": 44}, {"child_chunk": "In the event of any discrepancy between the original and its copies, the original shall prevail.The Proposal, and its copy, shall be typed or written in indelible ink and signed by the authorized signatory of the bidder who shall initial each page, in blue ink. In case of printed and published Documents, only the cover shall be initialed. All the alterations, omissions, additions, or any other amendments made to the Proposal shall be initialed by the person(s) signing the Proposal. The proposals must be properly signed by duly authorised person holding the power of attorney (a certified copy of the power attorney shall accompany the proposal).Bidders should note the Proposal Due Date, as specified in Clause 2.5, for submission", "chunk_id": 44}, {"child_chunk": "copy of the power attorney shall accompany the proposal).Bidders should note the Proposal Due Date, as specified in Clause 2.5, for submission of Proposals. Except as specifically provided in this RFP, no supplementary material will be entertained by Principal / Additional Director General, and that evaluation will be carried out only on the basis of Documents received by the closing time of Proposal Due Date as specified in Clause 2.5. Bidders will ordinarily not be asked to provide additional material information or documents subsequent to the date of submission, and unsolicited material if submitted will be summarily rejected. For the avoidance of doubt, Principal / Additional Director General reserves the right to seek clarifications.", "chunk_id": 44}, {"child_chunk": "2.18.3 Technical Proposal---Bidders shall submit the technical proposal in the Form attached with this document (the “Technical Proposal”).While submitting the Technical Proposal, the bidder shall, in particular, ensure that:i. All forms are submitted in the prescribed formats and signed by the prescribed", "chunk_id": 45}, {"child_chunk": "signatories;---ii. Power of Attorney, if applicable, is executed as per Applicable Laws;iii. CVs in prescribed format of all Key Personnel have been included;iv. The concept design of the Master Plan for an area of 13192.75 sq. meters of the Integrated NACIN Complex of the Principal / Additional Director General to explain the vision of the bidder, proposed land use, urban design concepts, smart infrastructure etc. The concept design should be in the form of reports, plans, drawings, elevations, 3D views etc. sufficient in detail to explain the concept, in a maximum of A1 size supported by a walkthrough. The concept design shall also be submitted in soft copy.v. Failure to comply with the requirements spelt out in this Clause 2.8 may make theProposal liable to be rejected.vi. The Technical Proposal shall not include any financial information relating to the", "chunk_id": 46}, {"child_chunk": "Financial Proposal.---Page 17 of 46---2.18.4 The proposed team shall be composed of experts and specialists (the “Key Personnel”) in their respective areas of expertise and managerial / support staff (the “Support Personnel”) such that the PSU should be able to complete the services within the specified time schedule.The Key Personnel specified in Clause 2.7 shall be included in the proposed team of Professional Personnel. Other competent and experienced Professional Personnel in the relevant areas of expertise must be added as required for successful completion of this Project.2.18.5 A bidder may, if it considers necessary, propose suitable Sub-Consultants in specific areas of expertise.2.18.6 Principal / Additional Director General reserves the right to verify all statements, information and documents, submitted by the Bidder in response to the RFP. Any such verification or the lack of such verification by Principal / Additional Director General to undertake such verification shall not relieve the Bidder of its obligations or liabilities hereunder nor will it affect any rights of Principal / Additional Director General there under.", "chunk_id": 47}, {"child_chunk": "2.18.7 Financial Proposal---Bidders shall submit the financial proposal in the formats at Forms 7A & 7B (the “Financial Proposal”) clearly indicating the total cost of the Assignment in both figures and words, in Indian Rupees, and signed by the bidder’s authorised representative. In the event of any difference between figures and words, the amount indicated in words shall prevail. In the event of a difference between the arithmetic total and the total shown in the Financial Proposal, the lower of the two shall prevail.While submitting the Financial Proposal, the bidder shall ensure the following:i. All the costs associated with the assignment shall be included in the Financial Proposal. The total amount indicated in the Financial Proposal shall be without any condition attached or", "chunk_id": 48}, {"child_chunk": "All the costs associated with the assignment shall be included in the Financial Proposal. The total amount indicated in the Financial Proposal shall be without any condition attached or subject to any assumption, and shall be final and binding. In case any assumption or condition is indicated in the Financial Proposal, it shall be considered non- responsive and liable to be rejected.ii. The Financial Proposal shall take into account all expenses and tax liabilities. The PSU’s offer shall be inclusive of all taxes and duties (except GST) payable by them. Income Tax, GST and any other statutory taxes to be deducted at source, if any, will be deducted by the Principal / Additional Director General in accordance with the Income Tax Act and any other acts in force and in accordance with instructions issued", "chunk_id": 48}, {"child_chunk": "will be deducted by the Principal / Additional Director General in accordance with the Income Tax Act and any other acts in force and in accordance with instructions issued by the Authorities on this behalf, from time to time.iii. The GST as applicable on implementation of works shall be charged to project cost", "chunk_id": 48}, {"child_chunk": "for payment to the Goods and Service Tax Department.---iv. Costs (including break down of costs) shall be expressed in INR.2.18.8 Submission of Proposal on eprocure.gov.in---The bidders the Proposal on online procurement portal www.eprocure.gov.in in pdf file with all pages numbered serially and by giving an index of submissions. Each page of the submission shall be initialed by the authorized representative of the bidder as per the terms of the RFP.", "chunk_id": 49}, {"child_chunk": "shall---submit---Page 18 of 46---2.18.9Online uploading of bid document:---The Proposal should be uploaded online with first page mentioning the following details:(i)Name of the Project :---“Proposal for Appointment of Public Sector Undertaking for Planning, Designing and Construction of Administrative, Training, Hostel, Auditorium and Sports facilities at Nolambur, Chennai for Zonal Training Institute of National Academy of Customs, Indirect Taxes and Narcotics”.", "chunk_id": 50}, {"child_chunk": "(ii)---Due date of Submission – on or before 16.00hrs on 01.02.2019.---(iii) Bidder’s Name and Address.---2.18.10First pdf file titled “Technical Proposal _Name of Bidder”:“Technical Proposal” shall contain two pdf files clearly marked as File (A)“ Key Submissions” and File (B) “Technical Proposal”.The file marked as (A) “Key Submissions” shall contain:", "chunk_id": 51}, {"child_chunk": "a)---Letter of proposals in the prescribed format Form -1 “Form for Application”;---b)---Form-2 - Bidders profilec)---Bid processing fee (Tender Cost) of Rs.5, 000/- only (scanned copy).d)---Power of Attorney in the prescribed format Form-10---e)---Affidavit of correct information in the prescribed Form-9---f)---Undertaking for not barred or blacklisted in the prescribed Form -8The file marked as (B) “Technical Submissions” shall contain:a) A certificate from the Statutory Auditor or from Audited published Annual report forestablishing Average Annual Turn Over in the prescribed format Form – 5.b) Profile", "chunk_id": 52}, {"child_chunk": "from the Statutory Auditor or from Audited published Annual report forestablishing Average Annual Turn Over in the prescribed format Form – 5.b) Profile of the bidder providing background, organization and experience of the firm in the prescribed format shown in Form – 2 of any firm with which bidder would be associated for the purpose of providing the services for this project. A list (in the format shown in Form - 3) of past and present major works is to be submitted.c) The experience of the bidder for establishment of eligibility in the prescribed format as per Form-3. The bidder shall submit the client’s certificate for the successful completion of the project describing the role of the PSU, area, extent, cost of the project, duration of the", "chunk_id": 52}, {"child_chunk": "the client’s certificate for the successful completion of the project describing the role of the PSU, area, extent, cost of the project, duration of the project, quality of services and status of the project The bidder may submit the actual photographs of the project, brochures etc.d) Details of Key Personnel giving their Names, Position in the Team, Educational Qualifications and Project related experience of each expert to be assigned for providing the proposed services, in the prescribed format as per Form-4.g) Approach and methodology giving Understanding of the Project, the bidder’s Vision, Approach for the Project, Deployment of the Key Personnel, Time Schedule of principal activities.", "chunk_id": 52}, {"child_chunk": "Page 19 of 46---h) Concept design covering overall vision and objective, Land Use Planning, placement of the project, Urban Design Concepts, Smart Infrastructure, broad cost and implementation schedule.i) The Proposal Document and compilation of pre-bid queries / answers if any with each page initialed by the authorized signatory in token of having been read and accepted by the bidders.NOTE: BIDDERS MUST NOT INDICATE DIRECTLY OR INDIRECTLY THEIR FINANCIAL PROPOSAL ANY WHERE IN pdf FILE OF TECHNICAL PROPOSAL. ANY SUCH DISCLOSURE SHALL RESULT IN SUMMARILY REJECTION OF WHOLE OF THE PROPOSAL OF THE CONCERNED BIDDERS.2.18.11", "chunk_id": 53}, {"child_chunk": "Second pdf titled “Financial Proposal Name of the Bidder”:---Bidders shall submit the financial proposal in the formats at Form - 7A & 7B (the “Financial Proposal”) clearly indicating the total cost of the Project Services in both figures and words, in Indian Rupees, and signed by the bidder’s Authorized Representative. In the event of any difference between figures and words, the amount indicated in words shall prevail.This Financial offer shall be inclusive of all taxes, incidentals, overheads, travelling expenses, remuneration to all the personnel, accommodation, air fare, equipment, surveys prescribed in this document, site visits, printing and binding of reports and hard copies of documents for each stage package, expenditure related to presentations to be made during the execution of assignment, sundries and all other expenditure for successful completion of the services as per \"Terms of Reference\", and also the tasks the PSU may think should be carried out in order to meet the objectives of the assignment.The rates quoted shall be firm throughout the period of performance of the assignment up to discharge of all obligations of the PSU under the Agreement.", "chunk_id": 54}, {"child_chunk": "NOTE: NO COUNTER CONDITIONS SHOULD BE INCLUDED ANYWHERE IN THE---PROPOSAL. CONDITIONAL PROPOSAL MAY BE SUMMARILY REJECTED.2.18.12Bid Security---The bidder shall furnish as part of its Proposal, a bid security of Rs. 5 Lakhs/- (Rupees Five Lakhs only) in the form of a Demand Draft/Banker’s Cheque issued by one of the Nationalized / Scheduled Banks in India in favour of the “ADDITIONAL DIRECTOR NACEN CHENNAI” payable at Chennai. A scanned copy of Demand Draft / Banker’s Cheque should be uploaded on the website along with technical bid and the original copy of Demand Draft / Banker’s Cheque be delivered to the Principal / Additional Director General, National Academy of Customs, Indirect Taxes and Narcotics, Plot No: 3/86-E, A.T.C. Road, Ambattur Industrial Estate, Chennai – 600 058.Bid security shall be returnable but without any interest not later than 90 (Ninety) days from date of opening of Bid. The Selected bidder’s Bid Security shall be returned, upon the bidder signing the Agreement and upon furnishing the Performance Bank Guarantee from a Nationalized / Scheduled Bank as required under this RFP.", "chunk_id": 55}, {"child_chunk": "Page 20 of 46---Any Bid not accompanied by the Bid Security shall be rejected as non-responsive.---Principal / Additional Director General shall not be liable to pay any interest onthe Bid Security and the same shall be interest free.2.18.13TAXES AND DUTIES:The offer by Public Sector Undertaking (PSU) shall be inclusive of all taxes and duties (except Goods and Service Tax) payable by them. The Goods and Service Tax as applicable on implementation of works shall be charged to project cost for payment to the Goods and Service Tax Department. Income Tax, GST and any other statutory taxes to be deducted at source, if any, will be deducted by the Principal / Additional Director General in accordance with the Income Tax Act and any other acts in force and in accordance with instructions issued by the Authorities on this behalf, from time to time.In case any new tax introduced by Indian Government by new legislation, the same will be extra and will be allowed to be charged by Principal / Additional Director General on production of proof of payment. However, before payment of such taxes the successful bidder shall obtain prior approval of the Principal / Additional Director General.2.18.14", "chunk_id": 56}, {"child_chunk": "Proposal Due Date---Copy of the proposal should be submitted up to 1600 hours Indian Standard Time (IST) on 01.02.2019, on eprocure.gov.in. Proposals submitted by facsimile transmission, telex or e-mail will not be acceptable. It will be the sole responsibility of the bidder that the proposal should reach the address before the due date and time.Principal / Additional Director General, at his sole discretion, may extend theProposal Due Date by issuing an Addendum if any.2.18.15", "chunk_id": 57}, {"child_chunk": "Late Proposal:---Any Proposal received by Principal / Additional Director General after 1600 hours IST on Proposed Due Date may not be accepted and shall be returned unopened to the Bidder.2.18.16Modifications to submitted proposals:Any alterations, modifications or change in the submitted proposals shall be permitted and considered up to 2 days before the Proposal due date only and sent in writing, sealed, marked, and delivered in accordance with the provisions of this RFP, with the “SUBSTITUTION” or pdf “WITHDRAWAL”, as appropriate and must reach Principal / Additional Director General prior to the closing time on last date set for submission of proposals. No notice of change, alterations or modification of the proposal shall be accepted after closing time on last date.files being additionally marked“MODIFICATION”,", "chunk_id": 58}, {"child_chunk": "Page 21 of 46---Section 3---EVALUATION OF THE BIDS AND SELECTION OF THE PSUs---3.1 Evaluation of Proposals---The proposals shall be evaluated on the basis of Quality Cost Based System (QCBS)3.1.1 The Evaluation Committee (EC) shall open the proposals at 04.02.2019 at the place specified and in the presence of the bidders who choose to be present during opening of Bids. The pdf files marked “Technical Proposal” shall be opened first. The pdf files marked “Financial Proposal” shall be kept sealed for opening at a later date.3.1.2 Proposals for which a notice of withdrawal has been submitted shall not", "chunk_id": 59}, {"child_chunk": "shall be kept sealed for opening at a later date.3.1.2 Proposals for which a notice of withdrawal has been submitted shall not beopened.3.1.3 Prior to evaluation of Proposals, Principal / Additional Director General will determine whether each Proposal is responsive to the requirements of the RFP on the basis of documents submitted in the pdf file “A”: “Key Submissions”.A Proposal shall be considered responsive only if:i. the Technical Proposal is received in the form specified in this document; ii. it is received on or before the Proposal Due Date and Time. iii. it is accompanied by a Bid Processing fee (Tender Cost) the Power of Attorney,affidavit, undertaking etc.;iv. it contains", "chunk_id": 59}, {"child_chunk": "it is accompanied by a Bid Processing fee (Tender Cost) the Power of Attorney,affidavit, undertaking etc.;iv. it contains all the information (complete in all respects) as requested in the RFP;3.1.4 Principal / Additional Director General reserves the right to reject any Proposal for alteration, modification, which substitution or withdrawal shall be entertained by Principal / Additional Director General in respect of such Proposals. The bids without the Bid processing fee (Tender Cost) shall NOT be considered as responsive.is non-responsive and no request3.1.5 The proposals which are found responsive will be processed further for the opening of pdf file B “Technical Proposal” immediately and the content of the proposal will be verified.", "chunk_id": 59}, {"child_chunk": "3.1.6 Technical Evaluation---Responsive bids shall be examined in details for their technical contents. Compliance to detailed Terms of Reference taking into account proposed Approach and Methodology, Experience of bidder, proposed work plan for implementation, team composition etc. with reference to adequacy, acceptability Page 22 of 46and understanding of the bidders shall be checked. The detailed evaluation of Technical proposals shall be carried out as follows:3.1.6.1 Total marks for the Technical Section are 100 and are assigned to various technical parameters for evaluation of the bid. It shall consist of two sections i.e. Section A for bidder’s relevant experience and Section B for approach and methodology proposed concept, design & presentation. For evaluation under Section B, all the bidders who fulfil the eligibility criteria as mentioned in para 2.8, made submissions in terms of para 2.9, uploaded the documents as stated in para 2.18.9, 2.18.10 & 2.18.11 and who have paid the Bid Security as stated in prescribed in para 2.18.12 would be called for presentation of concept design before the Evaluation Committee.The methodology for evaluation is shown in the following table:", "chunk_id": 60}, {"child_chunk": "Sr. No---Particulars---Maximu m Marks---Criteria---A---Section A : Bidders relevant experience- will consist of the following :30 (Total )---1Should have carried out Designing, Planning, Engineering and Construction of Training Establishment of at least Rs. 50crores in the last 5 years.15For one project, 10 marks will be awarded. For every additional project, an additional 2.5 marks will be awarded with a cap of maximum of additional 5 marks.2Should have prepared a DPR and transacted one project for civic infrastructure of minimum of Rs. 100 Crores in the last 5 years.15For one project, 10 marks will be awarded. For every additional project, an additional 2.5 marks will be awarded with a cap of maximum of additional 5 marks.", "chunk_id": 61}, {"child_chunk": "B---Section B : Approach and Methodology Proposed Concept presentation.---design---and---70(Total)---a---Concept Design & Layout proposed---35Marks shall be awarded based on the quality of approach and methodology, the concept design and its presentation proposed by the bidder.Page 23 of 46---b---Special Features---12Scoring will be granted for maximum use of daylight and ventilation in the design.", "chunk_id": 62}, {"child_chunk": "c---Implementation Scheme---10The bidder will present an implementation plan with specific timelines and methodological approach to the project.d---e---Optimal utilization of land available---Environment Friendliness---85The bidder will use all the available FSA leaving the open spaces and ample parking for the residents and visitors Compliance with locally applicable Green building norms like GRIHA III/IV", "chunk_id": 63}, {"child_chunk": "Grand Total (Section A+B)---1003.1.6.2Presentation of the Concept Design:---The presentation of concept design shall be evaluated by an Evaluation Committee constituted by Director General NACIN Faridabad. The Evaluation Committee shall allocate marks for Approach and Methodology proposed, Concept design and presentation according to the Evaluation Criteria.3.1.6.3", "chunk_id": 64}, {"child_chunk": "Minimum Eligibility Criteria for Opening of Financial Proposal:---The bidder needs to achieve minimum of 50 marks out of 100 marks (Section A and B put together) but minimum 15 marks in Section A and 30 Marks in Section B in the above Evaluation Criteria to qualify for financial bid opening. The shortlisted bidders will be called as “Technically Qualified”. The financial bids of the bidders who do not qualify in Technical Evaluation shall be returned unopened.", "chunk_id": 65}, {"child_chunk": "Illustration---Table: 1---Bidder details---Technical Score based on Grading System---Bidder 1---100Bidder 2---90Bidder 3---40*Bidder 4---80Since the eligible technical score should be 50 & above, bidder 3 is rejectedPage 24 of 46---3.1.7Limited Technical Qualified Bidders:---In case, less than three technically qualified bidders remain in fray after technical evaluation, then a short term extension may be provided for new bidders to participate. In the event there still are less than three technically qualified bidders then the tender process would be carried on with remaining bidder/bidders.", "chunk_id": 66}, {"child_chunk": "3.1.8 Opening and evaluation of Financial Proposal:---3.1.8.1 Financial Proposal of “Technically Qualified” bidders who are found acceptable on scrutiny of technical contents and satisfy the criteria for evaluation, as specified in Clause-3.1.6.3 above of Proposal Document will be opened in the presence of authorized representative of concerned bidders (not more than two in numbers per bidder), who may wish to remain present.3.1.8.2 Financial proposals will be checked and the bidders will be ranked in the following manner:", "chunk_id": 67}, {"child_chunk": "FINANCIAL BID EVALUATION---Illustration:---Table: 2---Bidders details---Financial Bid Amount---Bidder 1---1,30,000Bidder 2---1,20,000Bidder 4---1,00,000 (L-1)Conversion of financial bid amount to scoreTable: 3---Bidders details---Bidder 1---Financial Amount 1,30,000---Bid---Financial Score (LFB / F*100)---100000/130000*100 76.92Bidder 2---1,20,000100000/120000*100 83.33Bidder 4---1,00,000100000/100000*100 100LFB = Lowest Financial Bid, F = Quoted Amount of the PSU---# The normalized score will be taken up to 2 decimal points3.1.8.3 Financial proposal with any counter conditions or ambiguous remarks shall be rejected.", "chunk_id": 68}, {"child_chunk": "Page 25 of 46---3.1.9 Selection and Award of the Contract:---The selection of the PSU shall be done on the basis of highest score by adding marks obtained in Technical bid and the Financial bid. Technical Bids are accorded a weightage of 70% and Financial Bids at 30%.", "chunk_id": 69}, {"child_chunk": "Illustration for calculation of final score:---Table: 4---Bidders Details---Technical Score---Financial Score---Bidder 1---10076.92Bidder 2---9083.33Bidder 4---80100Table: 5---Bidder Details---the Applying weights Technical Score & Financial Score---for---CTFS (Combined Technical and Financial Score)---Rank of the Bidder---Bidder 1---100*(70/100)+76.92*(30/100)93.07 (70+23.07) L1Bidder 2---90*(70/100)+83.33*(30/100)87.99 (63+24.99)L2---Bidder", "chunk_id": 70}, {"child_chunk": "(63+24.99)L2---Bidder 4---80*(70/100)+100*(30/100)86 (56 + 30)L3---3.2 Award of Contract:---3.2.1 The contract of the project will be awarded to the bidder who has scored the highest total marks (L1) i.e. by adding marks obtained in financial bid and Technical bid.3.2.2 The Principal / Additional Director General will notify the successful bidder evaluated as per clause no.3.1.9 above, in writing. The Bidder selected for award of assignment shall be issued a Letter of Award by Principal / Additional Director General. This letter along with written acknowledgement of the successful Bidder shall", "chunk_id": 70}, {"child_chunk": "for award of assignment shall be issued a Letter of Award by Principal / Additional Director General. This letter along with written acknowledgement of the successful Bidder shall constitute contract between the Bidder and the Principal / Additional Director General, till signing of formal agreement. The PSUs should bear in mind that the final award of the work is consequent to the administrative approval and expenditure sanction of the Competent Authority and the PSU shall bear the cost of all activities before the administrative approval and expenditure sanction of the Competent Authority and neither the Principal/Additional Director General or National Academy of Customs Indirect Taxes & Narcotics or any other department of the Government of India shall not be liable to pay any cost or damages.3.2.3 The correspondence exchanged up to", "chunk_id": 70}, {"child_chunk": "or any other department of the Government of India shall not be liable to pay any cost or damages.3.2.3 The correspondence exchanged up to and including the stage of award of the contract and the letter of acceptance will form part of contract Agreement. All costs, charges and expenses including the stamp duty incurred in connection with this Contract for preparation and completion of Agreement will be borne by the awardee of Page 26 of 46contract. Until such Contract Agreement is executed the acceptance of the Bid in terms of the Contract as defined shall be binding upon the Bidder and shall be the contract.3.2.3.1 Failure of the Successful Bidder to comply with the requirement shall constitute sufficient grounds for the annulment/ withdrawal", "chunk_id": 70}, {"child_chunk": "Failure of the Successful Bidder to comply with the requirement shall constitute sufficient grounds for the annulment/ withdrawal of the LOA. In such an event, Principal / Additional Director General reserves the right to take any such measures as may be deemed fit in the sole discretion of Principal / Additional Director General,including annulment of the Selection process. deployment of Technical support team at Delhi.3.2.4 The PSU shall be required to mobilize manpower and other logistic support and technical support, within 20 days from the date of signing the agreement. The date of commencement of services shall start from the date of activation of site office and", "chunk_id": 70}, {"child_chunk": "3.2.5 Performance Security:---Within 21 days of issue of letter of award from the Principal / Additional Director General, the successful Bidder shall furnish to the Principal / Additional Director General a Performance Security in the form of a Bank Guarantee of a scheduled / nationalized bank for an amount equivalent to 5% of the Lump Sum Service charges. Failure of the successful Bidder to lodge the required bank guarantee shall constitute sufficient grounds for the termination of contract. The performance security shall remain in force until six months from the date of issue of completion certificate of this assignment. The obtaining of such guarantee (and the cost of guarantee), shall be at the expense of the Bidder.", "chunk_id": 71}, {"child_chunk": "3.2.6 Contacts during Proposal Evaluation---Proposals shall be deemed to be under consideration immediately after they are opened and until such time the Principal / Additional Director General makes official intimation of award / rejection to the Bidders. While the Proposals are under consideration, Bidders and /or their representatives are advised to refrain from contacting by any means, Principal / Additional Director General and / or their employees / representatives on matters related to the Proposals under consideration.", "chunk_id": 72}, {"child_chunk": "3.2.7 Penalty for delay in execution---In case of delay in execution and completion of the project within the time period proposed and agreed upon by the bidder, the bidder will be liable to pay as damages to National Academy of Customs, Indirect Taxes and Narcotics, Chennai a sum calculated @ 2% ( Two Percent only) of the agency charges per month and proportionately for each day of delay subject to FORCE MAJEURE and further if delay is occasioned for any reason of any act or legislation or restriction, prohibition or restrained imposed by any Statutory Body and or Governmental Authority, no liability shall attach to the Builder. This clause shall hold well provided there is no delay on the Owner's part.", "chunk_id": 73}, {"child_chunk": "3.3 Extension of validity of proposal:---If it becomes necessary, Principal / Additional Director General, Delhi may request the Bidders, in writing, to extend validity of proposals.Page 27 of 46---3.4 MISCELLANEOUS disputes arising under, pursuant to and / or in connection with the Selection Process. incurring any obligation or liability, reserves the right any time to;3.4.1 The Selection Process shall be governed by, and construed in accordance with, the laws of India and the Courts at Chennai shall have exclusive jurisdiction on overall", "chunk_id": 74}, {"child_chunk": "3.4.2 Principal / Additional Director General, in its sole discretion and without---(a) Suspend and / or cancel the Selection Process and / or amend and/or supplement the Selection Process or modify the dates or other terms and conditions relating thereto;(b) Consult with any Bidder in order to receive clarification or further information;(c) Retain any information and/ or evidence submitted to Principal / Additional Director General by, on behalf of and/or in relation to any Proposal; and/or(d) Independently verify, disqualify, reject and/or accept any and all submissions or other information and / or evidence submitted by or on behalf of any Bidder.It shall be deemed that by submitting the Proposal, the Bidder agrees and releases Principal / Additional Director General, its employees, agents and advisers, irrevocably, unconditionally, fully and finally from any and all liability of or claims, losses, damages, costs, expenses or liabilities in any way related to or arising from the exercise of any rights and/or performance of any obligations hereunder, pursuant hereto and/or in connection herewith and waives any and all rights and/or claims it may have in this respect, whether actual or contingent, whether present or future.", "chunk_id": 75}, {"child_chunk": "3.4.3 Time & Payment Schedule---The bidders would present a time and payment schedule as per the conditions prescribed in the RFP document which would be finalized by the Principal / AdditionalDirector General at the time of awarding final contract.3.4 Confidentiality---the examination, clarification, evaluation and 3.4.1 Information relating recommendation for the Proposals shall not be disclosed to any person who is not officially concerned with the process or is not a retrained professional advisor advising Principal / Additional Director General in relation to or matters arising out of, or concerning the Selection Process. Principal / Additional Director General will treat all information, submitted as part of the Proposal, in confidence and will require all those who have access to such material to treat the same in confidence. Principal / Additional Director General may not divulge any such information unless it is directed to do so by any statutory entity that has the power under law to require its disclosure or is to enforce or assert any right or privilege of the statutory entity and/or Principal / Additional Director General.", "chunk_id": 76}, {"child_chunk": "to---3.5 Integrity Pact---3.5.1 The bidder will sign an integrity agreement with the Principal / Additional Director General as provided in Form 11.****Page 28 of 46---Section 4:---Forms for Technical and Financial Proposals---Sr. No.---Description---To be submitted in Technical ProposalForm – 1---Form for Application---", "chunk_id": 77}, {"child_chunk": "Form – 2---Bidder’s Profile---Form-3---Major works during last Ten years which best illustrates Qualifications for the Assignment under Offer.Form-4---Details of Key Personnel---Form-5---Form for average Turn Over---Form-6---Checklist of Documents submittedForm-8---Undertaking for Not Barred or Blacklisted---Form-9---Affidavit of Correct Information---Form 10---Power of attorney---Form 11---Integrity Agreement---To be submitted in Financial Proposal", "chunk_id": 78}, {"child_chunk": "Form-7A---Letter for Financial Proposal---Form –7B---Format for Financial Proposal---Page 29 of 46---FORM -1---FORM FOR APPLICATION---(On the Letter head of the Bidder)---Date :---To,The Principal / Additional Director General---National Academy of Customs, Indirect Taxes and Narcotics,Plot No: 3/86E, A.T.C. Road,2nd Main Road, Ambattur Industrial Estate,Chennai – 600 058.Tel No. 044 26250143", "chunk_id": 79}, {"child_chunk": "Email – vnair.1966@gov.in, vnair1966@gmail.com---Sub.: \" Appointment of Public Sector Undertaking for Planning, Designing and Construction of Administrative, Training, Hostel, Auditorium and Sports facilities for the Zonal Training Institute of the National Academy of Customs, Indirect Taxes & Narcotics at Nolambur, Chennai”Sir,Being duly authorized to represent and act on behalf of ……………….. (Hereinafter referred to as \"the Bidder\") and having reviewed and fully understood all of the requirements of the Proposal document and information provided, the undersigned hereby apply for the project referred above. We confirm the validity of the proposal for 30 days from the date of opening of Price Proposal.We", "chunk_id": 80}, {"child_chunk": "undersigned hereby apply for the project referred above. We confirm the validity of the proposal for 30 days from the date of opening of Price Proposal.We have studied RFP and all other documents carefully and also surveyed the Project site. We understand that except to the extent as expressly set forth in the Agreement, we shall have no claim, right or title arising out of any documents or information provided to us by the Principal / Additional Director General or in respect of any matter arising out of or concerning or relating to the Selection Process including the award of Project.The Financial Proposal is being submitted in a separate cover. This Technical Proposal read with the Financial Proposal shall constitute the Application which shall be binding on us.I/We agree and undertake to abide by all the terms", "chunk_id": 80}, {"child_chunk": "This Technical Proposal read with the Financial Proposal shall constitute the Application which shall be binding on us.I/We agree and undertake to abide by all the terms and conditions of the RFP Document. In witness thereof, I/we submit this Proposal under and in accordance with the terms of the RFP Document.We are enclosing our Proposal including Technical Proposal and Financial Proposal in one original plus one copy, with the details as per the requirements of the Proposal Documents, for your evaluation.", "chunk_id": 80}, {"child_chunk": "Signature, name and designation of the authorised signatory)---For and on behalf of ………………..---Page 30 of 46---FORM-2 Bidder’s Profile---(Page1-2)I.Particulars of the Applicant---II. Title of Consultancy:---Sole Firm---III. State the following:i. Name of Public Sector Undertaking:---ii. Year of Incorporation:---iii. Year of commencement of business:---", "chunk_id": 81}, {"child_chunk": "iv. Principal place of business:---IV. Brief description of the PSU including details of its main lines of BusinessV. Name, designation, address and phone numbers of authorised signatory of the---Applicant:---i. Name---:ii. Designation---:iii. Address---:iv. Company---:v. Phone No---:vi. Email id---:VI. Registered address and principal place of business.---", "chunk_id": 82}, {"child_chunk": "For the Applicant, state the following information:---i. Provide the office address(s) in India.ii. Has the Applicant been penalized by any organization for poor quality ofwork or breach of contract in the last five years?---Yes/No---iii. Has the Applicant/ Member ever failed to complete any work awarded to", "chunk_id": 83}, {"child_chunk": "it by any public authority/ entity in last five years?---Yes/No---iv. Has---the Applicant been blacklisted byany Government---department/Public Sector Undertaking in the last five years?---Yes/No---v. Has the Applicant suffered bankruptcy/insolvency in the last five years?Yes/No---Note: if answer to any of the questions at (ii) to (v) is yes, the Applicant is not eligible for this services assignment.VII. Does the Applicant’s firm/company combine functions as a consultant or adviser", "chunk_id": 84}, {"child_chunk": "along with the functions as a contractor and/or a manufacturer?---Yes/No---Page 31 of 46---VIII. Does the Applicant intend to borrow or hire temporarily, personnel forperformance of the Project Services?---Yes/No---(Signature, name and designation of the authorised signatory)---For and on behalf of ………………..---Page 32 of 46---", "chunk_id": 85}, {"child_chunk": "FORM - 3---(Page 1 of 2)MAJOR WORKS DURING LAST TEN YEARS WHICH BEST ILLUSTRATES QUALIFICATIONS FOR THE ASSIGNMENT UNDER OFFER.(i)The following information should be provided in the format indicated for each reference project for which your company, either individually as a corporate entity or as one of the major companies within a consortium was legally contracted by the client stated below.", "chunk_id": 86}, {"child_chunk": "(ii)---The information should be specific & to the point to facilitate a quick and objective decision.(iii) Use a separate sheet for each separate work.1)Project Name : _____________________________________2)Country---:_____________________________________3)Project location---:_____________________________________in the country---4)Name & Address---:_____________________________________of the client with---_____________________________________Tel. No. & Fax No.---_____________________________________5)Do you have any objection if the client is contacted for reference?", "chunk_id": 87}, {"child_chunk": "Yes/No.---6)Detailed description of the work---1Cost of Project---2 Area---of---Project---3 Builtup Area---4 Design---Page 33 of 46---5Status---6 Remarks---mentioning special any features of the project7) Were the services provided exclusively by your firm? Yes/No (or)Were services provided by your firm in association with other firms? Yes/NoExact description of the division of responsibility for items listed at (6) above as between you & your Associate:8)Detailed description of the actual services provided under following types for each component of the project", "chunk_id": 88}, {"child_chunk": "i)---Detailed design and engineering for implementation of the Project (DD).ii) (TS).---Preparation of tender documents, evaluation of tenders and award of contract---iii) contract and including certification of payment to the contractors (CS).Construction Supervision including commissioning and administration of& the share and role of your firm & of the Associate, if any, against each type of the component & each type of service listed above.9)Professional Staff provided & fees received:", "chunk_id": 89}, {"child_chunk": "Own Firm---Associate---No. of Professional Staff: a) Experts at---level of subject specialties & their principal assistants.---the---b) Supporting technical staff (excluding draftsman & office staff).Page 34 of 46---No. of man months of (a) + (b)---Fees received (INR)---10) Assignment start date---: ____________________________________(Month/Year)---____________________________________11) Assignment completion---", "chunk_id": 90}, {"child_chunk": "Date (Month/Year)---: ____________________________________ ____________________________________12) Duration of assignment---:_________________ (months)Day this ______________ day of _____________________ 20Seal and---(Signature, name and designation of the authorised signatory)---For and on behalf of ………………..---Page 35 of 46---Form- 4---Details of Key Personnel---Sr. No.---Name---Position---Educational qualifications---Related Experience---Seal and---(Signature, name and designation of the authorised signatory)---", "chunk_id": 91}, {"child_chunk": "For and on behalf of ………………..---Page 36 of 46---Form-5---Average Annual Turn Over of the Firm:---Sr. No---Year---Turn Over in Rs in Crores---12015-201622016-201732017-20184Average---(Signature, name and designation of the Chartered Accountant)---(Signature, name and designation of the authorised signatory)---For and on behalf of ………………..---Page 37 of 46---", "chunk_id": 92}, {"child_chunk": "Form-6---Checklist of Submission---Sr.no Particulars---Yes/no---Page---1Status of the Public Sector Undertaking---2Turnover eligibility CAs certificates---3Technical eligibility---4Clients Certificate---5Duly filled Forms for Technical proposals6Duly filled Financial bids7All the documents are Numbered and signed by the authorised Signatory8Processing fee is paid9All the documents are properly scanned(Signature, name and designation of the authorised signatory)---", "chunk_id": 93}, {"child_chunk": "For and on behalf of ………………..---Page 38 of 46---FORM-7 A---LETTER FOR FINANCIAL PROPOSAL---From: _______________________ _______________________To The Principal / Additional Director General National Academy of Customs, Indirect Taxes and Narcotics, Plot No: 3/86E, A.T.C. Road, 2nd Main Road, Ambattur Industrial Estate, Chennai – 600 058. Tel No. 044 26250143", "chunk_id": 94}, {"child_chunk": "Email – vnair.1966@gov.in, vnair1966@gmail.com---Sub: “Appointment of Public Sector Undertaking for Planning, Designing and Construction of Administrative, Training, Hostel, Auditorium and Sports facilities for the Zonal Training Institute of the National Academy of Customs, Indirect Taxes & Narcotics at Nolambur, Chennai”I/We have perused the Proposal Document for subject assignment and other details and am/are willing to undertake and complete the assignments as per terms and conditions stipulated in the 'Proposal Document'. Our total price offer inclusive of all taxes (Excluding Goods and Service Tax which is charged to project cost as per actuals), incidentals, overheads, traveling expenses, printing and binding of reports, expenditure related to presentation to be made during the execution of the assignment, sundries, all other items involving expenditure for execution of this assignment covering scope as stipulated in \"Terms of Reference\" (enclosed is Appendix-I as Rupees (i.e. Rs.___________________________________ ______________________________________ only). The break-up of price offer in the required Proforma is enclosed herewith.", "chunk_id": 95}, {"child_chunk": "to---the---Proposal in---Words---Document)---financial proposals.---This offer is valid for a period of 180 days from the date of opening of theAuthorized Signature [in full and initials]:---Name---:Designation---:Name of Firm :---Address---:Page 39 of 46---FORM-7B---Financial Proposal---Sl. No.---Name of Assignment---the---Lump sum Fees to be quoted (inclusive of all Taxes, travel, lodging and boarding, Stationary Printing, submittals etc excluding Goods and Service Tax)1", "chunk_id": 96}, {"child_chunk": "Financial Bid---(In numerical digits)---(In words)---Authorized Signature [in full and initials]:---Name---:Designation---:Name of Firm :---Address---:Page 40 of 46---Form 8---Undertaking for not barred or blacklistedI/We hereby undertake the followingg:1. I/We undertake that neither I/ we or any of our members and any of its constitutes has been barred or blacklistedd by any Central and/or State Government of India.2. I/We undertake that neither I / we individually or institutionally are not in any manner involved with the selection / screening process of this EOI /RFP and employees of Principal / Additional Director General.", "chunk_id": 97}, {"child_chunk": "Authorized Signature [in full and initials]:---Name---:Designation---:Name of Firm:---Address---:Page 41 of 46---Form-9 Affidavit of Correct Information---The Principal / Additional Director General---National Academy of Customs, Indirect Taxes and Narcotics, Plot No: 3/86E, A.T.C. Road, 2nd Main Road, Ambattur Industrial Estate, Chennai – 600 058. Tel No. 044 26250143", "chunk_id": 98}, {"child_chunk": "Email – vnair.1966@gov.in, vnair1966@gmail.com---With reference to the documents submitted to Principal / Additional Director General, we hereby undertake that other than the details provided under RFP Submission, we have no dispute/ litigation/ legal proceedings against any of our clients, in any of our projects other than the listed.All documents and information submitted in Technical Tender (including the above undertaking) are certified to be accurate, correct and final. In the event that any of the documents or information submitted by us is found to be in-accurate/ incorrect/ misleading, we understand that our Tender is liable to be cancelled or if contract is awarded, contract is liable to be terminated, without prejudice to any of the rights of Principal / Additional Director General, which otherwise may be accruable to Principal / Additional Director General.I also undertake that I will furnish all other documents required under the Tender document or contract, after signing the agreement during execution of work.", "chunk_id": 99}, {"child_chunk": "Authorized Signature [in full and initials]:---Name---:Designation---:Name of Firm:---Address---:Page 42 of 46---Form-10---Power of Attorney for signing of Proposal---Know all men by these presents, We, ________________________ (name of the firm and address of the registered office) do hereby irrevocably constitute, nominate, appoint and authorise Mr. / Ms. (Name), son/daughter/wife of ________________________ and presently residing at ________________________, who is [presently employed with us/ and holding the position of ________________________], as our true and lawful attorney (hereinafter referred to as the “Attorney”) to do in our name and on our", "chunk_id": 100}, {"child_chunk": "________________________], as our true and lawful attorney (hereinafter referred to as the “Attorney”) to do in our name and on our behalf, all such acts, deeds and things as are necessary or required in connection with or incidental to submission of our Proposal for Services for \"Appointment of Public Sector Undertaking for Planning, Designing and Construction of Administrative, training, Hostel and Sports facilities at Nolambur, Chennai.” including but not limited to signing and submission of all applications, Bids and other documents and writings, participate in PSU' and other conferences and providing information / responses to the Principal / Additional Director General, representing us in all matters before the Authority, signing and execution of all contracts including the Service Agreement and", "chunk_id": 100}, {"child_chunk": "/ responses to the Principal / Additional Director General, representing us in all matters before the Authority, signing and execution of all contracts including the Service Agreement and undertakings consequent to acceptance of our Bid, and generally dealing with the Principal / Additional Director General in all matters in connection with or relating to or arising out of our Proposal for the said Project and/or upon award thereof to us and/or till the entering into of the Service Agreement with the Principal / Additional Director General.AND we hereby agree to ratify and confirm and do hereby ratify and confirm all acts, deeds and things lawfully done or caused to be done by our said Attorney pursuant to and in exercise of the powers conferred by this Power of Attorney and that all acts, deeds and", "chunk_id": 100}, {"child_chunk": "or caused to be done by our said Attorney pursuant to and in exercise of the powers conferred by this Power of Attorney and that all acts, deeds and things done by our said Attorney in exercise of the powers hereby conferred shall and shall always be deemed to have been done by us.IN WITNESS WHEREOF WE, ________________________, THE ABOVE NAMED PRINCIPAL HAVE EXECUTED THIS POWER OF ATTORNEY ON THIS __________ DAY OF __________, 20**.For________________________", "chunk_id": 100}, {"child_chunk": "(Signature)---Witnesses:---1.2.3. Accepted---[Notarized]---(Signature)---(Name, Title and Address of the Attorney)---Notes:---The mode of execution of the Power of Attorney should be in accordance with the procedure, if any, laid down by the applicable law and the charter documents of the executants(s) and when it is so required, the same should be under common seal affixed in accordance with the required procedure.", "chunk_id": 101}, {"child_chunk": "Page 43 of 46---Also, wherever required, the PSU should submit for verification the extract of the charter documents and documents such as a resolution/power of attorney in favor of the person executing this Power of Attorney for the delegation of power hereunder on behalf of the PSU.For a Power of Attorney executed and issued overseas, the document will also have to be legalised by the Indian Embassy and notarised in the jurisdiction where the Power of Attorney is being issued.", "chunk_id": 102}, {"child_chunk": "Page 44 of 46---Form 11 Integrity Pact (to be provided on the letterhead of the agreement)Commitments of the Bidder---The bidder commits to take all measures necessary to prevent corruption. It commits itself to observe the following principles during its participation in this tender process and during the Agreement execution.The bidder will not, directly or through any other persons or firm, offer promise or give to any of the Purchaser’s employees involved in this tender process or the execution of the agreement or to any third person any material or other benefits which he/she is not legally entitled to, in order to obtain in exchange any advantage of any kind whatsoever during this tender process or during the execution of the agreement.The bidder will not enter with other bidder", "chunk_id": 103}, {"child_chunk": "order to obtain in exchange any advantage of any kind whatsoever during this tender process or during the execution of the agreement.The bidder will not enter with other bidder (s) into any undisclosed agreement or understanding, whether formal or informal. This applies in particular to prices, specifications, certifications, subsidiary contracts, submission or non-submission of bids or any other actions to restrict competitiveness or to introduce cartelization in this tender process.The bidder will not commit any offence under the Indian Penal Code 1860 and/or Prevention of Corruption Act, 1988; further the bidder will not use improperly, for purposes of competition or personal gain, or pass on to others, any information or document provided by the purchaser as part of the business relationship, regarding plans, technical proposals", "chunk_id": 103}, {"child_chunk": "or personal gain, or pass on to others, any information or document provided by the purchaser as part of the business relationship, regarding plans, technical proposals and business details, information contained in or transmitted electronically.The bidder will, when presenting its bid, disclose any and all payments it has made is committed to or intends to make to agents, brokers or any other intermediaries in connection with this tendering process or the award of agreement under this tendering process.The bidder will not, directly or through or any other person or firm, approach any government officials, ministers, political persons public servants, or any external agencies in an effort to influence the bidding decision making process or to attend any undue favors to the bidder.The bidder shall exclude, from this tender process or", "chunk_id": 103}, {"child_chunk": "agencies in an effort to influence the bidding decision making process or to attend any undue favors to the bidder.The bidder shall exclude, from this tender process or execution of the agreements those all employees/directors/management representatives or the bidder who have family relationships with the employees or officers of the purchaser.knownprejudiced", "chunk_id": 103}, {"child_chunk": "persons---includingThe bidder will not indulge in any corrupt, fraudulent, coercive undesirable or restrictive practice in the tender process or the execution of the agreement.The bidder will not instigate third persons to commit offences outlined above orbe an accessory to such offences", "chunk_id": 104}, {"child_chunk": "Page 45 of 46---Section - 5---Appendix – I---TERMS OF REFERENCE (TOR)\" Appointment of Public Sector Undertaking for Planning, Designing and Construction of Administrative, Training, Hostel, Auditorium and Sports facilities for the Zonal Training Institute of the National Academy of Customs, Indirect Taxes & Narcotics at Nolambur, Chennai”Detailed scope of workThe PSU service assignment has the following major components: -Component - I: Overall Vision and Master Plan for approx. 13192.75 sq. meter (3.26 acres) of landThe National Academy of Customs, Indirect Taxes and Narcotics, Chennai owns a plot of land measuring about 13192.75 sq. meter", "chunk_id": 105}, {"child_chunk": "landThe National Academy of Customs, Indirect Taxes and Narcotics, Chennai owns a plot of land measuring about 13192.75 sq. meter situated at Nolambur, Chennai for the project development.The tasks under Component I shall include but not limited to:Study of best international and national similar examples and find out suitable component which can be incorporated in master plan. The task under component I covers mainly total site suitability analysis, preparation of Vision document, broad land use plan, Study and preparation of proposals of urban design, broad infrastructural design and broad phasing of development. The construction work shall be purely on CPWD/ applicable norms.Component– II: Preparation of detailed Master Plan, Infrastructure development plan, Engineering Designs, DPRs & all", "chunk_id": 105}, {"child_chunk": "shall be purely on CPWD/ applicable norms.Component– II: Preparation of detailed Master Plan, Infrastructure development plan, Engineering Designs, DPRs & all related activities.The tasks under Component II shall include but not limited to:Preparation of detailed design brief on the basis of approved concept plan of Component-I, preparation of detailed Master plan, detailed Urban design proposals, Landscape designs, Detailed Infrastructure design, DPRs, Economic and Financial Analysis. The task also involves obtaining approval from all the statutory authorities including the Environment clearance.", "chunk_id": 105}, {"child_chunk": "Page 46 of 46---", "chunk_id": 107}, {"child_chunk": "Page 46 of 46---", "chunk_id": 107}]