[{"chunk": "No. OI-16016/3/2016-OIA-II Government of India Ministry of External Affairs (Overseas Indian Affairs Division-II)Request for Proposal---for Design, Development and Maintenance of New Website for Know India Programme---Joint Secretary (Overseas Indian Affairs Division-II) Ministry of External Affairs Room N0. 906, 9th Floor Akbar Bhavan, Chanakyapuri, New Delhi-110021 Tel:91-11-24676210", "chunk_id": 1}, {"chunk": "Contact details for queries:---1. Shri Akhilesh Tripathi, Senior Systems Analyst/Scientist - 'C', NIC Mob: 9911785764 2. Shri Yogesh Gupta, Under Secretary, Tel: 24197926Table of Contents---S.NO. 1 2 3 4 56 7 8 9 10Description---Introduction scope of work Timeline for completion of activities Eligibility Criteria 5.1 Technical Proposal 5.2 Financial proposal Submission of Proposals Opening of bid Selection Process Terms and Conditions Important dates", "chunk_id": 2}, {"chunk": "Page N0.---1 1-6 7 10-11 12-13 14 15 15 16 17-20 21Table of Annexure S.No. 1 2 3 4 5 6Authorization Letter Format for Vendor Particulars Vendor’s Experience Format for Technical bid Format for financial bid EMD / Performance Security Form", "chunk_id": 3}, {"chunk": "Description /Formats---Annexure Annexure-I Annexure-II Annexure-III Annexure-IV Annexure-V Annexure-VI---Page N0.---22-23 24 25-26 27-28 29 30-317Instructions for online Bid Submission Annexure-VII---32-34Government of India Ministry of External Affairs (Overseas Indian Affairs Division-II)---Design, Development and Maintenance of website Know India Program (KIP)---Request for Proposal---1. Introduction---Ministry organizes orientation programs namely 25 days Know India Program (KIP) for Diaspora youth with a view to promote awareness on different facets of life in India and the progress made by the country in various fields e.g. economic, industrial, Science & Technology, culture. KIP provides a unique forum for students & young professionals of Indian origin to visit India, share their views, expectations & experiences and develop closer bonds with the contemporary India. Such programs are conducted every year, in partnership and coordination with State Governments.The process of selection of youths for KIP starts with notification of the program can be automated by developing a KIP Online Registration System. It will enable both MEA and the interactively. Diaspora", "chunk_id": 4}, {"chunk": "to---takepart---in---the---process---This RFP is for the selection of an agency to develop KIP website for a dynamic and responsive design, address security issues, manageability of content while maintaining compliances especially GIGW compliance. The agency should be having proven expertise in System Study, Design, Development, Implementation and Maintenance of Website / Web Portal / Web enabled application using latest available technologies like PHP, Java, .Net, Open Source, CMS such as Drupal etc. Broadly the scope of work includes", "chunk_id": 5}, {"chunk": "A. Scope of Work---i.---Study, Requirement understanding and Analysis with respect to developing new Websitesii. Design, Development and Maintenance of Web based applications and integration withtechnologies like e-Form, etc.---iii.---Content Management System of the website for progress and current status, media reports, including event photo-shoots, live feeds, social media contents, if any and periodic archiving the old contents automatically, etc.1-", "chunk_id": 6}, {"chunk": "iv.---Agency would be required to provide off-site Warranty, Maintenance, and Technical Support from the date of issue of completion certificate, and Annual maintenance of website/ application with onsite technical support as required.v.---To ensure that websites comply with the ‘Guidelines for Indian Government Websites (GIGW)’ http://guidelines.gov.in/ in full along with mobile compatibility.", "chunk_id": 7}, {"chunk": "vi.---Ensure that the website is security audited by a CERT-IN empanelled agency.vii.---Identify and execute training requirements for successful execution of project along with preparation of User Manual.viii.---Creation of manuals and documents for the project executed.B. Requirement Analysis---It will be a bilingual website for this event and it will enable the participants to create there login credentials and apply for either KIP, as per their interest, following the notifications issued by the Ministry. Basic constituents of website will be,", "chunk_id": 8}, {"chunk": "Front-end related activity---a. Home page will have sections for Login, Notifications, Activity Calendar, Media,Reports and Archives.---b. Login credentials creation module for participants. c. Login forms for Missions, administrative authorities and Event Manager for theirrespective roles.---d. Data reception forms / pages for each role, wherever required. e. Processing pages inclusive of automated email generation and embedded SMS services,wherever required, for each role.f. Reports Section for each role. g. Archival of the data.", "chunk_id": 9}, {"chunk": "Back-end related Activity---a. Designing database components as tables, structures, views and queries, whereverrequired.b. Integration of these components with the website component. c. Database backup and restore utilities.The probable information flow of website---a. Online Process Initiation---2 -1. Ministry issues notification about dates and timeline of the programs (in a year, 5 to 6KIPs are held).2. Indian Missions will undertake publicity about KIP 3. Applicants will fill in online form. 4. MEA will select participants from the list of successful candidates. 5. Mission checks and approves the application online. 6. MEA will receive the mission approved applications. 7. MEA will validate the applications and prepare a provisional list b. Offline ActivityThe list will be scrutinized and necessary approval will be taken by the division.c. Online Finalization Activity 1. MEA will electronically approve the finalized applicants 2. Notification to respective mission and the applicant along with necessary guidelines 3. Filling of online form for logistic arrangements by the candidate and completion of Visa", "chunk_id": 10}, {"chunk": "formalities.---4. Information regarding the arrangements to be made for the selected persons is sent toMEA / Event Manager in India to arrange for his / her reception, hotel and local transport.Components of Website---1. About Know India Program---2. What’s NEW---3. Notifications---a. KIP Schedule---", "chunk_id": 11}, {"chunk": "b. Location of venue---c. Calendar year for KIP---d. Rules and Regulations---4.KIP calendar year---5.List of previous KIPs---a. Participants of previous KIPs b. Places visited6.Login Options---a. Ministry Program Coordinator b. Indian Mission c. Event Manager d. Participant---3 -e. Alumni---7. Onetime Online registration module for participants---Registration Advisory   Registration cancellation policyInstruction for filling the online Registration Form8.", "chunk_id": 12}, {"chunk": "Visa and Travel Advisories---9. Media contents---a. Press release/briefings b. Media coverage on KIP c. Photo Gallery d. Video Gallery10. Partner State---a. b.---Introduction to the state Information about the State like Culture, History, art, Cuisine and Tourist Sites11. Reports---12. DownLoads---13. FAQs---14. Contact US---", "chunk_id": 13}, {"chunk": "15. External Links---C. Detailed Scope of Work---This section provides indicative scope of work for empanelled vendors. However belowwork is only indicative and would depend upon actual requirements of user department.1) Design, Development, Implementation, Training and Maintenance of Customized Web Based application/portal solutions/ Web designing. Indicative activities include:", "chunk_id": 14}, {"chunk": "Analysis---a. Finalizing the detailed list of activities, scope and duration of each of the activity and detailed project planb. Detailed discussions with concerned stakeholders to understand the overall objectives of the assignmentc. Finalization of Project Objectives/Requirements---4 -d. Submission of detailed Project Proposal / Plan Signoff on detailed project plan, activities, timelines etc. from concerned stakeholder", "chunk_id": 15}, {"chunk": "Design---a. Detailed Requirement gathering and analysis includes CMS design. Apart from uploading the contents the CMS will also enable the user to assign specific timeline for the website. displayed contentsto---beon---the---b. Study and analysis of existing /Similar website and include best practices in draft designc. Carry out a System Study to prepare the SRS and FRS", "chunk_id": 16}, {"chunk": "d. Detailed High level and Low level application designs---e. Information Integration and Consolidation---f. Client Sign-off for Requirement Analysis---g. Preparation of Content Structure/ Information Architecture for the website---h. Approval of prototype (design interface) developed by vendori. Coordination and collection of required content from the concerned stakeholderj. Approval on the content gathered by the client departmentk. Design should comply on all parameters with guidelines issued by Government of India for websitesl. Comply with website security guidelines issued by NIC and DIT, GoI.", "chunk_id": 17}, {"chunk": "Developing the Website---a. Coding / Temporary Demo server---b. Content Population and content management system---c. Provide front-end user interface that allows a user, even with limited expertise, to add, modify and remove content from a Web sited. Application Development and Unit Testing, Integration Testing, System Testing and Functional Testinge. Testing of developed website based uponCompliance to applicable guidelinesAssess the user objective achievement etc.f. Ensure that the website is GIGW Compliance certified by STQC", "chunk_id": 18}, {"chunk": "g. Completed website components for UAT---h. UAT Sign-off by user department---i. Modification based upon user feedbackj. Sign off on developed website by user department5 -Operation and Maintenance support---a. Identify and execute training requirements for successful execution of projectb. Creations of necessary documents and User Manual for training---c. Support in handover of website to user department", "chunk_id": 19}, {"chunk": "d. Support on Training/ Demo on need basis---e. Warranty Maintenance / Annual Maintenance of website---2) Designing interface/ mechanism for Mobile based application3) Implementation of map based Location Assistance system4) Designing, development and integration---a. Design of database component of the website and its integration with different modules. b. Generation of SMS and acknowledgement, wherever required. c. Automated/custom generation of necessary reports.", "chunk_id": 20}, {"chunk": "5) Design and development of the Electronic form application in Secure &---Usable format---Portal solution may include development of a complete application for electronic receipt of e-Forms, MIS reporting for various stakeholders as required by the departments, Monitoring and managing the various applications involved, etc.), printing of submitted application forms by respective departments, Status Update of individual e-Form application by respective department, Status tracking by users and Query Service.", "chunk_id": 21}, {"chunk": "6) Adherence to Web Application Audit / Compliance and Approval / Security---Features---7) Design and Development of Web application Devices having capability to connect directly to Service Provider’s central system through laptops, handheld devices, mobile etc. used for financial inclusion at grassroots level. Application should -i. Provide multichannel support (Biometric service points, Internet operated devices, Mobile, etc.).", "chunk_id": 22}, {"chunk": "ii. Have standard interface capabilities (standards like ISO, XML, web services).---iii. Multiple backend systems interfacing capabilities.iv. Capability of integration with the National Portal---8) Indicative Deliverables---High Level Design/ Architecture Document6 -Performance Test Reports  Security Test Reports  UI Usability Report  Deployment Script  User Manual/SOP  Technical Manual  Data Backup/ Archival Process  Requirement Traceability Matrix  Source Code  Infrastructure design document  Development and implementation of the online web strategy with major upgrades in the", "chunk_id": 23}, {"chunk": "design and content of the current website.---New website hosted and maintained on the new server.  Editing and proof reading of the website content.  Development of new content for the website (an indicative list mentioned above).  Frequent updates on the website.  Prompt and Proper Maintenance of website.", "chunk_id": 24}, {"chunk": "9) Timeline for completion of activities---This timeline is indicative and will be finalized with the successful vendor post selection. Thiswebsite will be hosted as sub-domain of mea.gov.in1. Vendor will develop the applicationa. 04 Weeks - Designing of website with full functionality along with CMSb. 02 Weeks – For fine tuning the website with exhaustive debugging and validating", "chunk_id": 25}, {"chunk": "from user end.---c. 03 Weeks – Website auditing, hosting and training.2. KIP nodal officer will supervise the flow and working of individual module of websiteunder-construction.---7 -Control Flow of the Activities within website---MEA initiates the Process Online. Declares timeline---MEA Issues Notification of the Program (Indian Mission undertake publicity)---", "chunk_id": 26}, {"chunk": "Overseas Indians Create Login credentials and Fill/Submit the registration form online---Mission receives the form online and checks suitability of candidateReturn the form with valid reasons and suggestions.Is Form approved by the mission?No---Yes---Forward soft and hard copy to MEA---MEA receives the mission approved applications Online", "chunk_id": 27}, {"chunk": "Process B---Process B Offline Activity---MEA scrutinizes the applications. It prepares a provisional List and finalises selections.8 -Process C---Process C Online Activity---MEA Electronically approves the application.Notification is sent to both successful applications and respective missions with necessary guidelinesCandidates apply for travel arrangements and VisaTravel arrangements made are conveyed to applicantApplicant’s itinerary is conveyed to Event Manager for reception in India", "chunk_id": 28}, {"chunk": "Participant arrives in India – fill in weekly feedback online---At end of course feedback is provided by participants and Event Manger to MEA onlineParticipant becomes part of KIP Alumni Network---Process Ends---KIP participants can keep in touch through Alumni network, after returning to home country. MEA and Indian missions have access to Alumni network.******************************** - 9 -3.A.", "chunk_id": 29}, {"chunk": "Minimum Eligibility Criteria---3.1 The Agency should be able to provide a qualified web designing, building and maintenance team, for undertaking this assignment. The Agency team would work closely with the MINISTRY. A confirmation letter from the Agency for being able to provide the qualified team should be attached. Details of the team dedicated to the MINISTRY project should be provided.The minimum eligibility criteria provided below for ready reference -", "chunk_id": 30}, {"chunk": "Sl. No.---Description---Document / Proof---1The agency should give details like name, profile etc. The agency should be registered with the Service Tax department and carry a valid PAN/TAN. Proof of the same must be submitted.Copy of Service Tax Registration - Copy of PAN Card - Copy of TAN CardDetails are to be submitted in the format given in Tech Bid: Details of the Bidder Organization23The agency should produce Articles of Association (in case of registered firms), Bye laws and certificates for registration issued by the Registrar of Companies. (Please upload only relevant portions)The agency’s turnover should be more than INR 5 Crores average over the last three years viz, 2012- 13, 2013-14 and 2014-15. A certificate to this effect from Charted Accountant in original must be submitted.Bidder should have a positive net worth during the last three financial years (2012-13, 2013-14 and 2014-15).Certificate of incorporation issued by the Registrar of companies along with Memorandum of Articles of Association Copy of duly certified statement from appointed statutory auditorDetails are to be submitted in the in Tech Bid: format given Financial Details of Bidder and Copies of Income Tax returns for last three years (2012-13, the 2013-14 and 2014-15).45An undertaking (self-certificate) that the agency hasn’t been blacklisted by a central / state Government institution and there has been no litigation with any government department on account of IT services. An undertaking (self-certificate) that the agency has resources having domain knowledge in Web Development Governance applications. Agency need to have a documentary proof of Guidelines for Indian Government Websites (GIGW) Compliance expertise.Details are to be submitted in the in Tech Bid: format given Declaration that the bidder has not been blacklisted", "chunk_id": 31}, {"chunk": "Certificate from any of Government body as a proof.---the---10 -6The bidder should have completed at-least 5 orders for website development during the past three years i.e. 2012 – 2015 with requisite manpower for a similar scope of work.Copies of purchase orders in last three financial years i.e. 2012-13, 2013-14 and 2014-15 and linked satisfactory completion certificates may be submitted as supporting documents.7The Agencies shall furnish, Earnest Money Deposit (EMD) in the form of Bank Guarantee from any of the public sector banks or a private sector bank authorized to conduct government business as per format. EMD is to remain valid for a period of forty- five days beyond the date of opening of the tender.Details are to be submitted with the covering letter.8The Agency should hold a valid CMMi Level 3 certificate or above certification.", "chunk_id": 32}, {"chunk": "Copy of Valid Certification.---3.2 Competencies:---a. Past experience in creating and maintaining very professionally and exceptionally creative websites. b. Excellent I.T. skills and project management skills c. Strong editorial team with communications skills to write clearly and compellingly in Hindi. d. Ability to juggle priorities and deadlines and perform well under pressure; e. Ability to respond quickly to the maintenance requirement in the post commissioning phase. f. Awareness on the latest smart technologies for website development. g. Ability to regularly maintain, update the developed website.", "chunk_id": 33}, {"chunk": "3.3 Essential knowledge and experience:---a. Good information technology skills, with previous experience of website maintenance, management, editing, and/or development. b. Expertise with HTML and content-management systems and latest trends and technology in website content and social media. c. Strong analytical and research skills, including the ability to analyze audiences, attitudes, communications products and messages and to translate them into the design and implementation of effective websites. d. Knowledge of the mandate and work of a government department website would be desirable.11 -", "chunk_id": 34}, {"chunk": "4. Proposal:---Interested Agencies are invited to submit their proposals for the assignment, which must include the following, as detailed subsequently in this document:(i) (ii)Technical Proposal and Financial Proposal---The original proposal (Technical Proposal and Financial Proposal) shall be prepared in indelible ink. It shall contain no interlineations or overwriting, except as necessary to correct errors made by the firm itself. Any such corrections must be authenticated by the persons or person who sign(s) the proposals.", "chunk_id": 35}, {"chunk": "4.1 Technical proposal---The Agencies are expected to provide the Technical Proposal as specified in the RFP Document. Material deficiencies in providing the information requested for may result in rejection of a proposal. The Technical Proposal shall contain the following documents:Sl. No.---", "chunk_id": 36}, {"chunk": "Description---Document / Proof---12Details of agency mentioning the name, address, Email and mobile phone number of the bidder/authorized representative.Proof of registration with department and carry a valid PAN/TAN.the Service Tax---Details are to be submitted in the format given in Tech Bid: Details of the Bidder Organization - Copy of Service Tax Registration - Copy of PAN Card - Copy of TAN Card3The agency should produce Articles of Association laws and (in case of registered firms), Bye certificates for registration issued by the Registrar of Companies.Certificate of incorporation issued by the Registrar of companies along with Memorandum of Articles of Association (Please upload only portions)", "chunk_id": 37}, {"chunk": "relevant---45The Agency should hold a valid CMMi Level 3 certificate or above. Proof of agency’s turnover during the last three years viz, 2012-13, 2013-14 and 2014-15.Copy of valid CMMi certification---A certificate to this effect from Charted Accountant in original must be submitted. And Copies of Income Tax returns for the last three years (2012-13, 2013-14 and 2014-15).6An undertaking (self-certificate) that the agency hasn’t been blacklisted by a central / state Government institution and there has been noDeclaration that the bidder has not been blacklisted12 -", "chunk_id": 38}, {"chunk": "litigation with any government department on account of IT services.---7Certificate from any of the Government body that the agency has resources having domain in Web Development Governance knowledge applications. Agency need to have a documentary proof of Guidelines Indian Government for Websites (GIGW) Compliance expertise.", "chunk_id": 39}, {"chunk": "from any of Certificate Government body as a proof.---the---89The bidder should have completed at-least 5 orders for website development during the past three years i.e. 2012 – 2015 with requisite manpower for a similar scope of work.Earnest Money Deposit (EMD) for amount of Rs. 25,000 (twenty five thousand) along with Technical Bid.Copies of purchase orders in last three financial years i.e. 2012-13, 2013-14 and 2014-15 and linked completion satisfactory certificates may be submitted as supporting documents. The EMD may be submitted in the form of Bank Guarantee from any of the public sector banks or a private sector bank authorized to conduct government business as per format. EMD is to remain valid for a period of forty-five days beyond the date of opening of the tender.(i) Letter of Technical Proposal Submission. (ii) Profile and Track Record of the Agency. (iii) Case studies of large brands handled, with focus on results achieved through web designing and development. (iv) Detail of award winning web designing and building assignment (s) handled, if any. (v) Defined deliverables have to be mentioned in the technical proposal with", "chunk_id": 40}, {"chunk": "timelines.---(vi) Detail of the team proposed to be deployed to work with the MINISTRY, with qualifications and experience of the team members must be provided. (vii) An undertaking on the letterhead of the Agency and signed by an authorized signatory, that the Agency will undertake the assignment, in accordance with the Scope of Work detailed in the RFP document and at the cost submitted by the Agency in the financial proposal (the cost is not to be indicated in the undertaking). The above undertaking submitted by the agencies would be binding on the Agency.The Technical Proposal shall not include any financial information.13 -", "chunk_id": 41}, {"chunk": "4.2 Financial Proposal---4.2.1 In preparing the Financial Proposal, Agencies are expected to take into account the requirements and conditions outlined in the RFP document.4.2.2. Letter of Financial Proposal should include:(i) Total fee, from the date of issue of work order. For Financial Evaluation, the total This Fee should all include fee for the assignment will be considered. costs/expenses of the Agency for undertaking work as detailed in the Scope of Work.(ii) Break-up of costs for each of the items of work listed in the Scope of Work areto be submitted on a separate sheet of paper.It is to be noted thata) Taxes / VAT as applicable in India will be paid as per actual and the same are notrequired to be indicated in the financial bid.b) The cost quoted will be firm and fixed for the duration of performance of the contract. Atno point of time will any deviation from the quoted rate be entertained by Ministry.c) The Financial Bid shall not include any conditions attached to it and any suchconditional financial proposal shall be rejected summarily.d) All prices should be quoted in Indian Rupees and indicated both in figures and words.Figures in words will prevail.14 -", "chunk_id": 42}, {"chunk": "5. SUBMISSION OF BIDS IN RESPONSE TO THE RFP---The bids shall be submitted online only at Central Public Procurement PortalWebsite: http://eprocure.gov.in/eprocure/app---Manual Bids will not be accepted. indicated in the Tender Document.  enter details of the instrument.  Bidder should prepare the EMD as per the instructions specified in the tender document. The original should be posted/couriered/given in person to the Tender Processing Section, latest by the last date of bid submission or as specified in the tender documents. The details of the EMD, physically sent, should tally with the details available in the scanned copy and the data entered during bid submission time. Otherwise the uploaded bid will be rejected. The EMD will be addressed to :The Bidder has to digitally sign and upload the required Bid Documents one by one asBidder has to select the payment option as “offline” to pay the EMD as applicable and“Joint Secretary (OIA-II),Room No. 906, 9th Floor Akbar Bhawan, Chanakyapuri, Ministry of External Affairs New Delhi-110021” CRITERIA WOULD BE OPENED.", "chunk_id": 43}, {"chunk": "FINANCIAL BIDS OF ONLY THOSE BIDDERS WHO MEET THE TECHNICAL--- the format provided and no other format is acceptable.Bidders are requested to note that they should necessarily submit their financial bids inThe Proposal should be submitted on or before 1500hrs of ______ 2016. proposal being received after the closing time for submission of proposals.No Proposal will be accepted after the deadline for submission and in the event of any6. Pre-bid meeting : Authorised Representative with authority letter on the letter head of bidding company duly signed by the bidder only will be allowed to attend the meeting of the pre- bid meeting to be held on _______ at 1600 hrs, in conference hall, 9th Floor, Akbar Bhavan, Chanakyapuri, New Delhi-110021 for clarification of RFP.", "chunk_id": 44}, {"chunk": "7. Opening of bid---The proposals shall be opened at Ministry premises in the presence of bidder or their authorized representatives who choose to attend the opening of bids. Authorised Representative with authority letter on the letter head of bidding company duly signed by the bidder only will be allowed to attend the meeting of the Tender Committee to be held on ______ at 1530 hrs, in conference hall, 9th Floor, Akbar Bhawan, Chanakyapuri, New Delhi-110021 for opening of bids.Ministry also reserves the rights to call for additional information from the bidders.15 -", "chunk_id": 45}, {"chunk": "8. Selection Process---8.1 The Technical Proposals will, in the first instance, be examined in the Ministry to ascertain fulfilment of eligibility criteria and submission of required documents.8.2 Presentation: Agencies which fulfil the eligibility criteria and have submitted all required documents in their Technical Proposal will be invited to make presentations on their Technical Proposal at a date/time to be specified and conveyed by Ministry. The presentation would be made by team members identified to work with Ministry.8.3 Earnest Money Deposit: Vendor are required to submit Earnest Money Deposit (EMD) for amount of Rs. 25,000 (twenty five thousand) along with Technical Bid. The EMD may be submitted in the form of Bank Guarantee from any of the public sector banks or a private sector bank authorized to conduct government business as per format. EMD is to remain valid for a period of forty-five days beyond the date of opening of the tender. No interest will be payable to the Bidder on the amount of the EMD. Bids without Earnest Money would be rejected and no further correspondence shall be entertained in this regard. Unsuccessful Bidder’s EMD will be discharged/ returned as promptly as possible.8.4 In the Second Stage, the finance/budget proposal of organizations will be compared amongst the technically qualified bidders.8.5 The contract will be awarded to the organization on the basis of proposal, budget and PowerPoint presentation.8.6 Successful Bidder will be informed of the decision and he/she will be required to sign an agreement with the Ministry and provide bank guarantee equivalent to 30% of the contract value within 5 working days from the date of agreement and valid for 15 days beyond the warranty obligations.8.7 Performance Security Deposit:- Performance security is to be deposited by every successful bidder irrespective of its registration status etc. Performance Security should be for an amount of 10% of the value of the contract. It may be furnished in the form of an Account Payee Demand Draft, Fixed Deposit Reciept from a commercial bank, Bank Guarantee from a commercial bank. Performance security should remain valid for a period of sixty days beyond the date of completion of all contractual obligations of the supplier including warranty obligations. Bid Security should be refunded to the successful bidder on receipt of performance security.16 -", "chunk_id": 46}, {"chunk": "9. Payment conditions---a. Pre-receipted bills shall be submitted in triplicate in the name of User, A/cMINISTRY.b. Payment will be made in Indian Rupees. c. sum of the Rs.____________/- (Rupees __________________ only) for the web design in the manner stated below on the basis of the formula 30% on signing of the contract, 40% on the approval of the website layout and CMS design and 30% on submission of the final deliverables. The applicable Service Tax on the whole sum shall be payable along with the third instalment of 30% by Ministry.", "chunk_id": 47}, {"chunk": "The Ministry---shall paysuccessful---vendor---a---d.---(Rupees ______________________only) being the 30% of the total cost, on signing of the contract and submission of Bank Guarantee/Demand Draft/Fixed Deposit Receipt(FDR) for an equivalent amount in favour of Ministry.A---sum---not---exceeding Rs.________/-e. The applicable Service Tax on the whole sum shall be payable along with the", "chunk_id": 48}, {"chunk": "third instalment of 30%.---f. Full and final payment would be processed against f o l l o w i n g d o c u m e n t( i) Proof of satisfactory completion of work, by Project head of MINISTRY(ii) Submission of Security Audit Clearance Certificate from CERT-In empanelled agencies and (iii) Guidelines for Indian Government Websites (GIGW) compliance certificate by STQC as determined by MINISTRY.g. Payments shall be subject to deductions of any amount for which the Vendor is liable as per the penalty clause of this tender document. Further, all payments shall be made subjects to deduction of TDS (Tax deduction at Source ) as per the income- Tax Act,1961 and any other taxes as may be applicable.", "chunk_id": 49}, {"chunk": "9.2 General Terms and Conditions---(i)Getting the Security Audit by CERT-IN empanelled agency and obtaining all necessary ‘Guidelines for Indian certificates and to ensure that websites comply with the Government Websites the full}, will be in responsibility of the service provider including the cost involved.", "chunk_id": 50}, {"chunk": "(GIGW)’ {http://guidelines.gov.in/---(ii)---Identify and execute training requirements along with preparation of User Manual will be the responsibility of the service provider including the cost involved.(iii) Mere submission of RFP, shall not confer any right whatsoever on the submitting entity.17 -(iv) The RFP shall remain valid for a period of 6 months from the date of publication of RFP.(v)It shall be obligatory on part of the submitting entity to furnish any further information as may be sought by Ministry.(vi) Every page of RFP must be self attested by bidder.(vii) Neither the issue of this invitation for RFP nor any part of its contents is to be taken as any form of commitment or acknowledgement on part of Ministry to proceed with any RFP or any entity and Ministry reserves the rights to annul or terminate the process or reject any RFP at anytime or stage without assigning any reason.(viii) EMD of Rs. 25000/- to be submitted alongwith RFP Technical Evaluation as per para 8.3.", "chunk_id": 51}, {"chunk": "(ix)---Incomplete proposals are liable to be rejected.(x)If the service provider does not deliver the work to the satisfaction of the Customer within the stipulated time (as per para 03 ) a penalty of Rs. 5,000/- per calendar week shall be imposed on the service provider . An additional penalty of Rs. 1000/- per calendar day shall be imposed on the service provider if the work is not completed in additional period of two weeks i.e. by after applying penalty of Rs. 5,000/- per week.", "chunk_id": 52}, {"chunk": "(xi)---This RFP is not an agreement and is neither an offer nor invitation by MINISTRY to the prospective Bidders or any other person. The purpose of this RFP is to provide interested parties with information that may be useful to them in preparing their proposal pursuant to this RFP (the \"Bid\"). This RFP includes statements, which reflect various assumptions and assessments arrived at by MINISTRY in relation to the Project. Such assumptions, assessments and statements do not purport to contain all the information that each Bidder may require. This RFP may not be appropriate for all persons, and it is not possible for MINISTRY, its employees to consider the investment objectives, financial situation and particular needs of each party who reads or uses this RFP. The assumptions, assessments, statements and information contained in this RFP may not be complete, accurate, adequate or correct. Each Bidder should, therefore, conduct its own investigations and analysis and should check the accuracy, adequacy, correctness, reliability and completeness of the assumptions, assessments, statements and information contained in this RFP and obtain independent advice from appropriate sources.(xii) MINISTRY may in its absolute discretion, but without being under any obligation to do so, update, amend or supplement the information, assessment or assumptions contained in this RFP.(xiii) The issue of this RFP does not imply that MINISTRY is bound to select a Bidder or to appoint the Selected Bidder, as the case may be, for the Project and MINISTRY reserves the right to reject all or any of the Bidders or Bids without assigning any reason whatsoever.18 -(xiv) Further, all information/data/reports/pitches/data or other material submitted to MINISTRY under this Tender/RFP/RFQ by the Applicant shall become the property of MINISTRY. The Applicant hereby agrees that they shall not have any right claim, authority whatsoever over the submitted information/reports/pitches/data or other material to MINISTRY. The Applicant further agrees and undertakes that MINISTRY may use the aforesaid information/data/reports/pitches/data or other material at its sole discretion and the Applicant shall not have any objection whatsoever in MINISTRY using the same.(xv) The firm shall be a legal entity as per the GOI rules/regulations and laws of the land.(xvi) The firm must have service tax registration, PAN, TIN, Service Tax reg. No. and should be", "chunk_id": 53}, {"chunk": "income tax assesse.---(xvii) The firm should not have been blacklisted by any Government organization.(xviii) The Ministry, MEA shall not be liable for any cost incurred by the respondents in preparing responses to this tender or negotiations associated with award of a contract.(xix) Force Majeure-If, at any time, during the continuance of this contract, the performance in whole or in part by either party of any obligation under this contract in prevented or delayed by reasons of any war or hostility, act of the public enemy, civil commotion, sabotage, fires, floods, explosions, epidemics, quarantine restrictions, strikes, lock outs or act of God (hereinafter referred to as events) provided notice of happenings of any such eventuality is given by either party to the other within 21 days from the date of occurrence thereof, neither party shall due to such event be entitled to terminate this contract nor shall either party have any claim for damage against other in respect of such non- performance or delay in performance, and deliveries under the contract shall be resumed as soon as practicable after such event come to an end or cease to exist, and the decision of the purchaser as to whether the deliveries have been so resumed or not shall be final and conclusive. Further that if the performance in whole or part any obligation under this contract is prevented otr delayed by reasons of any such event for a period of exceeding 60 days, party may, at its option, terminate the contract.(xx) Settlement of Disputes and Arbitration- All disputes, differences and questions arising out of or in any way touching or concerning this agreement or subject matter thereof or the representative rights, duties or liability of the parties shall be referred to the sole arbitration of the Foreign Secretary or any person nominated by him/her. The arbitration shall be in accordance with the Arbitration and Conciliation Act, 1996 or any other law that takes place in this regard. The arbitrator shall be in entitled to extend the time of arbitration proceedings with the consent of the parties. In addition to above :(a) No part of the agreement shall be suspended on the ground of pending arbitration proceedings. (b) The decision of the sole arbitrator shall be final and binding on the parties.19 -(c) Governing laws and disputes- This shall be construed and governed by the Laws of India and the parties hereby submit to the exclusive jurisdiction of the Delhi Courts of Law.20 -", "chunk_id": 54}, {"chunk": "Government of India Ministry of External Affairs (Overseas Indian Affairs Division-II)---Akbar Bhavan, Chanakyapuri, New Delhi---Important Dates---In respect of the RFP for Design, Development and Maintenance of website – KIPPortal---Tender Reference No.---OI-16016/03/2016-OIA-IIName of Organization---MINISTRY OF EXTERNAL AFFAIRS---Date of Publishing Bid Document download start date Clarification start date Clarification end date Pre-bid Meeting Bid Submission start date Bid Submission end date Date of opening of technical bid Declaration of successful bidder (technically) Date of opening of financial bidDate 26.04.2016 26.04.2016 27.04.2016 29.04.2016 10.05.2016 17.05.2016 18.05.2016 19.05.2016 24.04.201626.04.2016Time (1500 hrs) (1600 hrs) (1600 hrs) (1400 hrs) (1600 hrs) (1600 hrs) (1500 hrs) (1530 hrs) (1500 hrs)(1500 hrs)The bids shall be submitted online only at Central Public Procurement Portal Website: http://eprocure.gov.in/eprocure/appManual Bids will not be accepted.21 -", "chunk_id": 55}, {"chunk": "Annexure I---AUTHORIZATION LETTER---To---Joint Secretary (OIA-II) Ministry of External Affairs Room N0. 906 , 9th Floor Akbar Bhavan, Chanakyapuri, New Delhi-110021Subject: Proposal for Design, Development and Maintenance of New Website---for – KIP---Sir,We, the undersigned vendor, having read and examined in detail theSpecifications and all the bidding documents do propose to provide the Services as specified in the bidding document no. .......................2. All the prices mentioned in our proposal are in accordance with the terms as specified in bidding documents.3. All the prices and other terms and conditions of this proposal are valid for a period of 120- calendar days from the date of opening of the Bids.4. We, do hereby confirm that our Bid prices include all taxes, levies etc.5. We have carefully read and understood the terms and conditions of the contract applicable to the tender and we do hereby undertake Services as per these terms and conditions.6. We declare that our prices are as per the technical specifications and bid documents. These prices are indicated in Annexure(s) attached with our proposal as part of the commercial bid.7. We do hereby undertake that, in the event of acceptance of our bid, the Services shall be completed as stipulated in the tender document.22 -8. We enclose herewith the complete Technical Bid as required by Ministry of External affairs. This includes:      Authorization Letter (Annexure I) Vendor Information (Annexure II) Vendor’s –Detailed Experience (Annexure III-A) Past Experience Summary – (Annexure III-B) Technical bid (Annexure IV) Financial bid(Annexure V) EMD (Annexure VI) Sample Website & technical document to be submitted at the time of tenderCertified that we are:A sole proprietorship firm and the person signing the tender is the sole proprietor/constituted attorney of the sole proprietor, Or A partnership firm, and the person signing the tender is a partner of the firm and he has authority to refer to arbitration disputes concerning the business of the partnership by virtue of the partnership agreement by virtue of general power of attorney. OrA Company and the person signing the tender is the constituted attorney.(NOTE: Delete whatever is not applicable. All corrections /deletions should invariably be duly attested by the person authorized to sign between us.)10. We do hereby undertake, that until a contract is prepared and executed, this bid together with Ministry’s written acceptance thereof, the tender document and placement of letter of intent awarding the contract, shall constitute a binding contract between us. Signature of vendor representative", "chunk_id": 56}, {"chunk": "Date:---Name of Vendor:---Full Address: Detail of enclosures:---Telephone No.:---23Annexure II---VENDOR PARTICULARS---S. No. 1---Item---Company Name---23Year Established (Copy of Incorporation Corporate & Head Office:---Reg. Certificate attach---Address---Telephone: Fax No. : website Email Address: Mobile No.45Delhi Office: Contact Address---Contact Person---Address Telephone: Fax No. : Email Address: Name Designation Mobile: Email Address:6", "chunk_id": 57}, {"chunk": "Service Tax , VAT TIN and PAN details :---Service Tax No: (Attach self attested copy of Service Tax Registration Certificate )VAT TIN No. :……………. (Attach self attested copy of VAT/Sales Tax certificate )PAN No. ………… (Attach self attested copy of PAN Card )---7", "chunk_id": 58}, {"chunk": "Financial Turnover Information---Year 2012-13 2013-14Amount in Core Rs---2014-15(Copy of Turnover Certificate for the financial years 2012-13, 2013-14 and 2014-2015 duly certified by Chatered Accountant Attached as24Annexure III-A:---VENDOR’S EXPERIENCE---S.No---Item---Details---1. Name of the project---(Also specify the name of website/portal/web application AND URL of the website/portal/Web application)", "chunk_id": 59}, {"chunk": "2. Client Details---3. Name, Title & Address of the Client who can---be contacted4. Project Duration 5. Start Date & End Date6. Scope of work---7. Relevant work domain---8. Software Tools & Technology used---9. Total Efforts in Man months---10. Contract Value (In Lakhs)---** Attach LOI/Work Order/ Contract copy (Mandatory) Letter from the Client for satisfactory completion of the project / Appreciation letter from Client / CERT-in Certificate/ STQC Certification would be given additional weight age25", "chunk_id": 60}, {"chunk": "Annexure III B:---Experience Summary---SL---Project Name---Client Name---Start & End Date---Activities Relevant to scopeContract Value (INR)---Efforts in Man Months---1. 2. 3. 4. 5. 6. 7. 8. 9. 10. 11.26Annexure-IV---Technical bid---Sl. No.---Description for Document / Proof to be submitted with Tech bidType---(i)Letter of Technical Proposal Submission.---", "chunk_id": 61}, {"chunk": ".pdf---(ii)---Details of agency as per given format.pdf---a) Profile and Track Record of the Agency. b) Case studies of large brands handled, with focus on.pdf---results achieved through web designing and development.c) Detail of award winning web designing and buildingassignment (s) handled, if any.", "chunk_id": 62}, {"chunk": "(iii)---(iv)---Proof of registration with the Service Tax department and carry a valid PAN/TAN. Certificate of incorporation issued by the Registrar of companies along with Memorandum of Articles of Association.pdf---.pdf---(v)Copy of valid CMMi Level 3 certificate and above certification---.pdf---Proof of agency’s turnover during the last three years viz, 2012- 13, 2013-14 and 2014-15", "chunk_id": 63}, {"chunk": ".pdf---(vi)---A certificate to this effect from Charted Accountant in original must be submitted.Copies of Income Tax return for last three years---.pdf---(vii)---(viii)---An undertaking (self-certificate) that the agency hasn’t been blacklisted by a central / state Government institution and there has been no litigation with any government department on account of IT services. Certificate from any of the Government body that the agency has resources having domain knowledge in Web Development Governance applications. Agency need to have a documentary proof of Guidelines for Indian Government Websites (GIGW) Compliance expertise.", "chunk_id": 64}, {"chunk": ".pdf---.pdf---(ix)---Copies of purchase orders in last three financial years i.e. 2012- 13, 2013-14 and 2014-15 and linked satisfactory completion certificates may be submitted as supporting documents..pdf---(xi)---Defined deliverables with timelines..pdf---27(xii)---Detail of the team proposed to be deployed to work with the MINISTRY, with qualifications and experience of the team members must be provided", "chunk_id": 65}, {"chunk": ".pdf---(xiii)---An undertaking on the letterhead of the Agency and signed by an authorized signatory, that the Agency will undertake the assignment, in accordance with the Scope of Work detailed in the RFP document and at the cost submitted by the Agency in the financial proposal (the cost is not to be indicated in the undertaking). The above undertaking submitted by the agencies would be binding on the Agency.", "chunk_id": 66}, {"chunk": ".pdf---.pdf---(xiv)---Details of the team dedicated to the MINISTRY project should be provided.Earnest Money Deposit (EMD) for amount of Rs. 25,000 (twenty five thousand) along with Technical Bid..pdf---(xv)---The EMD may be submitted in the form of Bank Guarantee from any of the public sector banks or a private sector bank authorized to conduct government business as per format. EMD is to remain valid for a period of forty-five days beyond the date of opening of the tender.28", "chunk_id": 67}, {"chunk": "Annexure -V---Financial Bid Format---Prices in Financial Bid should be quoted in the following format.Sl. No.---Document---(i)Letter of financial bid Submission---(ii)---Total fee, include all costs/expenses of the Agency for undertaking work as detailed in the Scope of Work.(ii) Break-up of costs for each of the items of work listed in the Scope of Work are to be submitted on a separate sheet of paper.", "chunk_id": 68}, {"chunk": "No.---Service Categories as given in scope of workFigures---Cost in Rs. word---12Design, Development and Maintenance of New Website for KIP (Including one year Free Support period) Maintenance charge for 3 years maintenance (including the cost of Project Manager and technical manpower etc) after expiry of free support period (Annual Charges x 3)Note: Bidders are requested to note the following:a) Taxes / VAT as applicable in India will be paid as per actual and the same arenot required to be indicated in the financial bid.b) TDS will be deducted as per rules applicable.c) The cost quoted will be firm and fixed for the duration of performance of the contract. At no point of time will any deviation from the quoted rate be entertained by Ministry.d) The Financial Bid shall not include any conditions attached to it andany such conditional financial proposal shall be rejected summarily.e) All prices should be quoted in Indian Rupees and indicated both in figures andwords. Figures in words will prevail.", "chunk_id": 69}, {"chunk": "Date Place---Signature of Authorised Signatory … Name of the Authorised Signatory … Designation … Name of the Organisation … Seal …29Annexure – VI---EMD / PERFORMACE SECURITY FORM---(Sample Format - TO BE EXECUTED ON A NON-JUDICIAL STAMPED PAPER)---To: MINISTRY OF EXTERNAL AFFAIRS---WHEREAS …………………………………………………….. (Name of Vendor) (hereinafter called the ‘the Vendor”) has undertaken, in pursuance of Request for Proposal (RFP) No. D-16016/3/2016-OIA-II dated............…., 2016 for the “for Design, Development and Maintenance of New Website for KIP . (herein after called the ‘the RFP”).AND WHEREAS, it has been stipulated by Ministry of External Affairs in the said RFP that the Vendor shall furnish Ministry of External Affairs with a Bank Guarantee from a commercial Bank for the sum specified therein, as security for compliance with the Vendor’s performance obligations in accordance with the RFP.AND WHEREAS we ----------------Bank having its registered office at ----- and inter alia a branch office situate at ------- have agreed to give a performance guarantee in lieu of EMD of Rs. --------- (Rs. ------------------ only ) on behalf of the Vendor . We . Bank further undertake not to revoke and make ineffective the guarantee during it’s currency except with the previous consent of the buyer in writing.We ------.............. Bank do hereby unconditionally and irrevocably undertake to pay to Ministry without any demur or protest, merely on demand from Ministry, an amount not exceeding Rs. ---------- (--------- only) by reason of any breach of the terms of the RFP dated ---- ----------by vendor. We hereby agree that the decision of the MINISTRY regarding breach of the terms of the RFP shall be final, conclusive and binding WE do hereby guarantee and undertake to pay forthwith on demand to MINISTRY a sum not exceeding Rs.……………/-. (Rupees ………………………….. …only) (amount of the Guarantee in words and figures) and we undertake to pay Ministry of External Affairs upon Ministry first written demand declaring the Vendor to be in default under the RFP and without cavil or argument, any sum or sums within the limit of Rs.……………/-. (Rupees …………………………..… only) (Amount of guarantee) as aforesaid, without Ministry’s needing to prove or to show grounds or reasons for Ministry of External affairs demand or the sum specified therein.30Our obligation to make payment under this Guarantee shall be a primary, independent and absolute obligation and we shall not be entitled to delay or withhold payment for any reason. Our obligations hereunder shall not be affected by any act, omission, matter or thing which but for this provision might operate to release or otherwise exonerate us from our obligations hereunder in whole or in part, including and whether or not known to us or Ministry of External Affairs: (i) (ii)any time or waiver granted to the vendor; the taking, variation, compromise, renewal or release of or refusal or neglect to perfect or enforce any rights, remedies or securities against the vendor; (iii) any Variation of or amendment to the RFP or any other document or security so that references to the Contract in this Guarantee shall include each such Variation and amendment;(iv) any unenforceability, invalidity or frustration of any obligation of the VENDOR or any other person under the RFP or any other document or security waiver by Ministry of External affairs of any of the terms provisions conditions obligations UNDER RFP or any failure to make demand upon or take action against the VENDOR; any other fact, circumstance, provision of statute or rule of law which might, were our liability to be secondary rather than primary, entitle us to be released in whole or in part from our undertaking; and;(v)(vi) any change in constitution of the vendor; (vii) any petition for the winding up of the VENDOR has been admitted and a liquidator or provisional liquidator has been appointed or an order of bankruptcy or an order for the winding up or dissolution of the vendor has been made by a Court of competent jurisdiction;This guarantee is valid until the ……….. day of <validity date> and a claim in writing is required to be presented to us within one months from <validity date> i.e. on or before <claim period> failing which all Ministry of External affairs rights will be forfeited and we shall be relieved of and discharged from all our liabilities mentioned hereinabove. Signature and Seal of Guarantors (Vendor’s Bank) ………………………………………………………….. Date……………………………………………………. Address ………………………………………………… ……………………………………………………………*********31", "chunk_id": 70}, {"chunk": "Annexure -VII---Instructions for Online Bid Submission:---The bidders are required to submit soft copies of their bids electronically on the CPP Portal, using valid Digital Signature Certificates. The instructions given below are meant to assist the bidders in registering on the CPP Portal, prepare their bids in accordance with the requirements and submitting their bids online on the CPP Portal.More information useful for submitting online bids on the CPP Portal may be obtained at: https://eprocure.gov.in/eprocure/app .", "chunk_id": 71}, {"chunk": "REGISTRATION---1) Bidders are required to enroll on the e-Procurement module of the Central Public Procurement Portal (URL: https://eprocure.gov.in/eprocure/app) by clicking on the link “Online bidder Enrollment” on the CPP Portal which is free of charge.2) As part of the enrolment process, the bidders will be required to choose a unique usernameand assign a password for their accounts.3) Bidders are advised to register their valid email address and mobile numbers as part of the registration process. These would be used for any communication from the CPP Portal.4) Upon enrolment, the bidders will be required to register their valid Digital Signature Certificate (Class II or Class III Certificates with signing key usage) issued by any Certifying Authority recognized by CCA India (e.g. Sify / TCS / nCode / eMudhra etc.), with their profile.5) Only one valid DSC should be registered by a bidder. Please note that the bidders are responsible to ensure that they do not lend their DSC’s to others which may lead to misuse.6) Bidder then logs in to the site through the secured log-in by entering their user ID /", "chunk_id": 72}, {"chunk": "password and the password of the DSC / e-Token.---SEARCHING FOR TENDER DOCUMENTS---1) There are various search options built in the CPP Portal, to facilitate bidders to search active tenders by several parameters. These parameters could include Tender ID, Organization Name, Location, Date, Value, etc. There is also an option of advanced search for tenders, wherein the bidders may combine a number of search parameters such as Organization Name, Form of Contract, Location, Date, Other keywords etc. to search for a tender published on the CPP Portal.2) Once the bidders have selected the tenders they are interested in, they may download the required documents / tender schedules. These tenders can be moved to the respective ‘My Tenders’ folder. This would enable the CPP Portal to intimate the bidders through SMS / e- mail in case there is any corrigendum issued to the tender document.3) The bidder should make a note of the unique Tender ID assigned to each tender, in casethey want to obtain any clarification / help from the Helpdesk.32", "chunk_id": 73}, {"chunk": "PREPARATION OF BIDS---1) Bidder should take into account any corrigendum published on the tender documentbefore submitting their bids.2) Please go through the tender advertisement and the tender document carefully to understand the documents required to be submitted as part of the bid. Please note the number of covers in which the bid documents have to be submitted, the number of documents - including the names and content of each of the document that need to be submitted. Any deviations from these may lead to rejection of the bid.3) Bidder, in advance, should get ready the bid documents to be submitted as indicated in the tender document / schedule and generally, they can be in PDF / XLS / RAR / DWF/JPG formats. Bid documents may be scanned with 100 dpi with black and white option which helps in reducing size of the scanned document.4) To avoid the time and effort required in uploading the same set of standard documents which are required to be submitted as a part of every bid, a provision of uploading such standard documents (e.g. PAN card copy, annual reports, auditor certificates etc.) has been provided to the bidders. Bidders can use “My Space” or ‘’Other Important Documents’’ area available to them to upload such documents. These documents may be directly submitted from the “My Space” area while submitting a bid, and need not be uploaded again and again. This will lead to a reduction in the time required for bid submission process.", "chunk_id": 74}, {"chunk": "SUBMISSION OF BIDS---1) Bidder should log into the site well in advance for bid submission so that they can upload the bid in time i.e. on or before the bid submission time. Bidder will be responsible for any delay due to other issues.2) The bidder has to digitally sign and upload the required bid documents one by one asindicated in the tender document.3) Bidder has to select the payment option as “offline” to pay the tender fee / EMD as", "chunk_id": 75}, {"chunk": "applicable and enter details of the instrument.---4) Bidder should prepare the EMD as per the instructions specified in the tender document. The original should be posted/couriered/given in person to the concerned official, latest by the last date of bid submission or as specified in the tender documents. The details of the DD/any other accepted instrument, physically sent, should tally with the details available in the scanned copy and the data entered during bid submission time. Otherwise the uploaded bid will be rejected.5) Bidders are requested to note that they should necessarily submit their financial bids in the format provided and no other format is acceptable. If the price bid has been given as a standard BoQ format with the tender document, then the same is to be downloaded and to be filled by all the bidders. Bidders are required to download the BoQ file, open it and complete the white coloured (unprotected) cells with their respective financial quotes and other details (such as name of the bidder). No other cells should be changed. Once the details have been completed, the bidder should save it and submit it online, without changing the filename. If the BoQ file is found to be modified by the bidder, the bid will be rejected.336) The server time (which is displayed on the bidders’ dashboard) will be considered as the standard time for referencing the deadlines for submission of the bids by the bidders, opening of bids etc. The bidders should follow this time during bid submission.7) All the documents being submitted by the bidders would be encrypted using PKI encryption techniques to ensure the secrecy of the data. The data entered cannot be viewed by unauthorized persons until the time of bid opening. The confidentiality of the bids is maintained using the secured Socket Layer 128 bit encryption technology. Data storage encryption of sensitive fields is done. Any bid document that is uploaded to the server is subjected to symmetric encryption using a system generated symmetric key. Further this key is subjected to asymmetric encryption using buyers/bid openers public keys. Overall, the uploaded tender documents become readable only after the tender opening by the authorized bid openers.8) The uploaded tender documents become readable only after the tender opening by theauthorized bid openers.9) Upon the successful and timely submission of bids (i.e. after Clicking “Freeze Bid Submission” in the portal), the portal will give a successful bid submission message & a bid summary will be displayed with the bid no. and the date & time of submission of the bid with all other relevant details.10) The bid summary has to be printed and kept as an acknowledgement of the submission of the bid. This acknowledgement may be used as an entry pass for any bid opening meetings.", "chunk_id": 76}, {"chunk": "ASSISTANCE TO BIDDERS---1) Any queries relating to the tender document and the terms and conditions contained therein should be addressed to the Tender Inviting Authority for a tender or the relevant contact person indicated in the tender.2) Any queries relating to the process of online bid submission or queries relating to CPP Portal in general may be directed to the 24x7 CPP Portal Helpdesk. The contact number for the helpdesk is 1800 3070 2232.****34", "chunk_id": 77}]