[{"chunk": "REQUEST FOR QUOTE (RFQ): No. FDA-22-RFQ-1253666---GENERAL SERVICES ADMINISTRATION (GSA) Schedule---Title: FDA OGPS IT Infrastructure Examination Issuing Office:---Food and Drug Administration; Office of Acquisition & Grant Services (OAGS) 4041 Powder Mill Road Beltsville, MD 20705Contract Specialist: Tiffany Gates - Contracting Specialist /Email: tiffany.gates@fda.hhs.gov---Contracting Officer: Roosevelt Walker, Contract Officer /Email roosevelt.walkerl@fda.hhs.gov---Issue Date: May 24, 2022---Final Date: June 10, 2022---Notice of Request for Quote (RFQ)---This solicitation, identified as FDA-22-RFP-1253666, is issued as a request for proposal (RFP) in accordance with the procedures of Federal Acquisition Regulation (FAR) 8.405-3. The procedures in FAR Subpart 15.3 do not apply to this acquisition. In using FAR 8.405-3 procedures the Government is not obligated to determine a competitive range, conduct discussions with any offeror, or use any other source selection techniques associated with subpart 15.3.This solicitation is a GSA Schedule contract to obtain FDA OGPS IT Infrastructure Examination. The associated NAICS code 541511; Computer Systems Design and Related Services, with a small business size standard of $30 Million.Notice of FAC---This solicitation document and incorporated provisions and clauses are those in effect through Federal Acquisition Circular FAC 2022-04, effective 01 January 2022. FAR and HHSAR provisions and clauses referenced in this RFP can be found on the following website: https://www.acquisition.gov/browse/index/far", "chunk_id": 1, "page_no": 1}, {"chunk": "1. Background---The Office of Global Policy and Strategy (OGPS, the Office) serves as the U.S. Food and Drug Administration’s (FDA’s, the Agency’s) international office. It is led by the Associate Commissioner for Global Policy and Strategy (ACGPS), who provides vision, leadership, and strategy, and is supported by offices at the FDA Headquarters and Foreign Offices, strategically placed around the globe, in Europe (Belgium and Amsterdam), India, China, and Latin America (Mexico, Costa Rica, and Chile).OGPS maintains equipment, systems, and information management requirements at the 7 Foreign Offices for approximately 80 individuals who regularly represent FDA to other governments, national regulatory partners, facilities, and partners within the United States Government. Providing IT and information management support is complex as performing the work of the office requires management of physical assets (laptops, etc.) and digital tools and systems (enterprise- or office-level) for the headquarters location and for the foreign offices. In addition, there are legacy documentation, records, and reference materials from the previous Office of International Programs that exist alongside current materials andsystems. Responsibility for this maintenance lies with the Office of Global Diplomacy and Partnerships (OGDP) Program Support Team (PST). The OGDP PST is also responsible for managing the overall IT portfolio, which includes contracts for information technology systems, project management, systems management, liaising with the Office of Information Management and Technology (OIMT), OC IT Liaison, and International Help Desk.Information technology and management decisions for OGPS must be made with consideration of other stakeholder requirements, those of the FDA Office of Information Management and Technology (OIMT) and in some cases US State Department. OIMT defines FDA-standard computer images, software, and collaboration tools and maintains the FDA Helpdesk function for local and remote personnel. OIMT approves and facilitates software downloads and maintains shared space for applications such as Salesforce. OIMT also maintains a shared/centralized procurement process for some software, license, and hardware purchases across FDA. All IT-related actions taken by OGPS that affect individual or collective settings, software, or access must be in accordance with OIMT standards. OGPS must also stand ready to adapt and adjust to changes to the FDA IT environment initiated under OIMT. In 2020 and 2021, for example, FDA began a migration from SharePoint 2010 to SharePoint online, moved the Agency to Office 365, introduced Microsoft Teams, and retired the familiar communication tool, Skype.OGPS personnel perform work within multiple software systems and applications, and IT security and support requirements differ across the multiple geographic locations. Primary digital tools for collaboration across the Offices include SharePoint Online (following a 2020 migration from SharePoint 2010), Office 365, MS Teams, One Drive, network drives, Zoom, and email. Given legacy file structures and systems and current needs and tools, management, and maintenance of the OGPS IT infrastructure1 require technical and program/project management support.The current OGPS information technology infrastructure and requirements provide the tools the personnel need to perform their work with a combination of hardware, software, and support personnel. However, OGPS recognizes that there are opportunities for refinement and improvement of the current IT infrastructure. In 2020, OGPS leadership approved the following Mission, Vision, and Goals as part of its IT Management Strategic Plan:OGPS IT Mission Statement: “To manage an IT portfolio by providing high quality IT services,unified around central goals that efficiently address OGPS business needs.”OGPS IT Vision Statement: “To provide an OGPS IT portfolio that manages and aligns technologies, improves customer service, safeguards data and information, and continuously enhances the user experience.”To realize this vision and achieve its mission, OGPS IT is pursuing the following goals, with the focus of this acquisition supporting Goals 2, 3, 4 and 5.Goal 1: Optimize IT Workforce – Ensuring that each task spanning across the OGPS IT portfolio has sustained and capable resources with requisite training and development to promote continuity and efficiency of operations.Goal 2: Provide Innovative IT Capabilities – Evaluating the OGPS IT portfolio against agency- selected IT technologies and innovations to ensure early adoption of best practices and better cater to customer needs.Goal 3: Provide Efficient IT Services – Collaborating effectively with various FDA and external stakeholders to provide IT services, capitalize on shared efficiencies, and align with end user needs.1Goal 4: Increase System Usability – Maintaining the functionality and ease of use for systems utilized to execute IT processes and exploring opportunities for automation where applicable; andGoal 5: Align IT Management – Aligning the OGPS IT portfolio along a singular IT strategy and vision at every level of operation and establishing a unified framework for IT decisions to be made in accordance with informed budgetary allocations.Per Goal 5, OGPS is moving to an IT management and acquisition strategy that will combine and integrate services if possible; sunset duplicative or outdated software and systems; identify needs for new solutions; and develop an acquisition and long-term management plan for technology, people, and systems.", "chunk_id": 2, "page_no": 3}, {"chunk": "2. Statement of Work---The infrastructure is defined as applications, software, user processes, and other systems that support information management, transfer, sharing, and storage. Though the final report may include a description of mission-critical hardware, OGPS is not seeking input on selection or modification of hardware (e.g., servers, routers). OGPS must abide by FDA’s IT requirements and, in part, with restrictions imposed by the U.S. Department of State.2.1 Objectives---The objective of this task is to obtain contractor support with the knowledge, skills, and abilities to examine OGPS IT landscape (building on existing documentation from the Knowledge Management (KM) and OGPS IT Management Strategic Plan) and provide recommendations for approaches to increase efficiency and integration of IT applications and functions. The contractor will review IT infrastructure products associated with end-user computing and provide recommendations for remediation, if necessary. This includes, but is not limited to, OGPS systems such as Global Tours Portal (GTP), Customer Relations Management System (CRMS), Assessment and Corrective and Preventive Action portal (ACAPA) and Monitoring and Evaluation portal (M&E).The contractor shall review major infrastructure products associated with service management and provide recommendations for remediation. Includes customer relations management system, asset management, project management. This will include improving use of current technological tools and business processes and recommendations for new approaches. As part of the recommendations for improvement/revision of approach the contractor will identify performance metrics that can be used to measure and determine if the new approaches increase efficiency, efficacy, and accuracy of work performed within the Offices.2.2 Scope The scope of this SOW is to continue the effort to support activities to examine the existing IT infrastructure within OGPS, building on existing documents developed during development of the OGPS knowledge management strategy and IT strategic management plan. The activities include but are not limited to assessing current state of IT infrastructure, developing issues and findings summary, and proposing recommendations for the future state based on the assessment findings. The FDA/OGPS PM will identify critical, high-priority business process to initiate this examination. Program support shall be provided by contractor.2.3 Tasks Areas The Contractor shall provide overall coordination with the OGPS POCs, FDA project manager and Contracting Officer’s Representative (COR), the contractor shall support specific tasks in the following", "chunk_id": 3, "page_no": 4}, {"chunk": "areas:---Task 1: Program Management • Task 2: Conduct current state assessment of OGPS IT infrastructure • Task 3: Develop issues and findings summary • Task 4: Propose future state recommendations and requirements based on the assessment findingsTask 1 – Program Management Support---The contractor shall provide program management support. Tasks will include: • Conduct a kickoff meeting within 15 days of award with contracting officer representative (COR) and other government and contractor personnel as appropriate. Prepare an agenda for the meeting with a draft project plan for the required tasks.Complete activities to update and finalize the project plan. The plan must include a riskmanagement plan with projected impact to the project execution and mitigation strategies.---Following initiation of the project, identify risks to program timeline and deliverables and assisting in their resolution, including assuring that project/application-specific concerns are raised to the program level when appropriate.Submit a bi-weekly status report in a format agreed to the program managers and COR. Thestatus report shall be delivered one business day prior to the status meeting.Schedule and conduct a bi-weekly status meeting with the Program Manager and COR. • Submit a monthly status report in a format agreed to the program managers and COR. The statusreport shall be delivered no later than the 10th of every month.Coordinate and facilitate meetings with OGPS staff and other stakeholders as needed. • Other program management tasks as appropriateTask 2 – Perform Current State Assessment of IT infrastructure Review and analyze related agency and government planning artifacts to provide subject matter expertise on matters relating to efficiency, cost-modeling, and cost-benefit-analyses.The contractor shall perform a comprehensive review and analysis of OGPS’s IT environment. The tasks associated with the assessment include:Through engagement with relevant stakeholders, define OGPS offices and staff technology needs and assess how current gaps can be met with existing or new technology services and solutions.Develop an IT landscape map that includes all OGPS’s current IT infrastructure including thoseexisting within FDA and Department of State IT environments.Conduct an analysis of OGPS technology and services including descriptions of the functions that are working and those that are not. Coordinate with the FDA/OGPS PMs to identify critical, high-priority business process to move ahead with a more detailed assessment.Gather high level requirements and user experiences challenges from OGPS stakeholders and provide recommendations for the best strategy for application and data integration across OGPS offices.Complete an analysis of opportunities to meet desired functions/needs with existing technology and services and identification of redundancies in the system. Where desired functions/needs cannot be met with existing technology and services, identification of options to do so, including timelines and costs for acquisition and on-going O&M. Analysis of risk to the organization andmission if the desired functions/needs are not provided within a given timeframe. Include a cost- benefit analysis component to this assessment to include cost considerations as part of the recommendationsExamine existing IT infrastructure and IT strategic management documents within OGPS, consult with stakeholders and develop an overview of the current architecture and related tools (software and systems) OGPS personnel use to perform their functions. Determine the To Be state for all inventory items based on assessment findings.The analysis should include, but is not limited to, developing an inventory of local network drives, OGPS shared drives (i.e., OIP and OGPS), approved and prohibited applications, and other considerations specific to foreign offices. Vendor would need to coordinate with the OIMT International Helpdesk personnel and any other appropriate OIMT points of contact to understand IT-related constraints that exist at the foreign offices.Determine if any systems are causing major inefficiencies. Inefficiencies can cost money, lessen productivity, and impact business performance (in turn affecting customers and their perception of your organization).Assessment should consider technology drivers, system/technology relationships, current statetechnology end-of-life determination, and promising new technologies.Task 3 – Develop Issues and Findings Summary The contractor shall develop a detailed assessment document that highlights the findings from the assessment completed in task 2 above. Specific areas of focus include insights on the current organization and operational structure, along with recommendations for future mode of operations. The contractor shall also identify issues and gaps found during the assessment. The document shall include: • Overview to describe how personnel use the tools to accomplish critical, high priority tasks asidentified by the project manager.Business processes and technological resources that provide opportunities for improvement in efficiency, efficacy, and accuracy and recommend approaches to the Offices. The Contractor shall explore diverse options including open-source solutions and as necessary, conduct technology alternatives analysis for recommended new technologies including return on investment, risk assessment, and level of effort required to deliver required capabilities.Consideration of current technological tools and business processes and recommendations for new", "chunk_id": 4, "page_no": 5}, {"chunk": "approaches.---• Key areas where current infrastructure demonstrates excellence in service delivery along withIdentify any gaps in function or performance in the AS-IS vs. the TO-BE infrastructureproviding key areas of future opportunity based on the analyzed resultsSignificant issues identified in the findings summary are documented using a Red/Amber/Green (RAG) analysis. The RAG analysis is used to develop a priority of remediation for the TO-BE state. Red (R) = significant issue; Amber (A) = identified issue, not critical but resolution needed; Green (G) = not an issue, acceptable riskTask 4 – Propose Future State Recommendations and Requirements The contractor shall provide a document proposing recommendations for the future state of OGPS IT infrastructure landscape that will:Integrate existing and, if necessary, desired technology and business processes for increasing efficiency, efficacy, and accuracy. Identify equipment, technologies, software, systems, tools and techniques to satisfy requirements and design specifications to include 508 specificationsPropose a technical solution architecture including system architecture, application architecture and system migration strategy for identified applications and services to the target end state in the FDA approved cloud environment or another environment.Propose recommendation of the development tools in FDA approved Cloud platform environment or other platforms based on the industry best practices for the proposed solution architecture.Identify metrics and/or performance indicators to monitor business process efficiency, efficacy,", "chunk_id": 5, "page_no": 6}, {"chunk": "and accuracy.---IT systems roadmap and reference and target architecture summaries • Suggest improvements to business processes, user experiences, and systems related to IT infrastructure and software. Considerations for OIMT processes and standards shall be incorporated in recommendations.Generate system components lists, product cost comparisons for planning and budgeting, technical specifications and technical requirements and tactical level designs that may be used to acquire and/or build systems or components.Implementation recommendations, regarding the strategic and tactical approaches.Delivery---All deliverables shall be delivered to the program manager and COR using agreed upon formats to meet the needs of FDA. All documentation delivered by the Contractor shall use FDA/OIMT standard templates, where appropriate. The FDA COR/Project Manager and contractor can adjust the set of deliverables or templates, when mutually agreed upon in writing. The contractor shall provide written justification for deviating from agreed-upon deliverable dates. Deliverables shall be submitted to the COR or government designee in accordance with the delivery schedule. The acceptance of deliverables and satisfactory work performance, required herein, shall be based upon the timeliness and accuracy of the deliverables.The Contracting Officer Representative or the duly authorized representative will perform inspection and acceptance of services. For delivery of project artifacts, the Contractor shall utilize MS Teams as the repository which will be accessible to the stakeholders.", "chunk_id": 6, "page_no": 6}, {"chunk": "Task 1 Deliverables – Program Management Support---Kickoff meeting conducted within 10 business days of contract award. The contractor shall schedule, coordinate, and attend a kickoff meeting. The FDA Project Manager will assist with identifying the specific location, date, time, and FDA attendees upon contract award. The kickoff meeting shall be conducted to introduce the Contractor team to the FDA Project Manager, COR, COR Designee, and OGPS POCs, as well as discuss roles, responsibilities, relevant issues, and the Contractor’s recommended approach to meeting the requirements.The Contractor shall deliver the Project Management Plan (PMP) no later than 10 days business days after kickoff meeting for FDA Program Manager and OGPS POC review and approval. The Contractor shall upload the PMP to the FDA’s MS Teams project repository and it should be updated as needed. The PMP is for the overall contract period of performance. The PMP will serve as the master contract project plan. The Contractor shall ensure that the PMP includes the following completed sections:o Stakeholder Register o Risk Register o Project and Deliverable Schedule---The Contractor shall set up and conduct a bi-weekly status meeting with the FDA Project Manager, COR and/or COR Designee at a time that is convenient for the FDA Project Manager and COR or COR Designee. The purpose of the weekly status meeting is to discuss the following items:o Work completed o Work remaining o Plans for the following week o Status of project schedule: Report if there is a schedule delay, or if there is an issue or dependency that will result in a schedule delay. Please note, this should reflect government dependencies as well, meaning if the schedule delay is based on a government action/decision, this should be noted in the status. Action Items, to include personnel to whom the Actions Items are assigned, date assigned, due date, and status (i.e., open, closed)o Hindrances or impediments to completing project tasks and recommendations for", "chunk_id": 7, "page_no": 7}, {"chunk": "mitigation/removal---o Issues that need to be raised to management o Administrative matters that may affect performance o Review of Risk Register, includes mitigation plans and issuesThe Contractor shall submit a monthly status report (MSR) in a format agreed upon at the kickoff meeting with a breakdown for each task. The MSR shall be provided to the FDA Project Manager and COR no later than the 5th of each month. The MSR shall, at a minimum, contain the following elements:o Reporting Period o Project Status, to include: o Summary of work performed o Goals for next reporting period o Work completed o Work remaining o Hours burned o Hours remaining o Hindrances or Impediments to completing project tasks and recommendations forremoval---o Bulleted list of changes/ updates made to the PMP over the past month: o Risk Register o Stakeholder Register o Contractor comments/issues for government Actiono Decisions made by the government during the reporting monthContractor shall obtain written verification of deliverable acceptance from the FDA ProjectManager.---Task 2 Deliverables –Current State Assessment of IT infrastructure---Task 2 should be completed in 90 days upon awardWritten executive summary of key findings from the assessment and inventory. This will bedelivered to the FDA Project Manager and include:o Key findings from the assessments conducted o Defines/benchmarks current operations against industry best practices o Tools and system gap analysis o High level recommendationsDetailed assessment and inventory of OGPS IT infrastructure current state. Should include:o OGPS systems, tools, shared drives, o Tools and system gap analysis", "chunk_id": 8, "page_no": 8}, {"chunk": "Task 3 Deliverables – Issues and Findings Sumary---Develop documentation that clearly describe the findings and issues discovered duringassessment.---Detailed assessment findings by functional areas in key categories (system, software, metrics,standardization)---These findings are organized by “RAG” status, Red (R) = significant issue; Amber (A) = identified issue, not critical but resolution needed; Green (G) = not an issue, acceptable riskAS-IS and TO-BE analysisTask 4 Deliverables - Propose Future State Recommendations and Requirements---Develop a document that provides a detailed description of proposed recommendations for thefuture OGPS IT infrastructure landscape. The document shall include:o Written report documenting assessment results and recommendations based upon the assessment performed in task 2 shall be provided to FDA Project Manager within 20 business days of assessment completion.o Assessment should include suggested actionable approach on achieving the To-Be state, including recommendations for software and/or services that is in accordance with FDA, State Dept, and other applicable enterprise requirementso To Be state for all inventory items based on assessment findings oIdentify performance metrics that can be used to measure and determine if the new approaches increase efficiency, efficacy, and accuracy of work performed within the Offices.Deliverable Schedule---Deliverabl Description---Quantity/Media---Date Completed---e---within 10 business days of contract award no later than 15 days business days after kickoff meeting 30 business days after staff is onboarded 40 days after Task 2 complete1", "chunk_id": 9, "page_no": 9}, {"chunk": "Kickoff Meeting---2Project Management Plan (PMP) Word document---PowerPoint, Excel or Word document---Executive summary of key findings from the assessments conducted3Detailed assessment and inventory of current state of IT infrastructure4Word document---40 days after Task 2 complete 30 business days prior to POP end date5Issues and Findings Document---Word document---Initial Recommendation’s Document, including AS-IS and TO-BE analysis6Word document---20 business days prior to POP end date By the 5th of each monthFinal Document---Recommendation’s---7Word document---Monthly Status Reports---and Finance---9Word document---Bi-weekly beginning after the kickoff meeting---10Bi-Weekly Status Reviews---3. Key Personnel---The Contractor shall ensure that all Contractor personnel are adequately trained, possess credentials appropriate to their labor categories, and are otherwise fully qualified to provide the high level of support required by this contract prior to being assigned to projects. FDA expectations are that the contractor will have the ability to understand and effectively service the scientific and Information technology community with knowledgeable, professional and capable personnel. FDA Staff shall not have to significantly alter, or update work products provided as draft or deliverables.The key personnel specified in this contract are essential to work performance. At least 30 days prior to the contractor voluntarily diverting any of the specified individuals to other programs or contracts the Contractor shall notify the Contracting Officer and shall submit a justification for the diversion or replacement and a request to replace the individual. The request must identify the proposed replacement and provide an explanation of how the replacement's skills, experience, and credentials meet or exceed the requirements of the contract (including, when applicable, Human Subjects Testing requirements). If the employee of the contractor is terminated for cause or separates from the contractor voluntarily withless than thirty days’ notice, the Contractor shall provide the maximum notice practicable under the circumstances. The Contractor shall not divert, replace, or announce any such change to key personnel without the written consent of the Contracting Officer. The contract may be modified to add or delete key personnel as necessary to reflect the agreement of the parties. Contractor shall provide personnel/staff that is adequately trained and who have attained knowledge necessary for the performance of the SOW requirements. Demonstrated experience is defined as having the experience noted in the resume under the particular job(s) in which it was performed, not at the summary level.Pursuant to HHSAR Clause 352.237-75 Key Personnel (Dec 18, 2015), the Key personnel for this Order are identified below:", "chunk_id": 10, "page_no": 10}, {"chunk": "A. Program Manager---PMP Certified or equivalent with hands-on work experience; Scrum Master certificationis a plus.Minimum of three years in a project manager role, including demonstrated experience in managing project scope, schedule, and cost, and multiple resource teams to execute project tasks.Demonstrated experience in analyzing complex problems that impact the project and provide innovative solutions/options that include analysis of schedules, costs, and technology/tools.Demonstrated experience in identifying and analyzing risks, preparing, and executingmitigation strategies.---B. Business Analyst---Minimum of 3 years of experience in a related role including demonstrated experiencewith eliciting requirements to capture high level business processes.Demonstrated experience working with architects and documenting the technicaldeliverables.---Experience with creating conceptual prototypes and mock-ups.C. System Architect---Minimum of 5 years of experience in a related role, including design of Cloudenvironments with a focus on FDA approved Cloud environments.Provide technical leadership on Cloud architecture and migration methodologies andtechniques.---Experience with evaluating shared service providers and advise on transition of local,server-based applications to Cloud based providers.Experience with developing strategies and guiding principles.4. Period of Performance---The Period of Performance is for eight (8) months from award of task order. Base Year – June 2022, thru February 20235. Place of Performance The Contractor shall have its own facility to perform the work. Should travel be required to the FDA campus for administrative or security requirements, note that such travel is not reimbursable. Meetings, briefings, interviews, and work sessions shall be conducted virtually.Work shall typically be performed during standard business hours for the location at which the work is performed (e.g., Monday – Friday between the hours of 8:00 AM and 6:00 PM Eastern Time for work conducted in the Washington D.C. area). The Contractor shall ensure that appropriate staff is available for meetings conducted during Washington D.C. area standard business hours, or as otherwise agreed upon by the Contractor and the FDA Project Manager. There may be meetings conducted at other times due to the geographically separated offices that comprise OGPS. The Contractor may be required to meet with OGPS personnel assigned to foreign offices in China, India, Belgium, the Netherlands, Mexico, Costa Rica, or Chile during their local business hours. These meetings will be kept to the minimum necessary and will be held virtually.", "chunk_id": 11, "page_no": 11}, {"chunk": "Other Unique Requirements FDA Site Requirements---If at any time the contractor must visit FDA facilities (e.g., for badging or other administrative purpose), contractors must be in accordance with all FDA health and safety requirements. The contractor shall confer with the program manager and COR to assure all current requirements are understood. Guidance may change at any time during the performance of this task order.6. Government-Furnished Property, Material, Equipment, or Information (GFP, GFM, GFE, or---GFI)The Government will furnish FDA standard issue Government furnished equipment to each labor resource working on this contract. The Government will provide and may periodically update a list of data sources for analysis by the contractor, but this information will not be the complete set of sources analyzed by the contractor.This equipment is authorized for transaction of official government business only and shall not be used for personal business. The cost of replacement GFE as a result of contractor negligence may be deducted for the Contractor’s invoice.7. Travel There are no travel requirements anticipated for the performance of the service(s). If travel is required under this contract, the Contractor shall comply with all Federal Travel Regulation (FTR) regulations when engaging it travel related to this Task Order. The FTR is available at http://www.gsa.gov.The COR will inform the Contractor, in writing, when travel will be necessary under this order. The Contractor shall submit a travel request to the COR showing transit, hotel and per diem costs for the travel. The Contractor shall not travel until the COR approves the travel request. The Contractor shall submit proper documentation (copy of approved travel request, receipts, credit card statements, etc.) in order to be reimbursed for the travel.", "chunk_id": 12, "page_no": 11}, {"chunk": "8. Government Points of Contact---Contracting Specialist (CO): Tiffany Gates---Email: Tiffany.gates@fda.hhs.gov---Contracting Officer’s Representative (COR):---Email:---Contracting Officer’s Authority---The Contracting Officer (CO) has responsibility for ensuring the performance of all necessary actions for effective contracting, ensuring compliance with the terms of the Task Order and safeguarding the interests of the United States in its contractual relationships. The CO is the only individual who has the authority to enter into, administer, or terminate this Task Order and is the only person authorized to approve changes to any of the requirements under this Task Order, and notwithstanding any provision contained elsewhere in this Task Order, this authority remains solely with the CO.No statement, whether oral or written, by anyone other than the Contracting Officer, shall be interpreted as modifying the terms and conditions of this Task Order. It is the Contractor’s responsibility to contact the CO immediately if there is even the appearance of any technical direction that is or may be outside the scope of the Task Order. The Government will not reimburse the Contractor for any work not authorized by the Contracting Officer, including work outside the scope of the Task Order.Contracting Officer’s Representative (COR)---The Contracting Officer’s Representative (COR) is responsible for: (1) monitoring the Contractor's technical progress, including the surveillance and assessment of performance and recommending to the Contracting Officer changes in requirements; (2) interpreting the statement of work and any other technical performance requirements; (3) performing technical evaluation as required; (4) performing technical inspections and acceptances required by this contract; and (5) assisting in the resolution of technical problems encountered during performance.The Contracting Officer is the only person with authority to act as agent of the Government under this contract. Only the Contracting Officer has authority to: (1) direct or negotiate any changes in the statement of work; (2) modify or extend the period of performance; (3) change the delivery schedule; (4) authorize reimbursement to the Contractor for any costs incurred during the performance of this contract; or (5) otherwise change any terms and conditions of this contract.The Government may unilaterally change its COR designation.", "chunk_id": 13, "page_no": 12}, {"chunk": "9. IPP Invoicing Instruction---FDA Electronic Invoicing and Payment Requirements - Invoice Processing Platform (IPP) (Jan 2022) a. All Invoice submissions for goods and or services must be made electronically through the U.S. Department (IPP). of Treasury's http://www.ipp.gov/vendors/index.htm b. Invoice Submission for Payment means any request for contract financing payment or invoice payment by the Contractor. To constitute a proper invoice, the payment request must comply with the requirements identified in FAR 32.905(b), \"Content of Invoices\" and the applicable Payment clause included in this contract, or the clause 52.212-4 Contract Terms and Conditions - Commercial Items included in commercial items contracts. The IPP website address is: https://www.ipp.gov c. ------ 1. The Agency will enroll the Contractors new to IPP. The Contractor must follow the IPP registration email instructions for enrollment to register the Collector Account for submitting invoice requests for payment. The Contractor Government Business Point of Contact (as listedInvoice---Processing---Platform---System---in SAM) will receive Registration email from the Federal Reserve Bank of St. Louis (FRBSTL) within 3 - 5 business days of the contract award for new contracts or date of modification for existing contracts. 2. Registration emails are sent via email from ipp.noreply@mail.eroc.twai.gov. Contractor assistance with enrollment can be obtained by contacting the IPP Production Helpdesk via email to IIPCustomerSupport@fiscal .treasury.gov or phone (866) 973-3131. 3. The Contractor POC will receive two emails from IPP Customer Support, the first email contains the initial administrative IPP User ID. The second email, sent within 24 hours of receipt of the first email, contains a temporary password. You must log in with the temporary password within 30 days. 4. If your company is already registered to use IPP, you will not be required to re-register. 5. If the Contractor is unable to comply with the requirement to use IPP for submitting invoices for payment as authorized by HHSAR 332.7002, a written request must be submitted to the Contracting Officer to explain the circumstances that require the authorization of alternate payment procedures. d. Invoices that include time and materials or labor hours Line Items must include supporting documentation to (1) substantiate the number of labor hours invoiced for each labor category, and (2) substantiate material costs incurred (when applicable). e. Invoices that include cost-reimbursement Line Items must be submitted in a format showing expenditures for that month, as well as contract cumulative amounts. At a minimum the following cost information shall be included, in addition to supporting documentation to substantiate costs incurred. • Direct Labor - include all persons, listing the person's name, title, number of hours worked, hourly rate, the total cost per person and a total amount for this category; • Indirect Costs (i.e., Fringe Benefits, Overhead, General and Administrative, Other Indirects)- show rate, base and total amount; • Consultants (if applicable) - include the name, number of days or hours worked, daily or hourly rate, and a total amount per consultant; • Travel - include for each airplane or train trip taken the name of the traveler, date of travel, destination, the transportation costs including ground transportation shown separately and the per diem costs. Other travel costs shall also be listed; • Subcontractors (if applicable) - include, for each subcontractor, the same data as required for the prime Contractor; • Other Direct Costs - include a listing of all other direct charges to the contract, i.e., office supplies, telephone, duplication, postage; and • Fee - amount as allowable in accordance with the Schedule and FAR 52.216-8 if applicable. f. Contractor is required to attach an invoice log addendum to each invoice which shall include, at a minimum, the following information for contract administration and reconciliation purposes: (a) list of all invoices submitted to date under the subject award, including the following: (1) invoice number, amount, & date submitted (2) corresponding payment amount & date received (b) total amount of all payments received to date under the subject contract or order (c) and, for definitized contracts or orders only, total estimated amounts yet to be invoiced for the current, active period of performance. g. Payment of invoices will be made based upon acceptance by the Government of the entire task or the tangible product deliverable(s) invoiced. Payments shall be based on the Governmentcertifying that satisfactory services were provided, and the Contractor has certified that labor charges are accurate. h. If the services are rejected for failure to conform to the technical requirements of the task order, or any other contractually legitimate reason, the Contractor shall not be paid, or shall be paid an amount negotiated by the CO. i. Payment to the Contractor will not be made for temporary work stoppage due to circumstances beyond the control of U.S. Food and Drug Administration such as acts of God, inclement weather, power outages, and results thereof, or temporary closings of facilities at which Contractor personnel are performing. This may, however, be justification for excusable delays. j. The Contractor agrees that the submission of an invoice to the Government for payment is a certification that the services for which the Government is being billed, have been delivered in accordance with the hours shown on the invoices, and the services are of the quality required for timely and successful completion of the effort. k. Questions regarding invoice payments that cannot be resolved by the IPP Helpdesk should be directed to the FDA Employee Resource and Information Center (ERIC) Helpdesk at 301-827- ERIC (3742) or toll-free 866-807-ERIC (3742); or, by email at ERIC@fda.hhs.gov. Refer to the Call-in menu options and follow the phone prompts to dial the option that corresponds to the service that's needed. All ERIC Service Now Tickets will either be responded to or resolved within 48 hours (2 business days) of being received. When emailing, please be sure to include the contract number, invoice number and date of invoice, as well as your name, phone number, and a detailed description of the issue.", "chunk_id": 14, "page_no": 14}, {"chunk": "10. Security and Privacy Requirements---Baseline Security Requirements---1. Applicability. The requirements herein apply whether the entire contract or order (hereafter “contract”), or portion thereof, includes either or both of the following: 2. Access (Physical or Logical) to Government Information: A Contractor (and/or any subcontractor) employee will have or will be given the ability to have, routine physical (entry) or logical (electronic) access to government information.a. Operate a Federal System Containing Information: A Contractor (and/or any subcontractor) will operate a federal system and information technology containing data that supports the HHS mission. In addition to the Federal Acquisition Regulation (FAR) Subpart 2.1 definition of “information technology” (IT), the term as used in this section includes computers, ancillary equipment (including imaging peripherals, input, output, and storage devices necessary for security and surveillance), peripheral equipment designed to be controlled by the central processing unit of a computer, software, firmware and similar procedures, services (including support services), and related resources.3. Safeguarding Information and Information Systems. In accordance with the Federal Information Processing Standards Publication (FIPS)199, Standards for Security Categorization of Federal Information and Information Systems, the Contractor (and/or any subcontractor) shall:a. Protect government information and information systems in order to ensure:a. Confidentiality, which means preserving authorized restrictions on access and disclosure, based on the security terms found in this contract, including means for protecting personal privacy and proprietary", "chunk_id": 15, "page_no": 15}, {"chunk": "information---b. Integrity, which means guarding againstinformation modification or destruction, and ensuring information non-repudiation and authenticityimproper---c. Availability, which means ensuring timely and reliable access to and use ofinformation---b. Provide security for any Contractor systems, and information contained therein, connected to an FDA network or operated by the Contractor on behalf of FDA regardless of location. In addition, if new or unanticipated threats or hazards are discovered by either the agency or contractor, or if existing safeguards have ceased to function, the discoverer shall immediately, within one (1) hour or less, bring the situation to the attention of the other party. This includes notifying the FDA Systems Management Center (SMC) within one (1) hour of discovery/detection in the event of an information security incident.c. Adopt and implement the policies, procedures, controls, and standards required by the HHS/FDA Information Security Program to ensure the confidentiality, integrity, and availability of government information and government information systems for which the Contractor is responsible under this contract or to which the Contractor may otherwise have access under this contract. Obtain the FDA Information Security Program security requirements, outlined in the FDA Information Security and Privacy Policy (IS2P), by contacting the CO/COR or emailing your ISSO.d. Comply with the Privacy Act requirements and tailor FAR clauses as needed.", "chunk_id": 16, "page_no": 15}, {"chunk": "Contract Initiation and Expiration---1) General Security Requirements. The Contractor (and/or any subcontractor) shall comply with information security and privacy requirements, Enterprise Performance Life Cycle (EPLC) processes, HHS Enterprise Architecture requirements to ensure information is appropriately protected from initiation to expiration of the contract. All information systems development or enhancement tasks supported by the contractor shall follow the FDA EPLC framework and methodology in accordance with the HHS Contract Closeout Guide (2012).HHS EA requirements may be located here: https://www.hhs.gov/ocio/ea/documents/proplans.html2) System Documentation. Contractors (and/or any subcontractors) must follow and adhere to NIST SP 800-64, Security Considerations in the System Development Life Cycle, at a minimum, for system development and provide system documentation at designated intervals (specifically, at the expiration of the contract) within the EPLC that require artifact review and approval.3) Sanitization of Government Files and Information. As part of contract closeout and at expiration of the contract, the Contractor (and/or any subcontractor) shall provide all required documentation in accordance with FDA OAGS SMGs to the CO and/or COR to certify that, at the government’s direction, all electronic and paper records are appropriately disposed of and all devices and media are sanitized in accordance with NIST SP 800-88, Guidelines for Media Sanitization and FDA IS2P Appendix T: Sanitization of Computer-Related Storage Media4) Notification. The Contractor (and/or any subcontractor) shall notify the CO and/or COR as soon as it is known that an employee will stop working under this contract.5) Contractor Responsibilities Upon Physical Completion of the Contract. The contractor (and/or any subcontractors) shall return all government information and IT resources (i.e., government information innon-government-owned systems, media, and backup systems) acquired during the term of this contract to the CO and/or COR. Additionally, the Contractor shall provide a certification that all government information has been properly sanitized and purged from Contractor-owned systems, including backup systems and media used during contract performance, in accordance with HHS and/or FDA policies.6) The Contractor (and/or any subcontractor) shall coordinate with the COR via email, coping the Contract Specialist, to ensure that the appropriate person performs and documents the actions identified in the FDA eDepart system http://inside.fda.gov:9003/EmployeeResources/NewEmployee/eDepartDepartureSystem/default.htm as soon as it is known that an employee will terminate work under this contract within days of the employee’s exit from the contract. All documentation shall be made available to the CO and/or COR upon request.H. Records Management and Retention The Contractor (and/or any subcontractor) shall maintain all information in accordance with Executive Order 13556 -- Controlled Unclassified Information, National Archives and Records Administration (NARA) records retention policies and schedules and HHS/FDA policies and shall not dispose of any records unless authorized by HHS/FDA.In the event that a contractor (and/or any subcontractor) accidentally disposes of or destroys a record without proper authorization, it shall be documented and reported as an incident in accordance with HHS/FDA policies.", "chunk_id": 17, "page_no": 16}, {"chunk": "Contractor Personnel Security Clearance Standards and Residency Requirements---1. BACKGROUND - The Office of the Assistant Secretary for Management and Budget, Department of Health and Human Services (DHHS), requires that Contractor employees (including subcontractors) who will be working in DHHS-owned or leased space and/or who will have access to DHHS equipment, and non-public privileged, proprietary, or trade secret information, must undergo a background investigation that results in a favorable determination.Contractor employees who will work in DHHS-owned or leased space for less than thirty (30) days are considered visitors and are exempted from background investigation requirements; and therefore, will not be issued a Personal Identity Verification (PIV) Card. These contractor employees go through visitor screening each day and must be escorted at all time while in DHHS-owned or leased space.2. GENERAL - The Contractor shall submit the following items to the Contracting Officer’s Representative (COR), within five (5) business days of commencement of work under this contract:A roster of contractor employee names, identifying Key Personnel and Tier designation(s);Confirmation all individual employee security information has been submitted properly; and\"Contractor's Commitment to Protect Non-public Information Agreement\" forms signed by each employee named in the roster.Pursuant to HSPD-12, the Contractor shall advise its prospective employees about the security and background requirements stated hereinFor any individual who does not obtain a favorable background investigation he/she must cease work on the contract immediately.If a Contractor employee changes job responsibilities under this contract, the Contractor shall notify the COR, and the Government will make a determination whether an additional security clearance is required.In the event there are any proposed personnel changes in the Contractor’s staffing roster previously submitted to the COR, the Contractor must submit an updated roster to the COR, along with a brief explanation for the change. In turn, the COR will initiate the procedures stated herein to ensure any new contractor employees obtain a PIV card in a timely manner – prior to that individual commencing work under the contract.Note: If the proposed personnel change is for a position designated Key Personnel under the contract, a complete justification – along with a resume or curriculum vitae – must be submitted to the Contracting Officer and COR for review and approval. If approved, the Contracting Officer will execute a Contract Modification prior to that individual commencing work under the contract.BACKGROUND INVESTIGATIONS - With the exception of costs associated with 3. fingerprinting Contractor employees outside of the FDA Personnel Security Office, the Government will conduct all required background investigations at no cost to the Contractor. The cost of fingerprinting Contractor employees at any location other than the FDA Personnel Security Office will be borne by the Contractor. Employees who hold or have previously held a Government security clearance shall advise the FDA Personnel Security Staff of the details of such clearance.Note: Background investigations will be conducted by the Office of Personnel Management (OPM)CONTRACT RISK DESIGNATION(S) - Contractor employees who will be in DHHS-owned 4. or leased space for thirty (30) days or more must be able to obtain and shall obtain a PIV card pursuant to Homeland Security Presidential Directive-12 (HSPD-12) in order to access to DHHS-owned or leased property without an escort. (See Section 6 for details on the PIV Card process) However, in the event that work must commence before a security screening can be completed, contractor employees will be considered visitors, as described above, and allowed onto DHHS-owned or leased property, but must be escorted at all times.All Contractor employees who undergo a background investigation are required to log onto the Office of Personnel Management’s (OPM’s) Electronic Questionnaire for Investigation Processing system (e-Qip) system. The FDA Personnel Security Specialist will provide access to the e-Qip as well as guidance as to which forms will be required. The forms required vary with the position risk designations for the contract.All standard forms submitted to the FDA will be forwarded to the Office of Personnel Management (OPM) to initiate background investigations. The assigned FDA Personnel Security Specialist will resolve with the contractor employee any issues arising out of inaccurate or incomplete forms.", "chunk_id": 18, "page_no": 17}, {"chunk": "The Risk Designation(s) for this contract is/are Tier(s): 1 and 2---There are three (3) potential position risk designations, which are:Non-Sensitive Low Risk (Tier 1) - Positions which involve the lowest degree of adverse impact on the efficiency of the Agency. The forms set forth by the FDA Personnel Security Specialist are required for Non-Sensitive Low Risk Positions.Sensitive Moderate Risk (Tier 2) or Sensitive High Risk (Tier 4) - Public Trust Positions - Positions in which the incumbent's actions or inaction could diminish public confidence in the integrity, efficiency, or effectiveness of assigned Government activities, whether ornot actual damage occurs.---In order to access the e-QIP system, Contractor employees must provide the appropriate FDA Personnel Security Specialist with the following information: (a) full name; (b) position title; (c) social security number; (d) date of birth; (e) place of birth; (f) email address; and (g) phone number. This information will be provided on the e-Qip form that will be electronically sent to the employee. The FDA Personnel Security Specialist will use this information to enter each Contractor employee into the e-QIP system. Once this is done, each Contractor employee will receive an email that contains a web link to access the e-QIP system, as well as instructions and additional forms needed to initiate the background investigation.A Contractor’s failure to comply with the e-QIP processing guidelines will result in that Contractor’s employees being denied access to FDA property until all security processing has been completed. Furthermore, any such noncompliance may detrimentally impact Contractor performance, Contractor performance evaluations, rights and remedies available at law and equity retained by the Government.PERSONAL IDENTITY VERIFICATION (PIV) CARDS - All PIV Cards (and any other 5. type of Government-issued Access Card) shall remain the property of the Federal Government. At any time, if a Contractor employee is terminated or otherwise ceases work under the contract, or no longer requires a PIV Card for contract performance purposes, the Contractor shall collect the individual’s PIV card and immediately notify FDA Personnel Security Staff in writing, with copies to the respective COR and Contracting Officer. The Contractor shall immediately return the PIV Card(s) to the COR.Because PIV Cards, like other Government-issued Access Cards are Government property, Contractors and Contractor Employees are hereby placed on notice that any abuse, destruction, defacement, unauthorized transfer or withholding (i.e., failure to return to the Government) may be punishable to the greatest extent at law.Unauthorized possession of a PIV Card, or any other type of Government-issued Access Card, and/or willfully allowing any other person to have or to use your Access Card, is prohibited and can be criminally prosecuted under 18 U.S.C. §§ 499 and 70I, which prohibit photographing or otherwise reproducing or possessing HHS identification cards in an unauthorized manner, under penalty of fine, imprisonment, or both. Wrongdoers may also be held financially responsible for any/all civil and equitable remedies – to include, but not limited to, damages for any pecuniary loss suffered by the Government as a result of any of the above-listed actions or failure to act.6. PIV CARD PROCESS - The COR will sponsor Contractor employees on the Form HHS 745 and HHS Smart Card Management System (SCMS) for the purpose of obtaining an FDA PIV Card. In order to obtain a PIV card, a Contractor employee must receive a favorable FBI fingerprint return and complete required security forms. The FDA Personnel Security Specialist shall provide the Contractor employee(s) direction for scheduling fingerprinting appointments at the FDA location or other approved location.During a fingerprint appointment, each contractor employee must present two (2) forms of identification in order to receive his or her PIV Card. One form of identification must be a government-issued photo identification document. Acceptable forms of identification are listed in Appendix E. An individual who receives an unfavorable report may appeal that finding by submitting a written request to the FDA Personnel Security Specialist.Required background investigations may include, but are not limited to:", "chunk_id": 19, "page_no": 19}, {"chunk": "Review of prior Government/military personnel records---Review of FBI records and fingerprint files---Searches of credit bureaus---Personal interviews---Written inquiries covering the subject's background7. RESIDENCY REQUIREMENTS FOR FOREIGN NATIONALS - Under the requirements for Homeland Security Presidential Directive-12 (HSPD-12), OPM can complete a background investigation only for persons who have resided in the U.S. for a total of at least three (3) of the past five (5). The residency requirements apply only to foreign nationals (emphasis added). Therefore, Offerors/Contractors are strongly advised to inquire of any prospective foreign national hires as to whether or not they have resided in the U.S. for a total of at least three (3) of the past five (5) years. If any prospective foreign national contractor/subcontractor employee does not meet the residency requirements, he/she cannot qualify for a PIV Card under HSPD-12.8. NON-PUBLIC DATA PROTECTION - The Contractor shall protect the privacy of all information reported by or about Contractor employees and shall protect against unauthorized disclosure.Upon a favorable fingerprint return, the Contractor will be notified to return to the Badging and Credentialing Office for their building pass.Food and Drug Administration Badging and Credentialing Office 8:00 a.m. – 11:00 a.m. and 1:00 p.m. – 3:00 p.m., Eastern Time 10903 New Hampshire Avenue Building 32, Room 1205 Silver Spring, MD 20993 appointment necessary Telephone: (301) 796-4000", "chunk_id": 20, "page_no": 20}, {"chunk": "11. Contractor Performance Evaluation---In accordance with Federal Acquisition Regulation (FAR) 42.15, FDA will complete annual and final contractor performance evaluations. Annual evaluations will be prepared to coincide with the anniversary date of the contract. Additional interim performance evaluations may be prepared at Contracting Officer discretion, as necessary. Final performance evaluations will be completed upon contract expiration.FDA will utilize the Contractor Performance Assessment Reporting System (CPARS) in order to execute annual and final contractor performance evaluations. CPARS is a secure Internet website located at https://cpars.gov/. FDA will register the contractor in CPARS upon receipt of the name and email address of two (2) individuals who will be responsible for serving as the Contractor’s primary and alternate CPARS contacts. Once FDA registers the contractor in CPARS, the Contractor will receive an automated CPARS email message which contains User IDs and instructions for creating a password.Once a performance evaluation is issued, the Contractor’s primary and alternate CPARS contact will receive an email instructing them to logon to CPARS in order to review the performance evaluation. The Contractor has 14 days from the date of performance evaluation issuance in which to review the evaluation. If the Contractor is in agreement with the performance evaluation outcome, the evaluation becomes final. Should the Contractor be in disagreement with the performance evaluation outcome, rebuttal comments must be submitted via the CPARS within 30 days from date the evaluation was issued by FDA. Any disagreement between the Contracting Officer and the Contractor will be referred to a contracting official one level above the Contracting Officer, whose decision will be final.", "chunk_id": 21, "page_no": 21}, {"chunk": "12. Inspection and Acceptance---All items specified in the statement of work to be delivered under this contract is subject to final inspection and acceptance by an authorized representative for the Government. The authorized representative of the Government is the Government’s COR, who is responsible for inspection and acceptance of all services, materials, or supplies to be provided by the Contractor.13. FAR / HHSAR Clauses The following FAR and HHSAR provisions and clauses, incorporated by reference, apply to this acquisition and can be obtained at https://www.acquisition.gov/far/ and https://www.hhs.gov/grants/contracts/contract-policies-regulations/hhsar/index.htmlFAR Clauses: FAR 52.227-14: Rights in Data – General (May 2014) FAR 52.239-1: Privacy or Security Safeguards (Aug 1996) FAR 52.232-39: Unenforceability of Unauthorized Obligations (Jun 2013)FAR 52.217-8 Option to Extend Services (Nov 1999)---The Government may require continued performance of any services within the limits and at the rates specified in the contract. These rates may be adjusted only as a result of revisions to prevailing labor rates provided by the Secretary of Labor. The option provision may be exercised more than once, but the total extension of performance hereunder shall not exceed 6 months. The Contracting Officer may exercise the option by written notice to the Contractor any time after contract award. (End of Clause)FAR 52.212-4 Contract Terms and Conditions—Commercial Products and Commercial Services (alternate 1) (NOV 2021).(a) Inspection/Acceptance. (1) The Government has the right to inspect and test all materials furnished and services performed under this contract, to the extent practicable at all places and times , including the period of performance, and in any event before acceptance . The Government may also inspect the plant or plants of the Contractor or any subcontractor engaged in contract performance. The Government will perform inspections and tests in a manner that will not unduly delay the work. (2) If the Government performs inspection or tests on the premises of the Contractor or a subcontractor , the Contractor shall furnish and shall require subcontractors to furnish all reasonable facilities and assistance for the safe and convenient performance of these duties.(3) Unless otherwise specified in the contract, the Government will accept or reject services and materials at the place of delivery as promptly as practicable after delivery, and they will be presumed accepted 60 days after the date of delivery, unless accepted earlier. (4) At any time during contract performance, but not later than 6 months (or such other time as may be specified in the contract) after acceptance of the services or materials last delivered under this contract, the Government may require the Contractor to replace or correct services or materials that at time of delivery failed to meet contract requirements. Except as otherwise specified in paragraph (a)(6) of this clause, the cost of replacement or correction shall be determined under paragraph (i) of this clause, but the \"hourly rate\" for labor hours incurred in the replacement or correction shall be reduced to exclude that portion of the rate attributable to profit. Unless otherwise specified below, the portion of the \"hourly rate\" attributable to profit shall be 10 percent. The Contractor shall not tender for acceptance materials and services required to be replaced or corrected without disclosing the former requirement for replacement or correction, and, when required, shall disclose the corrective action taken. [Insert portion of labor rate attributable to profit.] (5)(i) If the Contractor fails to proceed with reasonable promptness to perform required replacement or correction, and if the replacement or correction can be performed within the ceiling price (or the ceiling price as increased by the Government), the Government may- (A) By contract or otherwise, perform the replacement or correction, charge to the Contractor any increased cost, or deduct such increased cost from any amounts paid or due under this contract; or (B) Terminate this contract for cause. (ii) Failure to agree to the amount of increased cost to be charged to the Contractor shall be a dispute under the Disputes clause of the contract. (6) Notwithstanding paragraphs (a)(4) and (5) above, the Government may at any time require the Contractor to remedy by correction or replacement, without cost to the Government, any failure by the Contractor to comply with the requirements of this contract, if the failure is due to- (i) Fraud, lack of good faith, or willful misconduct on the part of the Contractor's managerial personnel ; or (ii) The conduct of one or more of the Contractor ’s employees selected or retained by the Contractor after any of the Contractor’s managerial personnel has reasonable grounds to believe that the employee is habitually careless or unqualified. (7) This clause applies in the same manner and to the same extent to corrected or replacement materials or services as to materials and services originally delivered under this contract. (8) The Contractor has no obligation or liability under this contract to correct or replace materials and services that at time of delivery do not meet contract requirements, except as provided in this clause or as may be otherwise specified in the contract. (9) Unless otherwise specified in the contract, the Contractor 's obligation to correct or replace Government-furnished property shall be governed by the clause pertaining to Government property. (b) Assignment. The Contractor or its assignee may assign its rights to receive payment due as a result of performance of this contract to a bank, trust company, or other financing institution, including any Federal lending agency in accordance with the Assignment of Claims Act ( 31 U.S.C. 3727). However, when a third party makes payment (e.g., use of the Governmentwide commercial purchase card), the Contractor may not assign its rights to receive payment under this contract.(c) Changes. Changes in the terms and conditions of this contract may be made only by written agreement of the parties. (d) Disputes. This contract is subject to 41 U.S.C. chapter 71, Contract Disputes. Failure of the parties to this contract to reach agreement on any request for equitable adjustment, claim, appeal or action arising under or relating to this contract shall be a dispute to be resolved in accordance with the clause at Federal Acquisition Regulation (FAR) 52.233-1, Disputes, which is incorporated herein by reference. The Contractor shall proceed diligently with performance of this contract, pending final resolution of any dispute arising under the contract. (e) Definitions. (1) The clause at FAR 52.202-1, Definitions, is incorporated herein by reference. As used in this clause- (i) \"Direct materials \" means those materials that enter directly into the end product , or that are used or consumed directly in connection with the furnishing of the end product or service. (ii) \"Hourly rate\" means the rate(s) prescribed in the contract for payment for labor that meets the labor category qualifications of a labor category specified in the contract that are- (A) Performed by the contractor ; (B) Performed by the subcontractors ; or (C) Transferred between divisions, subsidiaries , or affiliates of the contractor under a common control. (iii) \"Materials \" means- (A) Direct materials , including supplies transferred between divisions, subsidiaries , or affiliates of the contractor under a common control; (B) Subcontracts for supplies and incidental services for which there is not a labor category specified in the contract; (C) Other direct costs (e.g., incidental services for which there is not a labor category specified in the contract, travel, computer usage charges, etc.); (D) The following subcontracts for services which are specifically excluded from the hourly rate: [Insert any subcontracts for services to be excluded from the hourly rates prescribed in the schedule.]; and (E) Indirect costs specifically provided for in this clause. (iv) \"Subcontract \" means any contract, as defined in FAR subpart 2.1, entered into with a subcontractor to furnish supplies or services for performance of the prime contractor a subcontract including transfers between divisions, subsidiaries , or affiliates of a contractor or subcontractor . It includes, but is not limited to, purchase orders, and changes and modifications to purchase orders. (f) Excusable delays. The Contractor shall be liable for default unless nonperformance is caused by an occurrence beyond the reasonable control of the Contractor and without its fault or negligence such as, acts of God or the public enemy, acts of the Government in either its sovereign or contractual capacity, fires, floods, epidemics, quarantine restrictions, strikes, unusually severe weather, and delays of common carriers. The Contractor shall notify the Contracting Officer in writing as soon as it is reasonably possible after the commencement of any excusable delay, setting forth the full particulars in connection therewith, shall remedy such occurrence with all reasonable dispatch, and shall promptly give written notice to the Contracting Officer of the cessation of such occurrence. (g) Invoice.(1) The Contractor shall submit an original invoice and three copies (or electronic invoice, if authorized) to the address designated in the contract to receive invoices. An invoice must include-(i) Name and address of the Contractor ; (ii) Invoice date and number; (iii) Contract number, line item number and, if applicable, the order number; (iv) Description, quantity, unit of measure, unit price and extended price of the items delivered; (v) Shipping number and date of shipment, including the bill of lading number and weight of shipment if shipped on Government bill of lading; (vi) Terms of any discount for prompt payment offered; (vii) Name and address of official to whom payment is to be sent; (viii) Name, title, and phone number of person to notify in event of defective invoice; and (ix) Taxpayer Identification Number (TIN). The Contractor shall include its TIN on the invoice only if required elsewhere in this contract. (x) Electronic funds transfer (EFT) banking information .(A) The Contractor shall include EFT banking information on the invoice only if required elsewhere in this contract.(B) If EFT banking information is not required to be on the invoice, in order for the invoice to be a proper invoice, the Contractor shall have submitted correct EFT banking information in accordance with the applicable solicitation provision, contract clause (e.g., 52.232-33, Payment by Electronic Funds Transfer-System for Award Management, or 52.232-34, Payment by Electronic Funds Transfer-Other Than System for Award Management), or applicable agency procedures. (C) EFT banking information is not required if the Government waived the requirement to pay by EFT. (2) Invoices will be handled in accordance with the Prompt Payment Act ( 31 U.S.C.3903) and Office of Management and Budget (OMB) prompt payment regulations at 5 CFR Part 1315. (h) Patent indemnity. The Contractor shall indemnify the Government and its officers, employees and agents against liability, including costs, for actual or alleged direct or contributory infringement of, or inducement to infringe, any United States or foreign patent, trademark or copyright, arising out of the performance of this contract, provided the Contractor is reasonably notified of such claims and proceedings. (i) Payments. (1) Work performed. The Government will pay the Contractor as follows upon the submission of commercial invoices approved by the Contracting Officer: (i) Hourly rate. (A) The amounts shall be computed by multiplying the appropriate hourly rates prescribed in the contract by the number of direct labor hours performed. Fractional parts of an hour shall be payable on a prorated basis. (B) The rates shall be paid for all labor performed on the contract that meets the labor qualifications specified in the contract. Labor hours incurred to perform tasks for which labor qualifications were specified in the contract will not be paid to the extent the work is performed by individuals that do not meet the qualifications specified in the contract, unless specifically authorized by the Contracting Officer. (C) Invoices may be submitted once each month (or at more frequent intervals, if approved by the Contracting Officer) to the Contracting Officer or the authorized representative.(D) When requested by the Contracting Officer or the authorized representative, the Contractor shall substantiate invoices (including any subcontractor hours reimbursed at the hourly rate in the schedule) by evidence of actual payment, individual daily job timecards, records that verify the employees meet the qualifications for the labor categories specified in the contract, or other substantiation specified in the contract. (E) Unless the Schedule prescribes otherwise, the hourly rates in the Schedule shall not be varied by virtue of the Contractor having performed work on an overtime basis. (1) If no overtime rates are provided in the Schedule and the Contracting Officer approves overtime work in advance, overtime rates shall be negotiated. (2) Failure to agree upon these overtime rates shall be treated as a dispute under the Disputes clause of this contract. (3) If the Schedule provides rates for overtime, the premium portion of those rates will be reimbursable only to the extent the overtime is approved by the Contracting Officer. (ii) Materials . (A) If the Contractor furnishes materials that meet the definition of a commercial product at FAR 2.101, the price to be paid for such materials shall not exceed the Contractor ’s established catalog or market price, adjusted to reflect the- (1) Quantities being acquired; and (2) Any modifications necessary because of contract requirements. (B) Except as provided for in paragraph (i)(1)(ii)(A) and (D)(2) of this clause, the Government will reimburse the Contractor the actual cost of materials (less any rebates, refunds, or discounts received by the contractor that are identifiable to the contract) provided the Contractor - (1) Has made payments for materials in accordance with the terms and conditions of the agreement or invoice; or (2) Makes these payments within 30 days of the submission of the Contractor ’s payment request to the Government and such payment is in accordance with the terms and conditions of the agreement or invoice. (C) To the extent able, the Contractor shall- (1) Obtain materials at the most advantageous prices available with due regard to securing prompt delivery of satisfactory materials ; and (2) Give credit to the Government for cash and trade discounts, rebates, scrap, commissions, and other amounts that are identifiable to the contract. (D) Other Costs. Unless listed below, other direct and indirect costs will not be reimbursed. (1) Other Direct Costs. The Government will reimburse the Contractor on the basis of actual cost for the following, provided such costs comply with the requirements in paragraph (i)(1)(ii)(B) of this clause:[Insert each element of other direct costs (e.g., travel, computer usage charges, etc. Insert \"None\" if no reimbursement for other direct costs will be provided. If this is an indefinite delivery contract, the Contracting Officer may insert \"Each order must list separately the elements of other direct charge(s) for that order or, if no reimbursement for other direct costs will be provided, insert ‘None’.\"] (2) Indirect Costs (Material Handling, Subcontract Administration, etc.). The Government will reimburse the Contractor for indirect costs on a pro-rata basis over the period of contract performance at the following fixed price:[Insert a fixed amount for the indirect costs and payment schedule. Insert \"$0\" if no fixed price reimbursement for indirect costs will be provided. (If this is an indefinite delivery contract, the Contracting Officer may insert \"Each order must listseparately the fixed amount for the indirect costs and payment schedule or, if no reimbursement for indirect costs, insert ‘None’).\"] (2) Total cost. It is estimated that the total cost to the Government for the performance of this contract shall not exceed the ceiling price set forth in the Schedule and the Contractor agrees to use its best efforts to perform the work specified in the Schedule and all obligations under this contract within such ceiling price. If at any time the Contractor has reason to believe that the hourly rate payments and material costs that will accrue in performing this contract in the next succeeding 30 days, if added to all other payments and costs previously accrued, will exceed 85 percent of the ceiling price in the Schedule, the Contractor shall notify the Contracting Officer giving a revised estimate of the total price to the Government for performing this contract with supporting reasons and documentation. If at any time during the performance of this contract, the Contractor has reason to believe that the total price to the Government for performing this contract will be substantially greater or less than the then stated ceiling price, the Contractor shall so notify the Contracting Officer, giving a revised estimate of the total price for performing this contract, with supporting reasons and documentation. If at any time during performance of this contract, the Government has reason to believe that the work to be required in performing this contract will be substantially greater or less than the stated ceiling price, the Contracting Officer will so advise the Contractor , giving the then revised estimate of the total amount of effort to be required under the contract. (3) Ceiling price. The Government will not be obligated to pay the Contractor any amount in excess of the ceiling price in the Schedule, and the Contractor shall not be obligated to continue performance if to do so would exceed the ceiling price set forth in the Schedule, unless and until the Contracting Officer notifies the Contractor in writing that the ceiling price has been increased and specifies in the notice a revised ceiling that shall constitute the ceiling price for performance under this contract. When and to the extent that the ceiling price set forth in the Schedule has been increased, any hours expended and material costs incurred by the Contractor in excess of the ceiling price before the increase shall be allowable to the same extent as if the hours expended and material costs had been incurred after the increase in the ceiling price. (4) Access to records. At any time before final payment under this contract, the Contracting Officer (or authorized representative) will have access to the following (access shall be limited to the listing below unless otherwise agreed to by the Contractor and the Contracting Officer): (i) Records that verify that the employees whose time has been included in any invoice meet the qualifications for the labor categories specified in the contract; (ii) For labor hours (including any subcontractor hours reimbursed at the hourly rate in the schedule), when timecards are required as substantiation for payment- (A) The original timecards (paper-based or electronic); (B) The Contractor ’s timekeeping procedures; (C) Contractor records that show the distribution of labor between jobs or contracts; and (D) Employees whose time has been included in any invoice for the purpose of verifying that these employees have worked the hours shown on the invoices. (iii) For material and subcontract costs that are reimbursed on the basis of actual cost- (A) Any invoices or subcontract agreements substantiating material costs; and (B) Any documents supporting payment of those invoices. (5) Overpayments/Underpayments. Each payment previously made shall be subject to reduction to the extent of amounts, on preceding invoices, that are found by the Contracting Officer not to have been properly payable and shall also be subject to reduction for overpayments or to increasefor underpayments. The Contractor shall promptly pay any such reduction within 30 days unless the parties agree otherwise. The Government within 30 days will pay any such increases, unless the parties agree otherwise. The Contractor ’s payment will be made by check. If the Contractor becomes aware of a duplicate invoice payment or that the Government has otherwise overpaid on an invoice payment, the Contractor shall- (i) Remit the overpayment amount to the payment office cited in the contract along with a description of the overpayment including the- (A) Circumstances of the overpayment (e.g., duplicate payment, erroneous payment, liquidation errors, date(s) of overpayment); (B) Affected contract number and delivery order number, if applicable; (C) Affected line item or subline item, if applicable; and (D) Contractor point of contact. (ii) Provide a copy of the remittance and supporting documentation to the Contracting Officer. (6)(i) All amounts that become payable by the Contractor to the Government under this contract shall bear simple interest from the date due until paid unless paid within 30 days of becoming due. The interest rate shall be the interest rate established by the Secretary of the Treasury, as provided in 41 U.S.C. 7109, which is applicable to the period in which the amount becomes due, and then at the rate applicable for each six month period as established by the Secretary until the amount is paid. (ii) The Government may issue a demand for payment to the Contractor upon finding a debt is due under the contract. (iii) Final Decisions. The Contracting Officer will issue a final decision as required by 33.211 if- (A) The Contracting Officer and the Contractor are unable to reach agreement on the existence or amount of a debt in a timely manner; (B) The Contractor fails to liquidate a debt previously demanded by the Contracting Officer within the timeline specified in the demand for payment unless the amounts were not repaid because the Contractor has requested an installment payment agreement; or (C) The Contractor requests a deferment of collection on a debt previously demanded by the Contracting Officer (see FAR 32.607-2). (iv) If a demand for payment was previously issued for the debt, the demand for payment included in the final decision shall identify the same due date as the original demand for payment. (v) Amounts shall be due at the earliest of the following dates: (A) The date fixed under this contract. (B) The date of the first written demand for payment, including any demand for payment resulting from a default termination. (vi) The interest charge shall be computed for the actual number of calendar days involved beginning on the due date and ending on- (A) The date on which the designated office receives payment from the Contractor ; (B) The date of issuance of a Government check to the Contractor from which an amount otherwise payable has been withheld as a credit against the contract debt; or (C) The date on which an amount withheld and applied to the contract debt would otherwise have become payable to the Contractor . (vii) The interest charge made under this clause may be reduced under the procedures prescribed in FAR 32.608-2 in effect on the date of this contract.(viii) Upon receipt and approval of the invoice designated by the Contractor as the \"completion invoice\" and supporting documentation, and upon compliance by the Contractor with all terms of this contract, any outstanding balances will be paid within 30 days unless the parties agree otherwise. The completion invoice, and supporting documentation, shall be submitted by the Contractor as promptly as practicable following completion of the work under this contract, but in no event later than 1 year (or such longer period as the Contracting Officer may approve in writing ) from the date of completion. (7) Release of claims. The Contractor , and each assignee under an assignment entered into under this contract and in effect at the time of final payment under this contract, shall execute and deliver, at the time of and as a condition precedent to final payment under this contract, a release discharging the Government, its officers, agents , and employees of and from all liabilities, obligations, and claims arising out of or under this contract, subject only to the following exceptions. (i) Specified claims in stated amounts, or in estimated amounts if the amounts are not susceptible to exact statement by the Contractor . (ii) Claims, together with reasonable incidental expenses, based upon the liabilities of the Contractor to third parties arising out of performing this contract, that are not known to the Contractor on the date of the execution of the release, and of which the Contractor gives notice in writing to the Contracting Officer not more than 6 years after the date of the release or the date of any notice to the Contractor that the Government is prepared to make final payment, whichever is earlier. (iii) Claims for reimbursement of costs (other than expenses of the Contractor by reason of its indemnification of the Government against patent liability), including reasonable incidental expenses, incurred by the Contractor under the terms of this contract relating to patents. (8) Prompt payment. The Government will make payment in accordance with the Prompt Payment Act ( 31 U.S.C. 3903) and prompt payment regulations at 5 CFR part 1315. (9) Electronic Funds Transfer (EFT). If the Government makes payment by EFT, see 52.212-5(b) for the appropriate EFT clause. (10) Discount. In connection with any discount offered for early payment, time shall be computed from the date of the invoice. For the purpose of computing the discount earned, payment shall be considered to have been made on the date that appears on the payment check or the specified payment date if an electronic funds transfer payment is made .(j) Risk of loss. Unless the contract specifically provides otherwise, risk of loss or damage to the supplies provided under this contract shall remain with the Contractor until, and shall pass to the Government upon:(1) Delivery of the supplies to a carrier, if transportation is f.o.b. origin; or (2) Delivery of the supplies to the Government at the destination specified in the contract, if transportation is f.o.b. destination. (k) Taxes. The contract price includes all applicable Federal, State, and local taxes and duties . (l) Termination for the Government’s convenience. The Government reserves the right to terminate this contract, or any part hereof, for its sole convenience. In the event of such termination, the Contractor shall immediately stop all work hereunder and shall immediately cause any and all of its suppliers and subcontractors to cease work. Subject to the terms of this contract, the Contractor shall be paid an amount for direct labor hours (as defined in the Schedule of the contract) determined by multiplying the number of direct labor hours expended before the effective date of termination by the hourly rate(s) in the contract, less any hourly ratepayments already made to the Contractor plus reasonable charges the Contractor can demonstrate to the satisfaction of the Government using its standard record keeping system that have resulted from the termination. The Contractor shall not be required to comply with the cost accounting standards or contract cost principles for this purpose. This paragraph does not give the Government any right to audit the Contractor ’s records. The Contractor shall not be paid for any work performed or costs incurred that reasonably could have been avoided. (m) Termination for cause. The Government may terminate this contract, or any part hereof, for cause in the event of any default by the Contractor , or if the Contractor fails to comply with any contract terms and conditions, or fails to provide the Government, upon request, with adequate assurances of future performance. In the event of termination for cause, the Government shall not be liable to the Contractor for any amount for supplies or services not accepted, and the Contractor shall be liable to the Government for any and all rights and remedies provided by law. If it is determined that the Government improperly terminated this contract for default, such termination shall be deemed a termination for convenience. (n) Title. Unless specified elsewhere in this contract, title to items furnished under this contract shall pass to the Government upon acceptance , regardless of when or where the Government takes physical possession. (o) Warranty. The Contractor warrants and implies that the items delivered hereunder are merchantable and fit for use for the particular purpose described in this contract. (p) Limitation of liability. Except as otherwise provided by an express warranty, the Contractor will not be liable to the Government for consequential damages resulting from any defect or deficiencies in accepted items. (q) Other compliances. The Contractor shall comply with all applicable Federal, State and local laws, executive orders, rules and regulations applicable to its performance under this contract. (r) Compliance with laws unique to Government contracts. The Contractor agrees to comply with 31 U.S.C. 1352 relating to limitations on the use of appropriated funds to influence certain Federal contracts; 18 U.S.C. 431 relating to officials not to benefit; 40 U.S.C. chapter 37, Contract Work Hours and Safety Standards; 41 U.S.C. chapter 87, Kickbacks ; 41 U.S.C. 4712 and 10 U.S.C. 2409 relating to whistleblower protections; 49 U.S.C. 40118, Fly American; and 41 U.S.C. chapter 21 relating to procurement integrity. (s) Order of precedence. Any inconsistencies in this solicitation or contract shall be resolved by giving precedence in the following order: (1) The schedule of supplies /services. (2) The Assignments, Disputes, Payments, Invoice, Other Compliances, Compliance with Laws Unique to Government Contracts, and Unauthorized Obligations paragraphs of this clause;(3) The clause at 52.212-5. (4) Addenda to this solicitation or contract, including any license agreements for computer software.(5) Solicitation provisions if this is a solicitation. (6) Other paragraphs of this clause. (7) The Standard Form 1449. (8) Other documents, exhibits, and attachments. (9) The specification. (t) [Reserved] (u) Unauthorized Obligations.(1) Except as stated in paragraph (u)(2) of this clause, when any supply or service acquired under this contract is subject to any End User License Agreement (EULA), Terms of Service (TOS), or similar legal instrument or agreement, that includes any clause requiring the Government to indemnify the Contractor or any person or entity for damages, costs, fees, or any other loss or liability that would create an Anti-Deficiency Act violation (31 U.S.C. 1341), the following shall govern:(i) Any such clause is unenforceable against the Government. (ii) Neither the Government nor any Government authorized end user shall be deemed to have agreed to such clause by virtue of it appearing in the EULA, TOS, or similar legal instrument or agreement. If the EULA, TOS, or similar legal instrument or agreement is invoked through an \"I agree\" click box or other comparable mechanism (e.g., \"click-wrap\" or \"browse-wrap\" agreements), execution does not bind the Government or any Government authorized end user to such clause. (iii) Any such clause is deemed to be stricken from the EULA, TOS, or similar legal instrument or agreement.(2) Paragraph (u)(1) of this clause does not apply to indemnification by the Government that is expressly authorized by statute and specifically authorized under applicable agency regulations and procedures.(v) Incorporation by reference. The Contractor ’s representations and certifications, including those completed electronically via the System for Award Management (SAM), are incorporated by reference into the contract.", "chunk_id": 22, "page_no": 30}, {"chunk": "HHSAR Clauses:---352.222-70 Contractor Cooperation in Equal Employment Opportunity Investigations (Dec 2015) 352.239-74 Electronic and Information Technology Accessibility (Dec 2015) Paragraph (c). The Section 508 standards applicable to this contract are: - Must meet WCAG 2.0 A and AA - E101.2 Equivalent Facilitation (Appendix A, Application and Scoping Requirements) - E203 Access to Functionality (Appendix A, Application and Scoping Requirements) - E204 Functional Performance Criteria (Appendix A, Application and Scoping Requirements) - E205 Electronic Content (Appendix A, Application and Scoping Requirements) - 302 Functional Performance Criteria (Appendix C, Functional Performance Criteria and Technical Requirements) - Electronic content must be accessible to HHS acceptance criteria. Checklist for various formats are available at http://508.hhs.gov/, or from the Section 508 Coordinator listed at https://www.hhs.gov/web/section- 508/additional-resources/section-508-contacts/index.html. Materials that are final items for delivery should be accompanied by the appropriate checklist, except upon approval of the Contracting Officer or Representative. - Chapter 6 Support Documentation and Services (Appendix C, Functional Performance Criteria and Technical Requirements)352.232-71 As prescribed in HHSAR 332.7003, use the following clause: Electronic Submission of Payment Requests (a) Definitions. As used in this clause- Payment request means a bill, voucher, invoice, or request for contract financing payment with associated supporting documentation. The payment request must comply with the requirements identified in FAR 32.905(b), \"Content of Invoices\" and the applicable Payment clause included in this contract.(b) Except as provided in paragraph (c) of this clause, the Contractor shall submit payment requests electronically using the Department of Treasury Invoice Processing Platform (IPP) or successor system. Information regarding IPP, including IPP Customer Support contact information, is available at www.ipp.gov or any successor site. (c) The Contractor may submit payment requests using other than IPP only when the Contracting Officer authorizes alternate procedures in writing in accordance with HHS procedures. (d) If alternate payment procedures are authorized, the Contractor shall include a copy of the Contracting Officer's written authorization with each payment request. (END OF CLAUSE)", "chunk_id": 23, "page_no": 31}, {"chunk": "14. Instruction to Quoters---Proposals must be / email: Tiffany.Gates@fda.hhs.gov on or before the RFP closing date of June 10, 2022, 1:00 pm, Eastern Standard Time. Should you have any questions, please submit all your questions to Tiffany Gates via email by June 02, 2022, 1:00 PM ET. Offeror’s proposal MUST state their GSA Schedule Contract Number in the proposal submission.submitted electronically via emailto CS Tiffany Gates---Formatting---Page size 8.5 by 11 inches with 1-inch margins. Paragraphs single spaced. Minimum font size/style 10- point Times New Roman font for Text, 9-point font in the Arial family for Tables, and 8-point font in the Arial family for Graphics. Tables and graphics may be landscape; all other text must be portrait. If the offeror uses a different format (font size, margin, etc.), the government reserves the right to adjust the proposal to fit the parameters of the format as stated in the RFP, and if this results in the proposal exceeding the page limitations in any one area, the government will not consider those excess pages.The below table shows the page limits to which offeror submissions must adhere.Volume---Section---Page limit---Transmittal/Cover Letter---21Section 1:---Executive Summary---1Section 2: Personnel Qualifications Organizational Experience Section 3:---Management Approach and Technical Capabilities---10 N/A 10 N/A", "chunk_id": 24, "page_no": 31}, {"chunk": "Past Performance---Business Proposal---N/A---2Transmittal and Cover Letter---The offeror’s transmittal and cover letter for the proposal must contain the name, phone number, and e- mail address of the person to be contacted concerning any matter related to the solicitation. FDA may, for example, contact that individual to schedule and make arrangements for the offeror’s discussion meetings, if necessary.Include the following information in your proposal1) Unique Entity Identifier (UEI) and Data Universal Numbering System (DUNS) Number---& CAGE Code---2) Company Name mailing address, and website address; 3) Date submitted and proposal expiration date; 4) All of the above-cited information for each entity on the proposed team, if a team isproposed;5) Current GSA Schedule Contract Number appropriate to this Solicitation; 6) Do you have a Government approved accounting system? If so, please identify theagency that approved the system;7) Type of Company (i.e., small business, 8(a), woman owned, veteran owned, etc.) as validated via the System for Award Management (SAM). All offeror must register in SAM located at http://www.sam.gov/;8) Company Point of Contact, Phone and Email address.---The Quoter shall provide contractor-site labor rates for all labor categories proposed for the RFP. Any discounts proposed shall be reflected throughout the pricing spreadsheet. The Government reserves the right to discontinue quotation evaluation for submittal of an incomplete pricing worksheet.A price reduction/discount is hereby requested in accordance with FAR Subpart 8.405-4 ordering procedures.The Period of Performance (POP) for this requirement may extend beyond the Quoter’s current POP on their GSA Schedule contract. Quoters may submit quotations for the entire POP as long as their current GSA Schedule contract covers the requested POP.Submission MUST cite the applicable GSA Schedule contract number in all documents submitted in response to this solicitation.", "chunk_id": 25, "page_no": 32}, {"chunk": "Executive Summary (Volume 1, Section 1)---The offeror should provide an executive summary for the technical proposal. In the executive summary, the offeror should highlight the significant factors of its technical proposal. The executive summary for the technical approach should be no more than 1 page long.In the event that the offeror is planning to propose a teaming, mentor/protégée, or a subcontracting relationship, narrative statements must also be included for the additional organizations, as well as a clear delineation of tasks that they will be expected to support.Technical Proposal (Volume 1, Section 2)---Offeror shall provide a Technical Proposal that addresses the following three evaluation criteria:A. Management Approach and Technical Capabilities,B. Personnel Qualifications, and---C. Organizational Experience---At a minimum, the offeror’s Technical Proposal must discuss:1) The background, objectives, and work requirements of the statement of---work as analyzed by the offeror,2) The proposed methods and techniques for completing each task,3) How each task will be evaluated for full performance and acceptability ofwork from the offeror's viewpoint, with support,4) Any anticipated major difficulties and problem areas, along with potential---recommended approaches for their resolution, and---5) Major logistical considerations.---The Offeror must define their management and technical approach that satisfies the requirements defined in this document. Please include a (1) staffing plan and (2) resumes for key personnel and (3) a description of your current personnel resources for this, which addresses their capabilities and experience relating to the attached Statement of Work. At a minimum, this section of the quote must include:Organizational Structure (Org chart and resource headcountrequired to support the requirement)Identification of roles and specify responsibilities for each roleDefinition of the primary skill set required for each roleDescription of resource planning processes and procedures to support thechanging needs of the environmentDescription and definition of management methods and processes for all", "chunk_id": 26, "page_no": 33}, {"chunk": "types of support activities---Description of resource training, skills development and certification approachDescription of management and status reporting approachesResumes and letters of commitment are required for all proposed staff. Resumesshould be limited to three pages and must include the proposed labor category for the individual.Past Performance (Volume 1, Section 3)---The Offeror shall identify three (3) contracts/task orders with the Federal Government and/or commercial customers that demonstrate recent and relevant past performance. Recent is defined as within the last three years. Relevant is defined as work similar in complexity and magnitude of the work described in this Statement of Work.Include the following information:Project titleDescription of the projectContract numberContract amountGovernment Agency/OrganizationCOTR’s name, address, and phone numberContracting Officer’s name, address, and phone numberContract and, if applicable, task order numberCurrent status, e.g., completed and/or if in progress, start and estimated completion datesDollar value and type of contractName of company being referencedSOW paragraphs that the reference applies toKey personnel (please highlight those individuals who worked on the relevantproject(s) and are also being proposed for this effort.)A brief narrative of why you deem the reference to be relevant to this effortThe Government may also consider information obtained through other sources. Past performance information will be utilized to determine the quality of the contractor’s past performance as it relates to the probability of success of the required effort.", "chunk_id": 27, "page_no": 34}, {"chunk": "Business Proposal (Volume 2)---The Offeror Business Proposal shall be a separate volume from the Technical Proposal. Pricing shall include all anticipated costs to fully perform all objectives as stated in the SOW and solicitation including option year pricing.The Offeror Business Proposal shall be based on their GSA Schedule Labor Rates, utilizing any and all discounts. The Offeror must identify the labor category(s) to be utilized for this effort, a description of the skills and experience per category, and the fixed loaded hourly rate(s) proposed, and any other proposed associated costs, for calculating the proposed cost for this effort. Subcontractor rate information shall also be included, if applicable. List all Other Direct Costs necessary for the performance of this task order.Business Proposals shall include the following:1) An estimated price for each task (per year of effort), tasks organized intothe proposed organization structure.2) All other costs and the reductions or rebates offered.3) The GSA Schedule Contract Access Fee identified as a separate contract line-itemnumber (CLIN).---ESTIMATED LEVEL OF EFFORT (optional, include if desired):The following is a level of effort estimate. This is only an estimate. Offerors are advised to carefully review the requirement in deriving the level of effort they believe necessary in providing their best value proposal. You are not bound to propose these labor categories or quantities, rather you are expected to provide your best solution citing the labor mix and quantity required to accomplish the tasks.Labor Category (examples; customize for your requirement)", "chunk_id": 28, "page_no": 35}, {"chunk": "8- Months---Program Manager---Business Analyst II---System Architect---The estimated hours and total estimated cost per category are for budgeting purposes only. The number of hours actually used for each category may exceed or be less than the estimate by category, as long as the total ceiling price is not exceeded. The Contractor will not be reimbursed for any work performed in excess of the ceiling.15. Evaluation Criteria---Proposals will be reviewed and evaluated in accordance with the evaluation criteria identified below: The first three technical factors: A. Management Approach and Technical Capabilities, B. Personnel Qualifications, and C. Organizational Experience are in descending order of importance / of equal importance and when combined are more important than Past Performance. Past Performance is as important as Price. Sub-factors listed under each factor are of equal importance to each other.The Government may perform a comparative analysis (comparing Offeror’s responses to one another) to select the Offeror that is best suited to fulfill the requirements, based on the offerors’ responses to the f actors outlined in this RFQ and their relative importance.Table 1 – Criteria 1-5 Confidence Ratings---The Government has high confidence that the Offeror understands the requirement, proposes a sound approach, and will be successful in performing the contract with little or no Government intervention.", "chunk_id": 29, "page_no": 35}, {"chunk": "High Confidence---The Government has some confidence that the Offeror understands the requirement, proposes a sound approach, and will be successful in performing the contract with some Government intervention.Some Confidence---The Government has low confidence that the Offeror understands the requirement, proposes a sound approach, or will be successful in performing the contract even with Government intervention.Low Confidence---The Government anticipates selecting the best-suited offeror from initial responses, without engaging in exchanges with offerors. Offerors are strongly encouraged to submit their best technical solutions and price in response to this RFQ.Once the Government determines the offeror that is the best-suited (i.e., the apparent successful offeror), the Government reserves the right to communicate with only that offeror to address any remaining issues, if necessary, and finalize a task order with that offeror. These issues may include technical and price. If the parties cannot successfully address any remaining issues, as determined pertinent at the sole discretion of the Government, the Government reserves the right to communicate with the next best-suited offeror based on the original analysis and address any remaining issues. Once the Government has begun communications with the next best-suited offeror, no further communications with the previous offeror will be entertained until after the task order has been awarded. This process shall continue until an agreement is successfully reached and a task order is awarded.", "chunk_id": 30, "page_no": 36}, {"chunk": "Technical Proposal (Volume 1, Section 2)---A. Management Approach and Technical Capabilities---1. Understanding of the work, including creativity and thoroughness shown in understanding theobjectives of the SOW and specific tasks, and planned execution of the project.2. Evidence of specific methods and techniques for completing each discrete task, to include such items as quality assurance, and customer-service as detailed in the Quality Assurance Plan.3. Ability to address anticipated potential problem areas, and creativity and feasibility of solutions toproblems and future integration of new processes and technology enhancements.---4. Degree to which the offerors quote demonstrates an understanding of logistics, schedule, and anyother miscellaneous issues in which the Government should be aware.5. Quality and effectiveness of the allocation of personnel and resources.---B. Personnel Qualifications---1. The currency, quality and depth of experience of individual personnel in working on similar projects. Similar projects must convey similarity in topic, dollar value, workload, duration, and complexity.2. Quality and depth of education and experience on other projects which may not be similar enoughto include in response to B.1. (Immediately above) but may be relevant.3. The currency, quality and depth of how the Project Director will supervise and coordinate theworkforce.---C. Organizational Experience---1. Evidence that the organization has current capabilities; and for assuring performance of this requirement. Evidence of supporting subcontractors, consultants and business partners will be considered.", "chunk_id": 31, "page_no": 37}, {"chunk": "OGPS IT Infrastructure Examination SOW---2. Appropriate mix and balance of education and training of team members.---D. Past Performance (Optional)---1. The organizations history of successful completion of projects; history of producing high-qualityreports and other deliverables; history of staying on schedule and within budget.2. The quality of cooperation (with each other) of key individuals within your organization, andquality of cooperation and performance between your organization and its clients.---3. The organization’s specific past performance on prior similar efforts specified within this SOW.Business Proposal (Volume 2)---A. Cost/Price---Technical Factors are more important than cost or price. Selection of the firm to perform this task order will be based on the Government’s assessment of the best overall value.Offerors will be evaluated based upon cost/price completeness and accuracy to determine the validity of the price, cost/price realism, cost/price reasonableness, and cost/price risk. Total estimated ceiling price to accomplish the requirement and all of its options will be utilized as a basis for evaluating price. The factors below will be used to assess whether the Offerors' proposal is complete, accurate, and realistic to minimize cost or performance risk.Cost/Price Completeness and Accuracy: The Government will review the cost/ price schedules for completeness and accuracy. A determination will be made as to whether the offeror has properly understood the business proposal instructions and properly completed the cost/price schedules. Changes to the evaluation quantities, blanks or zeros in the pricing columns, and/or mathematical mistakes are subject to clarification for confirmation of the offeror’s intent. The offeror's proposal will be checked for mathematical correctness to include the following:1. Checking arithmetic in all computations.2. Making sure that all prices/costs are summarized correctly.3. Comparing electronic submittals with hard copies; if applicable.A determination will be made regarding whether the cost/price appears unbalanced, either for the total cost/price of the proposal or separately priced line items. An analysis will be made by item, quantity, and year to identify any irregular or unusual pricing patterns. An unbalanced proposal is one that incorporates prices that are less than cost for some items and/or prices that are overstated for other items.Cost/Price Reasonableness: The Offerors are expected to establish a reasonable price relationship between all cost/price elements. An evaluation of the Offerors’ price proposals will be made to determine if they are realistic for the work to be performed, reflect a clear understanding of the requirements, and are consistent with the Technical Proposal. Reasonableness determinations will be made by determining if competition exists, by comparing proposed cost/price with established commercial prices, other contract37", "chunk_id": 32, "page_no": 38}, {"chunk": "OGPS IT Infrastructure Examination SOW---vehicles, and/or by comparing proposed cost/price with the Independent Government Cost Estimate (IGCE). The IGCE is not releasable to the public.16. Basis of Award---Contract award shall be made to the responsible Offeror whose offer, in conforming to this RFP, provides an overall best value to the Government, technical evaluation factors, and cost considered. The Government's objective is to obtain the highest technical quality considered necessary to achieve the project objectives, with a realistic and reasonable cost. Technical evaluation factors are more important than cost. In the event quotes are evaluated as technically equal in quality, price or cost will become a major consideration in selecting the successful Offeror.38", "chunk_id": 33, "page_no": 38}]