[{"child_chunk": "1. REQUISITION NO.PAGE 1 OF---47SOLICITATION/CONTRACT/ORDER FOR COMMERCIAL PRODUCTS AND COMMERCIAL SERVICES---OFFEROR TO COMPLETE BLOCKS 12, 17, 23, 24, & 30---See SCHEDULE---2. CONTRACT NO.3. AWARD/EFFECTIVE DATE---4. ORDER NO.5. SOLICITATION NUMBER---6. SOLICITATION ISSUE DATE---030ADV23R005407-12-2023a. NAME---b. TELEPHONE NO. (No Collect Calls) (202) 707-9335---8. OFFER DUE DATE/LOCAL---", "chunk_id": 1}, {"child_chunk": "7. FOR SOLICITATION---07-27-2023 2pm ESTTIME---Price, Veronica---INFORMATION CALL:EDT---X---9. ISSUED BY---CODE---10. THIS ACQUISITION IS---0300UNRESTRICTED OR---SET ASIDE:% FOR:Contracts and Grants Directorate Library of Congress---WOMEN-OWNED SMALL BUSINESS (WOSB) ELIGIBLE UNDER THE WOMEN-OWNED SMALL BUSINESS PROGRAM---SMALL BUSINESS---HUBZONE SMALL BUSINESS---NAICS:101 Independence Ave. SE LA 325 Washington DC 20540-9411", "chunk_id": 2}, {"child_chunk": "EDWOSB---SERVICE-DISABLED VETERAN-OWNED SMALL BUSINESS---SIZE STANDARD:8(A)11. DELIVERY FOR FOB DESTINA-12. DISCOUNT TERMS---13b. RATING---TION UNLESS BLOCK IS MARKED---13a. THIS CONTRACT IS A RATED ORDER UNDER DPAS (15 CFR 700)---N/A---14. METHOD OF SOLICITATION---SEE SCHEDULE---X---RFQ---IFB---RFP---DELIVERY---941115. DELIVER TO---CODE---16. ADMINISTERED BY---CODE---See Section F for delivery instructions.Contracts & Grants Directorate Library of Congress 101 Independence Ave SE 101 Independence Av SE Washington DC 20540-94119110", "chunk_id": 3}, {"child_chunk": "17a. CONTRACTOR/OFFEROR---CODE---FACILITY CODE---18a. PAYMENT WILL BE MADE BY---CODE---Submit Invoices through https://www.ipp.gov Washington DC 20540---PHONE:FAX:TELEPHONE NO.UEI:EFT:18b. SUBMIT INVOICES TO ADDRESS SHOWN IN BLOCK 18a UNLESS BLOCK BELOW IS CHECKED17b. CHECK IF REMITTANCE IS DIFFERENT AND PUT SUCH ADDRESS IN OFFER---SEE ADDENDUM---See CONTINUATION Page---19. ITEM NO.20.", "chunk_id": 4}, {"child_chunk": "21. QUANTITY---22. UNIT---23. UNIT PRICE---24. AMOUNT---SCHEDULE OF SUPPLIES/SERVICES---(Use Reverse and/or Attach Additional Sheets as Necessary)---See CONTINUATION Page---25. ACCOUNTING AND APPROPRIATION DATA---26. TOTAL AWARD AMOUNT (For Govt. Use Only)---X---X---27a. SOLICITATION INCORPORATES BY REFERENCE FAR 52.212-1, 52.212-4. FAR 52.212-3 AND 52.212-5 ARE ATTACHED. ADDENDA", "chunk_id": 5}, {"child_chunk": "ARE---ARE NOT ATTACHED.27b. CONTRACT/PURCHASE ORDER INCORPORATES BY REFERENCE FAR 52.212-4. FAR 52.212-5 IS ATTACHED. ADDENDAARE---ARE NOT ATTACHED---28. CONTRACTOR IS REQUIRED TO SIGN THIS DOCUMENT AND RETURN _______________ COPIES TO ISSUING OFFICE. CONTRACTOR AGREES TO FURNISH AND DELIVER ALL ITEMS SET FORTH OR OTHERWISE IDENTIFIED ABOVE AND ON ANY ADDITIONAL SHEETS SUBJECT TO THE TERMS AND CONDITIONS SPECIFIED29. AWARD OF CONTRACT: REF. ___________________________________ OFFER DATED ________________________________. YOUR OFFER ON SOLICITATION (BLOCK 5), INCLUDING ANY ADDITIONS OR CHANGES WHICH ARE SET FORTH HEREIN IS ACCEPTED AS TO ITEMS:", "chunk_id": 6}, {"child_chunk": "30a. SIGNATURE OF OFFEROR/CONTRACTOR---31a. UNITED STATES OF AMERICA (SIGNATURE OF CONTRACTING OFFICER)---30b. NAME AND TITLE OF SIGNER (TYPE OR PRINT)---30c. DATE SIGNED---31b. NAME OF CONTRACTING OFFICER (TYPE OR PRINT)---31c. DATE SIGNED---Price, Veronica---STANDARD FORM 1449 Prescribed by GSA - FAR (48 CFR) 53.212---", "chunk_id": 7}, {"child_chunk": "AUTHORIZED FOR LOCAL REPRODUCTION PREVIOUS EDITION IS NOT USABLE---(REV. NOV 2021)030ADV23R0054Table of Contents---SECTION A.....................................................................................................................................................................1A.1 SF 1449 SOLICITATION/CONTRACT/ORDER FOR COMMERCIAL PRODUCTS AND COMMERCIAL SERVICES .....1---SECTION B - SUPPLIES OR SERVICES AND PRICE/COSTS..................................................................................................4B.1 LC52.216-3 CONTRACT TYPE (JUN 2016) ...........................................................................................................4B.2 LC52.212-2 SUPPLEMENTAL LICENSE AGREEMENTS (JUL 2017) .......................................................................4B.3 PRICE/COST SCHEDULE........................................................................................................................................4ITEM INFORMATION ...........................................................................................................................................4SECTION C - DESCRIPTION/SPECIFICATIONS/STATEMENT OF WORK..............................................................................7SECTION F - DELIVERIES OR PERFORMANCE ..................................................................................................................5F.1 DELIVERY SCHEDULE ............................................................................................................................................5SECTION G - CONTRACT ADMINISTRATION DATA ..........................................................................................................6G.1 LC52.201-3 CONTRACT ADMINISTRATION (AUG 2015).....................................................................................6G.2 LC52.232-1 LIBRARY OF CONGRESS INVOICE INSTRUCTIONS (DEC 2022).........................................................7G.3 LC52.232-2 SCHEDULE OF PAYMENTS (JUN 2015) ............................................................................................7SECTION H - SPECIAL CONTRACT REQUIREMENTS..........................................................................................................9", "chunk_id": 8}, {"child_chunk": "H.1 LC52.201-1 CONTRACTING OFFICER'S REPRESENTATIVE (COR) APPOINTMENT AND AUTHORITY (JAN 2016) 9---H.2 LC52.203-1 CONTRACTOR PUBLICITY (OCT 2013) .............................................................................................9H.3 LC52.204-1 COLLECTIONS SECURITY (DEC 2013).............................................................................................10H.4 LC52.204-3 INFORMATION SYSTEMS SECURITY (SEP 2018) ............................................................................10H.5 LC52.204-4 CONTRACTOR EMPLOYEE FITNESS (JAN 2022).............................................................................10H.6 LC52.209-1 CONFLICTS OF INTEREST (OCT 2013)............................................................................................11H.7 LC52.239-1 INFORMATION SECURITY (APR 2021)...........................................................................................12H.8 LC52.239-3 ASSESSMENT AND AUTHORIZATION (JAN 2016)..........................................................................13H.9 LC52.239-4 SECTION 508 COMPLIANCE (JAN 2015)........................................................................................14H.10 LC52.237-1 KEY PERSONNEL (AUG 2014) ......................................................................................................14PART II - CONTRACT CLAUSES .....................................................................................................................................15SECTION I - CONTRACT CLAUSES ................................................................................................................................15I.1 52.252-2 CLAUSES INCORPORATED BY REFERENCE (FEB 1998).......................................................................15I.2 52.212-5 CONTRACT TERMS AND CONDITIONS REQUIRED TO IMPLEMENT STATUTES OR EXECUTIVE ORDERS—COMMERCIAL PRODUCTS AND COMMERCIAL SERVICES (JUN 2023).....................................................15I.3 52.217-8 OPTION TO EXTEND SERVICES (NOV 1999) ........................................................................................21I.4 52.217-9 OPTION TO EXTEND THE TERM OF THE CONTRACT (MAR 2000) .......................................................22", "chunk_id": 9}, {"child_chunk": "Page 2---030ADV23R0054I.5 52.227-18 RIGHTS IN DATA—EXISTING WORKS (DEC 2007)............................................................................22I.6 LC52.212-4 CONTRACT TERMS AND CONDITIONS - COMMERCIAL ITEMS (DEV) (FEB 2016) ...........................22I.7 LC52.212-5 CONTRACT TERMS AND CONDITIONS REQUIRED TO IMPLEMENT STATUTES OR EXECUTIVE ORDERS - COMMERCIAL ITEMS (DEV) (MAY 2015) .................................................................................................23I.8 LC52.232-25 PROMPT PAYMENT (DEV) (JUL 2013) ..........................................................................................23I.9 LC52.233-1 52.233-1 (DEV) DISPUTES (MAY 2014)...........................................................................................23PART III - LIST OF DOCUMENTS, EXHIBITS AND OTHER ATTACHMENTS ........................................................................24SECTION J - LIST OF ATTACHMENTS .............................................................................................................................24PART IV - REPRESENTATIONS AND INSTRUCTIONS.....................................................................................................25", "chunk_id": 10}, {"child_chunk": "SECTION K - REPRESENTATIONS, CERTIFICATIONS AND OTHER STATEMENTS OF OFFERORS .......................................25---K.1 52.212-3 OFFEROR REPRESENTATIONS AND CERTIFICATIONS—COMMERCIAL PRODUCTS AND COMMERCIAL SERVICES (DEC 2022)........................................................................................................................25SECTION L - INSTRUCTIONS, CONDITIONS, AND NOTICES TO OFFERORS ......................................................................40L.1 LC52.215-3 PROPOSAL SUBMISSION INSTRUCTIONS – LOW PRICE TECHNICALLY ACCEPTABLE (JUL 2016) ...40SECTION M - EVALUATION FACTORS FOR AWARD .......................................................................................................41M.1 LC52.233-2 PROTESTS TO THE LIBRARY OF CONGRESS (DEC 2013) ...............................................................41M.2 LC52.215-4 EVALUATION – LOW PRICE TECHNICALLY ACCEPTABLE (JUL 2016) ............................................41", "chunk_id": 11}, {"child_chunk": "Page 3---030ADV23R0054Section B---SECTION B - SUPPLIES OR SERVICES AND PRICE/COSTS---B.1 LC52.216-3 CONTRACT TYPE (JUN 2016)This is a Firm-Fixed-Price contract.(End of Clause)---B.2 LC52.212-2 SUPPLEMENTAL LICENSE AGREEMENTS (JUL 2017)The Library does not agree to licensing agreements or any other provisions that attempt to: (1) replace an order as the governing contract; (2) establish new or supplemental payment terms; or, (3) affect the legal relationships of the parties. Notwithstanding any clauses in this contract or order, or the contractual vehicles against which the order is placed, that establish order of precedence, the rights and obligations provided by this contract or order take precedence over the rights and obligations set forth in any licensing agreements provided to the Library.The Library’s incorporation of a licensing agreement into this contract or order excludes all terms of the licensing agreement that contravene, modify or conflict with the terms of 36 C.F.R. 701.7 available at: https://www.ecfr.gov/cgi- bin/text-idx?SID=87a865ce2bd109313a951a3d477895d8&mc=true&node=se36.3.701_17&rgn=div8.", "chunk_id": 12}, {"child_chunk": "(End of Clause)---B.3 PRICE/COST SCHEDULE---ITEM INFORMATION---ITEM NUMBER---DESCRIPTION OF SUPPLIES/SERVICES---QUANTITY---UNIT---UNIT PRICE---AMOUNT---00011.00YR---_______________ __________________ ___Technical support of Progress OpenEdge software for the Library Archival System (LAS). Contract Period: Base POP Begin: 08-28-2023 POP End: 08-27-2024 Not to exceed 125 hours of support00021.00EA _______________ __________________ ___Development licenses required to provide technical support for version 11.3.3 of Progress OpenEdge. Contract Period: Base POP Begin: 08-28-2023 POP End: 08-27-2024 4GL Linux", "chunk_id": 13}, {"child_chunk": "Page 4---030ADV23R0054Section B---0003325.00HR---_______________ __________________ ___OPTIONAL BASE YEAR TASK 1: Progress OpenEdge Software Perpetual Licenses Contract Period: Base POP Begin: 08-28-2023 POP End: 08-27-2024 Upgrade from version 11.3.3 of Progress OpenEdge Software00041.00LOT---_______________ __________________ ___OPTIONAL BASE YEAR TASK 2: Additional Technical Support for Progress OpenEdge software for the Library Archival System (LAS). Contract Period: Base POP Begin: 08-28-2023 POP End: 08-27-2024 Not to exceed 325 hours of support00051.00", "chunk_id": 14}, {"child_chunk": "LOT---_______________ __________________ ___OPTION YEAR 1: Technical support of Progress OpenEdge software for the Library Archival System (LAS). Contract Period: Option 1 POP Begin: 08-28-2024 POP End: 08-27-2025 Not to exceed125 hours of support00061.00LOT---_______________ __________________ ___OPTION YEAR 1: Development licenses required to provide technical support for version 11.3.3 of Progress OpenEdge. Contract Period: Option 1 POP Begin: 08-28-2024 POP End: 08-27-2025 4GL Linux0007325.00", "chunk_id": 15}, {"child_chunk": "HR---_______________ __________________ ___OPTIONAL OPTION YEAR 1 TASK: Additional Technical Support for Progress OpenEdge software for the Library Archival System (LAS). Contract Period: Option 1 POP Begin: 08-28-2024Page 5---030ADV23R0054Section B---POP End: 08-27-2025 Not to exceed 325 hours of SupportGRAND TOTAL---_______________ ___Page 6---030ADV23R0054", "chunk_id": 16}, {"child_chunk": "Section C---SECTION C - DESCRIPTION/SPECIFICATIONS/STATEMENT OF WORK---C.1. OVERVIEW / BACKGROUND.The Library of Congress (LOC or the Library) and other large academic Libraries store a large portion of their important collections off site in high-density storage facilities (HDSF). High-density library storage facilities require digital inventory systems to manage, track and identify their inventory of collection items with rigorous accuracy, operational efficiency, and absolute reliability. These facilities manage millions of collections items of diverse formats and must support a high volume of transactions to ingest new materials and respond to requests for materials. Special inventory management software (IMS) is needed to manage the process of sending materials to the HDSF initially, as well as tracking the materials during circulation", "chunk_id": 17}, {"child_chunk": "inventory management software (IMS) is needed to manage the process of sending materials to the HDSF initially, as well as tracking the materials during circulation process until they are returned to their original location.The IMS software currently used across these LOC facilities is called the Library Archival System (LAS). This software was originally designed and built in the early 1990’s by Generation Fifth Applications for Harvard University and various versions have been implemented at the LOC.LAS was built using the Progress RDBMS (now OpenEdge), a product of Progress Software Corporation. The core application was written in the OpenEdge Advanced Business Language and run on a Linux platform. The interfaces for LAS are deployed through text-based menus and commands, using a secure shell connection to the", "chunk_id": 17}, {"child_chunk": "Advanced Business Language and run on a Linux platform. The interfaces for LAS are deployed through text-based menus and commands, using a secure shell connection to the institution’s instance of the application.The Library seeks interim support for technical services to maintain the existing installed version of Progress OpenEdge and ensure its continued operational until the new IMS is implemented (within 1 to 2 years).C.2. SCOPE The contractor shall provide the following for a 12-month base year and one 12-month option year:1. Provide interim technical support of Progress OpenEdge software for the Library Archival System. 2. Provide any development licenses required to provide technical support for the currently installed version", "chunk_id": 17}, {"child_chunk": "11.3.3 of Progress OpenEdge software.---C.3. REQUIREMENTS---C.3.1. The Library currently has a perpetual license for its current version of Progress 11.3.3. The contractor will provide any other development licenses required to provide technical support for this version of Progress.C.3.2. The Contractor shall provide up to 125 hours, but not to exceed, support for the LAS system’s ProgressOpenEdge based software and database. The services covered under this task include:C.3.2.1. Respond to calls to resolve technical issues that may arise. C.3.2.2. Perform maintenance and install security patches as needed. C.3.2.3. Troubleshoot and provide break/fix support for ad-hoc issues as they arise.", "chunk_id": 18}, {"child_chunk": "Page 7---030ADV23R0054Section C---C.3.2.4 Technical Support Hours---Progress OpenEdge Technical Support Hours are initiated by the COR designated in Section G via email to the contractor’s designated account manager. Once a Technical Support Technician has been assigned, work shall begin and be invoiced in arrears on a monthly basis. Technical Support Services shall be performed remotely, not on LOC premises. Technical Support Hours are capped at 125 hours (i.e., 125 hours is the ceiling the contractor cannot exceed pursuant to FAR 52.212-4, alt. 1 (i)). The Contractor’s account manager shall notate hours used and remaining on each invoice. Should Technical Support Hours not be", "chunk_id": 19}, {"child_chunk": "alt. 1 (i)). The Contractor’s account manager shall notate hours used and remaining on each invoice. Should Technical Support Hours not be used, the line-item amount shall be de-obligated from the contract.C.3.3. Any changes to LAS must be approved by the COR following internal Library approvals and must be incompliance with Library IT security and collections security clauses listed in Section H.C.3.4. OPTIONAL BASE YEAR TASK 1: Progress OpenEdge software Upgrade, that will only be executed if the softwareis needed.C.3.4.1. The contractor shall install the latest compatible version of Progress OpenEdge to upgrade the Libraryfrom the currently installed version, which is", "chunk_id": 19}, {"child_chunk": "The contractor shall install the latest compatible version of Progress OpenEdge to upgrade the Libraryfrom the currently installed version, which is 11.3.3.C.3.5. OPTIONAL BASE YEAR TASK 2: Additional 325 hours of technical support services for Progress OpenEdge, thatwill only be executed if the support is needed, to include the following:C.3.5.1. The contractor shall install the latest compatible version of Progress OpenEdge if executed in Optional", "chunk_id": 19}, {"child_chunk": "Base Task 1.---C.3.5.2. Provide database support in the event of a database failure or if current built-in reports and queries failto run.C.3.5.3. Provide programing support for LAS OpenEdge application. C.3.5.4. Provide remote technical support (troubleshooting) on as needed basis. C.3.5.5. Provide assistance to create and modify data exports to extract data as needed.", "chunk_id": 20}, {"child_chunk": "C.3.5.6. Additional Technical Support Hours---Progress OpenEdge Additional Technical Support Hours are initiated by the COR designated in Section G via email to the contractor’s designated account manager. Once a Technical Support Technician has been assigned, work shall begin and be invoiced in arrears on a monthly basis. Technical Support Services shall be performed remotely, not on LOC premises. Technical Support Hours are capped at 325 hours (i.e., 325 hours is the ceiling the contractor cannot exceed pursuant to FAR 52.212-4, alt. 1 (i)). The Contractor’s account manager shall notate hours used and remaining on each invoice. Should Technical Support Hours not be used, the line-item amount shall be de-obligated from the contract.C.3.6. OPTIONAL OPTION YEAR 1 TASK: Additional 325 hours of technical support services for Progress OpenEdge,that will only be executed if the support is needed, to include the following:C.3.6.1. Provide database support in the event of a database failure or if current built-in reports and queries failto run.C.3.6.2. Provide programing support for LAS OpenEdge application. C.3.6.3. Provide remote technical support (troubleshooting) on as needed basis. C.3.6.4. Provide assistance to create and modify data exports to extract data as needed.", "chunk_id": 21}, {"child_chunk": "Page 2---030ADV23R0054Section C---C.3.6.5. Additional Technical Support Hours---Progress OpenEdge Additional Technical Support Hours are initiated by the COR designated in Section G via email to the contractor’s designated account manager. Once a Technical Support Technician has been assigned, work shall begin and be invoiced in arrears on a monthly basis. Technical Support Services shall be performed remotely, not on LOC premises. Technical Support Hours are capped at 325 hours (i.e., 325 hours is the ceiling the contractor cannot exceed pursuant to FAR 52.212-4, alt. 1 (i)). The Contractor’s account manager shall notate hours used and remaining on each invoice. Should Technical Support Hours not be used, the line-item amount shall be de-obligated from the contract.", "chunk_id": 22}, {"child_chunk": "C.4 CONTRACT PERFORMANCE---C.4.1 SCHEDULE OF EVENTS/DELIVERABLES---SOW reference---Description of Event/Deliverable---Due dates---C.3.1.Provide development licenses needed to provide technical supportStart of BASE YEAR of Performance.---C.3.2Provide LAS technical support up to 125 hours.---Technical Support Hours to be initiated by COR during BASE Period of Performance.C.3.4", "chunk_id": 23}, {"child_chunk": "Progress OpenEdge software Upgrade---Upon execution of Optional Task.---C.3.5Additional 325 hours of technical support services for Progress OpenEdge during BASE.---Additional Technical Support Hours to be initiated by COR following execution of Option Task during Optional task period of performance.C.3.1.Provide development licenses needed to provide technical support", "chunk_id": 24}, {"child_chunk": "Start of OPTION YEAR 1 Period of Performance.---C.3.2Provide LAS technical support up to 125 hours.---Technical Support Hours to be initiated by COR during BASE YEAR of Performance.C.3.6Additional 325 hours of technical support services for Progress OpenEdge during BASE.---Additional Technical Support Hours to be initiated by COR following execution of Option Task during Optional task period of performance.C.4.2 Place of Performance. The work for this contract shall be performed at the contractor’s facilities.", "chunk_id": 25}, {"child_chunk": "Page 3---030ADV23R0054Section C---C.4.3 Hours of Operation.---The Contractor shall be available for technical support from 8:00am to 5:00pm EST, Monday thru Friday, except Federal holidays or when the Library is closed for administrative reasons. If the contractor shall notify the COR of any changes in contractor availability such as administrative closings or recognized holidays.C.4.4 Government Furnished Property. The Library shall provide the contractor with systems access upon award.C.5 ADDITIONAL INFORMATION C.5.1 Rights in Data The Library obtains unlimited rights to use data produced under this contract in accordance with FAR 52.227-14 and retains ownership and all rights in Library owned or created data uploaded or otherwise added to Progress OpenEdge products or shared with vendor pursuant to any technical support services.", "chunk_id": 26}, {"child_chunk": "(End of Statement of Work)---Page 4---030ADV23R0054Section F---SECTION F - DELIVERIES OR PERFORMANCE---F.1 DELIVERY SCHEDULE---ITEM NUMBER---QUANTITY DELIVERY DATE---00011.0000021.000003325.0000041.0000051.0000061.000007325.00Page 5---030ADV23R0054Section G---SECTION G - CONTRACT ADMINISTRATION DATA---G.1 LC52.201-3 CONTRACT ADMINISTRATION (AUG 2015)This contract will be administered by:Library Contracting Officer: Price, Veronica---Address: Contracts & Grants Directorate---", "chunk_id": 27}, {"child_chunk": "Library of Congress---101 Independence Ave SE---Washington DC 20540-9411---Phone: (202) 707-9335Email: vprice@loc.gov---Library Contract Specialist: Leonhardt, Riley---Address: Contracts & Grants Directorate---Library of Congress---101 Independence Ave SE---Washington DC 20540-9411---Phone: (202) 707-0714Email: rleonhardt@loc.gov---Library Contracting Officer Representative:---Address: Provided at time of awardProvided at time of awardProvided at time of awardProvided at time of awardProvided at time of award", "chunk_id": 28}, {"child_chunk": "Phone:---Email:---Page 6---030ADV23R0054Section G---Contractor Contract Administrator: Provided at time of awardAddress: Provided at time of awardProvided at time of awardProvided at time of awardProvided at time of awardPhone:---Email:---G.2 LC52.232-1 LIBRARY OF CONGRESS INVOICE INSTRUCTIONS (DEC 2022)The Contractor must prepare and submit invoices electronically to: https://www.ipp.gov. The Contractor may submit payment requests using other than electronic means only when alternate procedures are authorized by the contracting officer in writing. Assistance is available via the IPP Help Desk via email at: ippcustomersupport@fiscal.treasury.gov or by commercial telephone at (866) 973-3131. Invoices shall contain the information required in FAR 52.212-4, paragraph (g).", "chunk_id": 29}, {"child_chunk": "(End of Clause)---G.3 LC52.232-2 SCHEDULE OF PAYMENTS (JUN 2015)The contractor must submit invoices for payment upon delivery of the items or successful performance of the events identified below pursuant to the standards and acceptance criteria defined in this contract.CLIN---Item Description---Payment Due Date---", "chunk_id": 30}, {"child_chunk": "Amount---0001BASE: Technical support of Progress OpenEdge software for the Library Archival System (LAS). (125 Hours)Invoiced hours worked per month based on hourly rate in CLIN. Payment within 30 days of receipt and acceptance of invoice by COR.$ Per hour---$ for a maximum total of 125 hours.---0002BASE: Development licenses required to provide technical support for version 11.3.3 of Progress OpenEdge.", "chunk_id": 31}, {"child_chunk": "Within 30 days of receipt and acceptance of invoice by COR.---$BASE TOTAL---$0003OPTIONAL BASE TASK 1: Progress OpenEdge Software Perpetual Licenses---Within 30 days of receipt and acceptance of invoice by COR.---$0004OPTIONAL BASE TASK 2: Additional Technical Support for Progress OpenEdge software for the LibraryInvoiced hours worked per month based on hourly rate in CLIN. Payment within 30 days of receipt and acceptance of", "chunk_id": 32}, {"child_chunk": "$ Per hour---$ for a maximum total---Page 7---030ADV23R0054Section G---Archival System (LAS) (325 hours)---invoice by COR.---of 325 hours.---BASE OPTIONAL TASKS TOTAL---$BASE + OPTIONAL BASE TASKS TOTAL $0005OPTION YEAR 1: Technical support of Progress OpenEdge software for the Library Archival System (LAS). (125 Hours)Invoiced hours worked per month based on hourly rate in CLIN. Payment within 30 days of receipt and acceptance of invoice by COR.", "chunk_id": 33}, {"child_chunk": "$ Per hour---$ for a maximum total of 125 hours.---0006OPTION YEAR 1: Development licenses required to provide technical support for version 11.3.3 of Progress OpenEdge.Within 30 days of receipt and acceptance of invoice by COR.---$OPTION YEAR 1 TOTAL---$0007OPTIONAL OPTION YEAR 1 TASK: Additional Technical Support for Progress OpenEdge software for the Library Archival System (LAS). (325 hours)Invoiced hours worked per month based on hourly rate in CLIN. Payment within 30 days of receipt and acceptance of invoice by COR.", "chunk_id": 34}, {"child_chunk": "$ Per hour---$ for a maximum total of 325 hours.---OPTION YEAR 1 OPTIONAL TASKS TOTAL---$OPTION YEAR 1 + OPTIONAL OPTION YEAR 1 TASKS TOTAL $CONTRACT TOTAL $(End of Clause)---Page 8---030ADV23R0054Section H---SECTION H - SPECIAL CONTRACT REQUIREMENTS---H.1 LC52.201-1 CONTRACTING OFFICER'S REPRESENTATIVE (COR) APPOINTMENT AND AUTHORITY (JAN 2016)(a) Performance of work under this contract is subject to the technical direction of the COR. The term “technical direction” includes, without limitation, direction to the contractor that directs or redirects the labor effort, shifts the work between work areas or locations, and/or fills in details and otherwise serves to ensure that tasks outlined in the contract are accomplished satisfactorily.(b) Technical direction must be within the scope of the contract specification(s)/work statement. The COR does not have authority to issue technical direction that:", "chunk_id": 35}, {"child_chunk": "(1) Constitutes additional work outside the contract specification(s)/work statement;---(2) Constitutes a change as defined in the “Changes” clause of this contract;(3) Causes an increase or decrease in the contract price, or the time required for contract performance;(4) Changes any of the terms, conditions, or specification(s)/work statement of the contract;(5) Interferes with the contractor's right to perform under the terms and conditions of the contract; or(6) Directs, supervises or otherwise controls the actions of the contractor's employees.(c) Technical direction may be oral or in writing. The COR must confirm oral direction in writing within five workdays, with a copy to the Contracting Officer.(d) The Contractor shall proceed promptly with performance resulting from the technical direction issued by the COR. If, in the opinion of the contractor, any direction of the COR or the designated representative falls within the limitations of (b) above, the contractor shall immediately notify the Contracting Officer no later than the beginning of the next Government work day.(e) Failure of the Contractor and the Contracting Officer to agree that technical direction is within the scope of the contract shall be subject to the terms of the “Disputes” clause of this contract.", "chunk_id": 36}, {"child_chunk": "(End of Clause)---H.2 LC52.203-1 CONTRACTOR PUBLICITY (OCT 2013)The Contractor, or any entity or representative acting on behalf of the Contractor, may not refer to the equipment or services furnished pursuant to the provisions of this contract in any news release or commercial advertising, or in connection with any news release or commercial advertising, without first obtaining explicit written consent to do so from the Contracting Officer. Should any reference to such equipment or services appear in any news release or commercial advertising issued by or on behalf of the Contractor without the required consent, the Government will consider institution of all remedies available under applicable law.", "chunk_id": 37}, {"child_chunk": "(End of Clause)---Page 9---030ADV23R0054Section H---H.3 LC52.204-1 COLLECTIONS SECURITY (DEC 2013)(1) The Library is a public institution responsible for making its resources (collections and staff) available to the Congress and the American people. To achieve a balance between access and security, the Library requires everyone (staff, visitors, interns, contractors, etc.), to always use due diligence and protect its assets during use.(2) Physical access to Library collections is limited to staff and/or determined by the host office. In addition, established requesting processes in the various readings rooms must be followed.(3) Loan Privileges. Contractor employees may obtain loans of Library property for internal", "chunk_id": 38}, {"child_chunk": "addition, established requesting processes in the various readings rooms must be followed.(3) Loan Privileges. Contractor employees may obtain loans of Library property for internal use and Library work- related purposes.i. Loan of Library Property. All loans of Library property must be approved and documented by the host Library Services office. Contractor staff shall obtain a Library “General Pass” (Form LW 12/54 (rev2/88)) for each loan.ii. Liability – Loss or Damage of Library Property. Use or loan of all Library property and signature on this contract means that the contractor acknowledges and agrees to:(a) ensure the return all Library property issued in the same condition as borrowed;(b) accept responsibility and liability for the negligent loss or damage of issued", "chunk_id": 38}, {"child_chunk": "ensure the return all Library property issued in the same condition as borrowed;(b) accept responsibility and liability for the negligent loss or damage of issued or borrowed Library property; and(c) ensure that the loaned property is used for Library purposes and not loaned to any other person.", "chunk_id": 38}, {"child_chunk": "(End of Clause)---H.4 LC52.204-3 INFORMATION SYSTEMS SECURITY (SEP 2018)(1) Computer Security Policy. The Library requires anyone using or accessing its digital assets (including networks, servers, workstations, systems, data, web pages, and email) to protect them and use them only for official business, and only in accordance with Library regulations and applicable Library bargaining agreements. Unauthorized or inappropriate use may be grounds for termination or other contractual remedy.(2) Privacy Policy. No one has the right to privacy while using any Library computer system, including internet or email services. Usage may be monitored.(3) Level of Access. The Host Office will determine the level of access to the Library’s IT equipment, staff and software needed to successfully perform under this Contract. Access may include, for example, email, word processing, internet, and intranet.(4) Mandatory IT Security Training. Contractor personnel must successfully complete mandatory information systems security training prior to use of or access to any of the Library’s digital assets. The required training is available online at http://www.loc.gov/extranet/cld/. Contractor staff with access to Library digital assets shall complete the information systems security training annually. The training is available on the Library intranet at: http://www.loc.gov/staff/cld/.", "chunk_id": 39}, {"child_chunk": "(End of Clause)---H.5 LC52.204-4 CONTRACTOR EMPLOYEE FITNESS (JAN 2022)“Contractor employee fitness” means fitness based on character and conduct for work for or on behalf of the Government as a contractor employee.Work under this contract is unclassified. However, the Library of Congress has a contractor employee fitness program, which includes background investigations of contractor personnel who will have 1) regular, ongoing, unescorted access to the Library’s buildings, grounds, or collections, 2) access to Library information technology systems, and/or 3) access", "chunk_id": 40}, {"child_chunk": "Page 10---030ADV23R0054Section H---to Library information not available to the public including information determined to be Controlled Unclassified Information (CUI) to ensure they meet basic standards of honesty and trustworthiness pursuant to Library regulations.(1) Any access to non-public Library facilities and information technology systems will require completion and successful vetting of a security application request (release forms, fingerprints, and, if applicable, E-QIP background investigation). Contracts should anticipate a minimum of two weeks for the process, provided no adverse or incomplete information is received.(2) The Library does not determine the fitness of employees to work for the contractor firm that hires them. The Library’s interest is in determining whether contractor personnel should be granted greater", "chunk_id": 41}, {"child_chunk": "not determine the fitness of employees to work for the contractor firm that hires them. The Library’s interest is in determining whether contractor personnel should be granted greater access than the general public to Library facilities, Library information technology systems and/or non-public Library information.(3) To facilitate the fitness determination, contractors shall submit complete and accurate information as identified on the e-qip site at: www.opm.gov/e-qip. Contractors should anticipate a minimum of two weeks for the process, provided all requested information is timely, accurate and complete and that no adverse information is received.(4) The contractor will ensure the Library’s Personnel Security Division is notified of all changes to personnel performing work on this contract. The Personnel Security Division can be notified at the following email", "chunk_id": 41}, {"child_chunk": "the Library’s Personnel Security Division is notified of all changes to personnel performing work on this contract. The Personnel Security Division can be notified at the following email address: PSD@loc.gov and contacted via phone at: (202) 707-5618.(5) The fact that the Library may conduct background investigations on assigned contractor personnel does not relieve the contractor of the responsibility to provide qualified, reliable personnel of sound character and conduct.(6) The Library may require removal of contractor staff from Library facilities and revocation of access to Library information technology systems and non-public Library information if investigative results raise concerns regarding a contractor employee’s fitness. In such cases, the Contracting Officer or Contracting Officer Representative (COR) will notify the contractor of the unfit determination", "chunk_id": 41}, {"child_chunk": "a contractor employee’s fitness. In such cases, the Contracting Officer or Contracting Officer Representative (COR) will notify the contractor of the unfit determination and need for the contractor employee to return all government equipment such as badges, keys and network tokens if issued. Contractor management staff may be required to escort the contractor employee from the premises.", "chunk_id": 41}, {"child_chunk": "(End of Clause)---H.6 LC52.209-1 CONFLICTS OF INTEREST (OCT 2013)The services required in performance of this contract involve access to non-public information and/or services that are closely associated with the performance of inherently governmental functions that may result in conflicts of interest related to this contract, other contracts, or future contracts for which the contractor may intend to compete. Federal Acquisition Regulation subpart 9.5 describes circumstances and provides illustrative examples of circumstances that may give rise to conflicts of interest.The Contractor must identify to the contracting officer any conflicts of interest, actual or potential, that may reasonably be expected to arise in performance of this contract. The contractor must provide a detailed written description of the conflict", "chunk_id": 42}, {"child_chunk": "interest, actual or potential, that may reasonably be expected to arise in performance of this contract. The contractor must provide a detailed written description of the conflict of interest and a plan explaining any and all steps the Contractor will undertake to avoid or mitigate the conflict. Failure to disclose actual or potential conflicts of interest may subject the Contractor to corrective action including but not limited to termination of this contract, debarment of the contractor, and/or other appropriate civil or criminal actions.It is solely within the discretion of the Library to determine whether or not a conflict of interest exists and whether any mitigation plan submitted by the Contractor mitigates a conflict.", "chunk_id": 42}, {"child_chunk": "Page 11---030ADV23R0054Section H---The Contractor shall include this clause in all subcontracts, consultant agreements, and lower tier subcontracts unless a waiver is granted by the Contracting Officer.(End of Clause)---H.7 LC52.239-1 INFORMATION SECURITY (APR 2021)The work to be conducted is considered Controlled Unclassified Information (CUI) pursuant to National Institute of Standards and Technology (NIST) Special Publication (SP) 800-53 (rev 4) or current version. The Contractor shall ensure that all non-public Library information processed under this contract shall be protected from unauthorized use and mishandling by the Contractor. Information includes both hard copy (paper) formats and", "chunk_id": 43}, {"child_chunk": "Library information processed under this contract shall be protected from unauthorized use and mishandling by the Contractor. Information includes both hard copy (paper) formats and soft copy (stored in electronic form, e.g., hard disks, tapes, flash drives, CD-ROM/CD-R, etc.)(a) The Contractor shall store hard copies and soft copies contained on removable media (e.g., tapes, floppy disks, flash drives, CD-ROM/CD-R, etc.) in a government-approved storage container per the direction of the Contracting Officer Representative (COR) or the Library of Congress Project Manager when not under the direct control of Contractor Key Personnel.(b) The Contractor shall treat any information developed on security vulnerabilities and any Government provided non- public information as", "chunk_id": 43}, {"child_chunk": "under the direct control of Contractor Key Personnel.(b) The Contractor shall treat any information developed on security vulnerabilities and any Government provided non- public information as “CUI”.(c) The Contractor personnel shall label and protect this information as “Security Category: Moderate”, placing this designation in the footer.(d) The Contractor shall ensure that all documents designated “Security Category: Moderate”, “Security Category: High” and “Limited Official Use Only” are not emailed to or from an external email system. These documents may only be emailed between Library of Congress email accounts, or within a secured corporate email network.(e) The Contractor shall ensure that all documents designated “Security Category: Moderate”, “Security Category: High” and “Limited Official Use Only”", "chunk_id": 43}, {"child_chunk": "The Contractor shall ensure that all documents designated “Security Category: Moderate”, “Security Category: High” and “Limited Official Use Only” are shredded, burned, or otherwise destroyed before being disposed of in accordance with applicable corporate and federal records management policies.(f) The Contractor shall dispose of all documents designated “Security Category: Moderate”, “Security Category: High” and “Limited Official Use Only” remaining in the Contractor’s possession at the end of the contract term.(g) The Contractor shall ensure that all Contractor workstations used to process Library information utilizes anti-virus and anti-spyware utilities that are configured to continuously monitor and to automatically update as well as having automatic operating system patching in place.(h) The Contractor shall ensure that all Contractor", "chunk_id": 43}, {"child_chunk": "are configured to continuously monitor and to automatically update as well as having automatic operating system patching in place.(h) The Contractor shall ensure that all Contractor workstations used to process Library information employ a firewall that can either be software running on the workstation or a stand-alone firewall that protects the workstation from unauthorized access from any other devices, including devices on the Contractor’s corporate network.(i) The Contractor shall ensure that all Library information that is labeled “Security Category: Moderate”, “Security Category: High” and “Limited Official Use Only” is encrypted using a Federal Information Processing Standards Publication (FIPS) 140-2 validated application configured in FIPS mode. This includes information stored on internal hard drives and removable devices (e.g.,", "chunk_id": 43}, {"child_chunk": "140-2 validated application configured in FIPS mode. This includes information stored on internal hard drives and removable devices (e.g., CD-Rs, flash drives, etc.)(j) The Contractor must provide a written list of anti-virus, anti-spyware, firewall, encryption products, versions and proof of licenses, along with the automatic operating system patching status, MAC address (if applicable) and user name for each system being used to process Library information.", "chunk_id": 43}, {"child_chunk": "Page 12---030ADV23R0054Section H---(k) In accordance with NIST SP 800-61 (rev 2, as updated), the Contractor shall report to infosec@loc.gov, the Contracting Officer, and the COR any adverse events (adverse events are currently defined as events with a negative consequence, such as system crashes, packet floods, unauthorized use of system privileges, unauthorized access to sensitive data, and execution of malware that destroys data) that are computer security related or computer security incidents (computer security incident is currently a violation or imminent threat of violation of computer security polices, acceptable use policies, or standard security practices) concerning Library CUI within 24-hours of its discovery. The contractor shall", "chunk_id": 44}, {"child_chunk": "of computer security polices, acceptable use policies, or standard security practices) concerning Library CUI within 24-hours of its discovery. The contractor shall coordinate its response to such an event or incident with the Library.(l) The Contractor shall not provide any government-furnished non-public documents, information, or licensed material in any form to anyone other than the Contracting Officer, the COR, or the Library of Congress Project Manager without the written approval of the Contracting Officer, the COR, or the Library of Congress Project Manager during the period of this contract or at any time afterwards.(m) The Contractor shall not release any government documents or information related to IT Security in any form without the written approval of the Library’s IT Security Group.(n)", "chunk_id": 44}, {"child_chunk": "Contractor shall not release any government documents or information related to IT Security in any form without the written approval of the Library’s IT Security Group.(n) The Contractor shall ensure that all Contractor personnel sign nondisclosure agreements (NDAs).(o) The Contractor shall ensure that all Contractor personnel complete the Library of Congress IT Security Awareness Training on an annual basis.", "chunk_id": 44}, {"child_chunk": "(End of Clause)---H.8 LC52.239-3 ASSESSMENT AND AUTHORIZATION (JAN 2016)The information technology identified in this contract is subject to Assessment and Authorization (A&A) prior to connecting the system(s) to the Library of Congress Network, and updated prior to deploying any significant changes to the system(s).", "chunk_id": 45}, {"child_chunk": "(a) The Contractor shall perform an Initial Security Assessment.---(b) The Contractor shall perform Assessment per NIST SP 800-37.---(c) The Contractor shall complete a Risk Assessment per NIST SP 800-30---(d) The contractor shall conduct independent Security Testing & Evaluation. Evaluation. Contractor personnel conducting this evaluation shall have no stake or responsibilities concerning the system, including those who directly designed/integrated/implemented the system for any IT System categorized as Moderate or High impact. The Contractor shall perform the Security Test & Evaluation on test equipment configured per the ITS hardening guidelines for that particular platform, either in the Library of Congress lab or on a system completely isolated from the Library of Congress Data Network. The Library will provide", "chunk_id": 46}, {"child_chunk": "for that particular platform, either in the Library of Congress lab or on a system completely isolated from the Library of Congress Data Network. The Library will provide the hardening guidelines on request from the contractor.(e) The contractor shall prepare and submit a complete Assessment package pursuant to NIST SP 800-37. The contractor shall prepare and submit the following A&A documentation to the COR using the standard Library of Congress template available at the CGD website: System Security Plan pursuant to NIST SP 800-18 IT Contingency Plan pursuant to NIST SP 800-34 Security Test & Evaluation Report(f) The Contractor shall provide Authorization support to the Authorizing Official, including producing copies of the Assessment Package, drafting", "chunk_id": 46}, {"child_chunk": "Security Test & Evaluation Report(f) The Contractor shall provide Authorization support to the Authorizing Official, including producing copies of the Assessment Package, drafting memorandums and assisting in the briefing of the Designated Approving Authority.", "chunk_id": 46}, {"child_chunk": "Page 13---030ADV23R0054Section H---(g) The Contractor shall provide two (2) paper copies of each Assessment and Authorization deliverable. The contractor shall provide two (2) machine-readable copies each of the Assessment and Authorization deliverables in MS Word format, delivered on CD-ROM.(h) The Contractor shall ensure that the IT system is not connected to the Library of Congress Data Network until accredited.", "chunk_id": 47}, {"child_chunk": "(End of Clause)---H.9 LC52.239-4 SECTION 508 COMPLIANCE (JAN 2015)All contract deliverables shall comply with accessibility standards set forth in the Architectural and Transportation Barriers Compliance Board Electronic and Information Technology (EIT) Accessibility Standards (36 CFR part 1194).(End of Clause)---H.10 LC52.237-1 KEY PERSONNEL (AUG 2014)The personnel designated as key personnel in this contract are considered to be essential to the work being performed hereunder. At least 30 days prior to diverting any of the specified individuals to other programs or contracts or as soon as possible if an individual must be replaced, for example, as a result of leaving the employ of the contractor, the contractor shall notify the contracting officer and identify proposed substitutions. No diversion or substitution shall be made by the contractor without written consent of the contracting officer.The following personnel have been identified as Key Personnel in the performance of this contract:", "chunk_id": 48}, {"child_chunk": "Position/Labor Category---Name---Contractor's Designated Representative---(End of Clause)---Page 14---030ADV23R0054Section I---PART II - CONTRACT CLAUSES---SECTION I - CONTRACT CLAUSES---I.1 52.252-2 CLAUSES INCORPORATED BY REFERENCE (FEB 1998)This contract incorporates one or more clauses by reference, with the same force and effect as if they were given in full text. Upon request, the Contracting Officer will make their full text available. Also, the full text of a clause may be accessed electronically at this/these address(es):", "chunk_id": 49}, {"child_chunk": "https://www.acquisition.gov/browse/index/far---(End of Clause)---FAR Number---Title---Date---52.204-7SYSTEM FOR AWARD MANAGEMENT---OCT 201852.204-9PERSONAL IDENTITY VERIFICATION OF CONTRACTOR PERSONNEL---JAN 201152.204-13SYSTEM FOR AWARD MANAGEMENT MAINTENANCE---OCT 201852.204-16COMMERCIAL AND GOVERNMENT ENTITY CODE REPORTING---AUG 202052.204-18COMMERCIAL AND GOVERNMENT ENTITY CODE MAINTENANCE---AUG 202052.212-4CONTRACT TERMS AND CONDITIONS—COMMERCIAL PRODUCTS AND COMMERCIAL SERVICES---DEC 202252.232-25PROMPT PAYMENT---JAN 201752.233-1", "chunk_id": 50}, {"child_chunk": "DISPUTES---MAY 201452.243-1CHANGES—FIXED PRICE ALTERNATE I (APR 1984)AUG 201852.253-1COMPUTER GENERATED FORMS---JAN 1991I.2 52.212-5 CONTRACT TERMS AND CONDITIONS REQUIRED TO IMPLEMENT STATUTES OR EXECUTIVE ORDERS—COMMERCIAL PRODUCTS AND COMMERCIAL SERVICES (JUN 2023)(a) The Contractor shall comply with the following Federal Acquisition Regulation (FAR) clauses, which are incorporated in this contract by reference, to implement provisions of law or Executive orders applicable to acquisitions of commercial products and commercial services:(1) 52.203-19, Prohibition on Requiring Certain Internal Confidentiality Agreements or Statements (JAN 2017) (section 743 of Division E, Title VII, of the Consolidated and Further Continuing Appropriations Act, 2015 (Pub. L. 113-235) and its successor provisions in subsequent appropriations acts (and as extended in continuing resolutions)).(2) 52.204–23, Prohibition on Contracting for Hardware, Software, and Services Developed or Provided by Kaspersky Lab and Other Covered Entities (NOV 2021) (Section 1634 of Pub. L. 115–91).", "chunk_id": 51}, {"child_chunk": "Page 15---030ADV23R0054Section I---(3) 52.204–25, Prohibition on Contracting for Certain Telecommunications and Video Surveillance Services or Equipment. (NOV 2021) (Section 889(a)(1)(A) of Pub. L. 115–232).(4) 52.209-10, Prohibition on Contracting with Inverted Domestic Corporations (NOV 2015).---(5) 52.232–40, Providing Accelerated Payments to Small Business Subcontractors (MAR 2023) (31 U.S.C. 3903 and 10 U.S.C. 3801).(6) 52.233-3, Protest", "chunk_id": 52}, {"child_chunk": "(31 U.S.C. 3903 and 10 U.S.C. 3801).(6) 52.233-3, Protest After Award (AUG 1996) (31 U.S.C. 3553).(7) 52.233-4, Applicable Law for Breach of Contract Claim (OCT 2004) (Public Laws 108-77 and 108-78 (19 U.S.C. 3805 note)).(b) The Contractor shall comply with the FAR clauses in this paragraph (b) that the Contracting Officer has indicated as being incorporated in this contract by reference to implement provisions of law or Executive orders applicable to acquisitions of commercial products and commercial services:[]", "chunk_id": 52}, {"child_chunk": "Officer has indicated as being incorporated in this contract by reference to implement provisions of law or Executive orders applicable to acquisitions of commercial products and commercial services:[] (1) 52.203–6, Restrictions on Subcontractor Sales to the Government (JUN 2020), with Alternate I (NOV 2021) (41 U.S.C. 4704 and 10 U.S.C. 4655).[] (2) 52.203–13, Contractor Code of Business Ethics and Conduct (NOV 2021) (41 U.S.C. 3509).[] (3) 52.203–15, Whistleblower Protections under the American Recovery and Reinvestment Act of 2009", "chunk_id": 52}, {"child_chunk": "(3) 52.203–15, Whistleblower Protections under the American Recovery and Reinvestment Act of 2009 (JUN 2010) (Section 1553 of Pub. L. 111-5). (Applies to contracts funded by the American Recovery and Reinvestment Act of 2009.)[] (4) 52.204–10, Reporting Executive Compensation and First-Tier Subcontract Awards (JUN 2020) (Pub. L. 109–282) (31 U.S.C. 6101 note).", "chunk_id": 52}, {"child_chunk": "[] (5) [Reserved]---[] (6) 52.204–14, Service Contract Reporting Requirements (OCT 2016) (Pub. L. 111–117, section 743 of Div. C).[] (7) 52.204–15, Service Contract Reporting Requirements for Indefinite-Delivery Contracts (OCT 2016) (Pub. L. 111– 117, section 743 of Div. C).[X] (8) 52.204–27, Prohibition on a ByteDance Covered Application (JUN 2023) (Section 102 of Division R of Pub. L. 117–328).[X] (9) 52.209–6, Protecting the Government’s Interest When Subcontracting with Contractors Debarred, Suspended, or Proposed for Debarment. (NOV 2021) (31 U.S.C. 6101 note).[] (10) 52.209-9, Updates of Publicly Available Information Regarding Responsibility Matters (OCT 2018) (41 U.S.C. 2313).", "chunk_id": 53}, {"child_chunk": "[] (11) [Reserved]---[] (12) 52.219–3, Notice of HUBZone Set-Aside or Sole-Source Award (OCT 2022) (15 U.S.C. 657a).[] (13) 52.219–4, Notice of Price Evaluation Preference for HUBZone Small Business Concerns (OCT 2022) (if the offeror elects to waive the preference, it shall so indicate in its offer) (15 U.S.C. 657a).", "chunk_id": 54}, {"child_chunk": "[] (14) [Reserved]---[] (15)(i) 52.219-6, Notice of Total Small Business Set-Aside (NOV 2020) (15 U.S.C. 644).[] (ii) Alternate I (MAR 2020) of 52.219-6.[] (16)(i) 52.219-7, Notice of Partial Small Business Set-Aside (NOV 2020) (15 U.S.C. 644).Page 16---030ADV23R0054Section I---[] (ii) Alternate I (MAR 2020) of 52.219-7.[] (17) 52.219-8, Utilization of Small Business Concerns (OCT 2022) (15 U.S.C. 637(d)(2) and (3)).", "chunk_id": 55}, {"child_chunk": "[] (18)(i) 52.219–9, Small Business Subcontracting Plan (OCT 2022) (15 U.S.C. 637(d)(4)).---[] (ii) Alternate I (NOV 2016) of 52.219-9.[] (iii) Alternate II (NOV 2016) of 52.219-9.---[] (iv) Alternate III (JUN 2020) of 52.219–9.---[] (v) Alternate IV (SEP 2021) of 52.219–9.[] (19)(i) 52.219-13, Notice of Set-Aside of Orders (MAR 2020) (15 U.S.C. 644(r)).[] (ii) Alternate I (MAR 2020) of 52.219-13.", "chunk_id": 56}, {"child_chunk": "[] (20) 52.219–14, Limitations on Subcontracting (OCT 2022) (15 U.S.C. 657s).---[] (21) 52.219-16, Liquidated Damages—Subcontracting Plan (SEP 2021) (15 U.S.C. 637(d)(4)(F)(i)).---[] (22) 52.219–27, Notice of Service-Disabled Veteran-Owned Small Business Set-Aside (OCT 2022) (15 U.S.C. 657f).[] (23) (i) 52.219–28, Post-Award Small Business Program Rerepresentation (MAR 2023) (15 U.S.C. 632(a)(2)).[] (ii) Alternate I (MAR 2020) of 52.219–28.[] (24) 52.219–29, Notice of Set-Aside for, or Sole-Source Award to, Economically Disadvantaged Women-Owned Small Business Concerns (OCT 2022) (15 U.S.C. 637(m)).[] (25) 52.219–30, Notice of Set-Aside for, or Sole-Source Award to, Women-Owned Small Business Concerns Eligible Under the Women-Owned Small Business Program (OCT 2022) (15 U.S.C. 637(m)).[] (26) 52.219-32, Orders Issued Directly Under Small Business Reserves (MAR 2020) (15 U.S.C. 644(r)).[] (27) l(26) 52.219–33, Nonmanufacturer Rule (SEP 2021) (15 U.S.C. 657s).[X] (28) 52.222-3, Convict Labor (JUN 2003) (E.O. 11755).[] (29) 52.222–19, Child Labor—Cooperation with Authorities and Remedies (DEC 2022) (E.O. 13126).", "chunk_id": 57}, {"child_chunk": "[X] (30) 52.222-21, Prohibition of Segregated Facilities (APR 2015).---[X] (31)(i) 52.222–26, Equal Opportunity (SEP 2016) (E.O. 11246).[] (ii) Alternate I (FEB 1999) of 52.222-26.[X] (32)(i) 52.222–35, Equal Opportunity for Veterans (JUN 2020) (38 U.S.C. 4212).[] (ii) Alternate I (JUL 2014) of 52.222-35.[X] (33)(i) 52.222–36, Equal Opportunity for Workers with Disabilities (JUN 2020) (29 U.S.C. 793).[] (ii) Alternate I (JUL 2014) of 52.222-36.", "chunk_id": 58}, {"child_chunk": "[X] (34) 52.222–37, Employment Reports on Veterans (JUN 2020) (38 U.S.C. 4212).---[] (35) 52.222-40, Notification of Employee Rights Under the National Labor Relations Act (DEC 2010) (E.O. 13496).[X] (36)(i) 52.222-50, Combating Trafficking in Persons (NOV 2021) (22 U.S.C. chapter 78 and E.O. 13627).[] (ii) Alternate I (MAR 2015) of 52.222-50 (22 U.S.C. chapter 78 and E.O. 13627).", "chunk_id": 59}, {"child_chunk": "Page 17---030ADV23R0054Section I---[X] (37) 52.222-54, Employment Eligibility Verification (MAY 2022). (E. O. 12989). (Not applicable to the acquisition of commercially available off-the-shelf items or certain other types of commercial products or commercial services as prescribed in FAR 22.1803.)[] (38)(i) 52.223-9, Estimate of Percentage of Recovered Material Content for EPA-Designated Items (MAY 2008) (42 U.S.C.6962(c)(3)(A)(ii)). (Not applicable to the acquisition of commercially available off-the-shelf items.)[] (ii) Alternate", "chunk_id": 60}, {"child_chunk": "(Not applicable to the acquisition of commercially available off-the-shelf items.)[] (ii) Alternate I (MAY 2008) of 52.223-9 (42 U.S.C. 6962(i)(2)(C)). (Not applicable to the acquisition of commercially available off-the-shelf items.)[] (39) 52.223-11, Ozone-Depleting Substances and High Global Warming Potential Hydrofluorocarbons (JUN 2016) (E.O. 13693).[] (40) 52.223-12, Maintenance, Service, Repair, or Disposal of Refrigeration Equipment and Air Conditioners (JUN 2016) (E.O.", "chunk_id": 60}, {"child_chunk": "Maintenance, Service, Repair, or Disposal of Refrigeration Equipment and Air Conditioners (JUN 2016) (E.O. 13693).[] (41)(i) 52.223-13, Acquisition of EPEAT®-Registered Imaging Equipment (JUN 2014) (E.O.s 13423 and 13514).[] (ii) Alternate I (OCT 2015) of 52.223-13.[] (42)(i) 52.223-14, Acquisition of EPEAT®-Registered Televisions (JUN 2014) (E.O.s 13423 and 13514).[] (ii) Alternate I (JUN 2014) of", "chunk_id": 60}, {"child_chunk": "2014) (E.O.s 13423 and 13514).[] (ii) Alternate I (JUN 2014) of 52.223-14.[] (43) 52.223-15, Energy Efficiency in Energy-Consuming Products (MAY 2020) (42 U.S.C. 8259b).[] (44)(i) 52.223-16, Acquisition of EPEAT®-Registered Personal Computer Products (OCT 2015) (E.O.s 13423 and 13514).[] (ii) Alternate I (JUN 2014) of 52.223-16.[X] (45) 52.223–18,", "chunk_id": 60}, {"child_chunk": "Alternate I (JUN 2014) of 52.223-16.[X] (45) 52.223–18, Encouraging Contractor Policies to Ban Text Messaging While Driving (JUN 2020) (E.O. 13513).[] (46) 52.223-20, Aerosols (JUN 2016) (E.O. 13693).[] (47) 52.223-21, Foams (JUN 2016) (E.O. 13693).[] (48)(i) 52.224-3, Privacy Training (JAN 2017) (5 U.S.C. 552a).[] (ii) Alternate I", "chunk_id": 60}, {"child_chunk": "Privacy Training (JAN 2017) (5 U.S.C. 552a).[] (ii) Alternate I (JAN 2017) of 52.224-3.[] (49)(i) 52.225-1, Buy American—Supplies (OCT 2022) (41 U.S.C. chapter 83).[] (ii) Alternate I (OCT 2022) of 52.225–1.[] (50)(i) 52.225-3, Buy American—Free Trade Agreements—Israeli Trade Act (DEC 2022) (19 U.S.C. 3301 note, 19 U.S.C. 2112 note, 19", "chunk_id": 60}, {"child_chunk": "(DEC 2022) (19 U.S.C. 3301 note, 19 U.S.C. 2112 note, 19 U.S.C. 3805 note, 19 U.S.C. 4001 note, 19 U.S.C. chapter 29 (sections 4501-4732), Public Law 103- 182, 108-77, 108-78, 108-286, 108-302, 109-53, 109-169, 109-283, 110-138, 112-41, 112-42, and 112-43.", "chunk_id": 60}, {"child_chunk": "[] (ii) Alternate I [Reserved].---[] (iii) Alternate II (DEC 2022) of 52.225-3.---[] (iv) Alternate III (JAN 2021) of 52.225-3.---[] (v) Alternate IV (OCT 2022) of 52.225-3.[] (51) 52.225–5, Trade Agreements (DEC 2022) (19 U.S.C. 2501, et seq., 19 U.S.C. 3301 note).[X] (52) 52.225-13, Restrictions on Certain Foreign Purchases (FEB 2021) (E.O.'s, proclamations, and statutes administered by the Office of Foreign Assets Control of the Department of the Treasury).", "chunk_id": 61}, {"child_chunk": "Page 18---030ADV23R0054Section I---[] (53) 52.225–26, Contractors Performing Private Security Functions Outside the United States (OCT 2016) (Section 862, as amended, of the National Defense Authorization Act for Fiscal Year 2008; 10 U.S.C. Subtitle A, Part V, Subpart G Note).[] (54) 52.226-4, Notice of Disaster or Emergency Area Set-Aside (NOV 2007) (42 U.S.C. 5150).[] (55) 52.226-5, Restrictions on Subcontracting Outside Disaster or Emergency Area (NOV 2007) (42 U.S.C. 5150).", "chunk_id": 62}, {"child_chunk": "[X] (56) 52.229–12, Tax on Certain Foreign Procurements (FEB 2021).---[] (57) 52.232-29, Terms for Financing of Purchases of Commercial Products and Commercial Services (NOV 2021) (41 U.S.C. 4505, 10 U.S.C. 3805).[] (58) 52.232-30, Installment Payments for Commercial Products and Commercial Services (NOV 2021) (41 U.S.C. 4505, 10 U.S.C. 3805).[X] (59) 52.232-33, Payment by Electronic Funds Transfer—System for Award Management (OCT 2018) (31 U.S.C. 3332).[] (60) 52.232-34, Payment by Electronic Funds Transfer—Other than System for Award Management (JUL 2013) (31 U.S.C. 3332).[] (61) 52.232-36, Payment by Third Party (MAY 2014) (31 U.S.C. 3332).", "chunk_id": 63}, {"child_chunk": "[X] (62) 52.239-1, Privacy or Security Safeguards (AUG 1996) (5 U.S.C. 552a).---[] (63) 52.242-5, Payments to Small Business Subcontractors (JAN 2017)(15 U.S.C. 637(d)(13)).---[] (64)(i) 52.247-64, Preference for Privately Owned U.S.-Flag Commercial Vessels (NOV 2021) (46 U.S.C. 55305 and 10 U.S.C. 2631).[] (ii) Alternate I (APR 2003) of 52.247-64.[]", "chunk_id": 64}, {"child_chunk": "U.S.C. 2631).[] (ii) Alternate I (APR 2003) of 52.247-64.[] (iii) Alternate II (NOV 2021) of 52.247-64.(c) The Contractor shall comply with the FAR clauses in this paragraph (c), applicable to commercial services, that the Contracting Officer has indicated as being incorporated in this contract by reference to implement provisions of law or Executive orders applicable to acquisitions of commercial products and commercial services:[] (1) 52.222-41, Service Contract Labor Standards (AUG 2018) (41 U.S.C. chapter 67).[] (2) 52.222-42, Statement of Equivalent", "chunk_id": 64}, {"child_chunk": "2018) (41 U.S.C. chapter 67).[] (2) 52.222-42, Statement of Equivalent Rates for Federal Hires (MAY 2014) (29 U.S.C. 206 and 41 U.S.C. chapter 67).[] (3) 52.222-43, Fair Labor Standards Act and Service Contract Labor Standards—Price Adjustment (Multiple Year and Option Contracts) (AUG 2018) (29 U.S.C. 206 and 41 U.S.C. chapter 67).[] (4) 52.222-44, Fair Labor Standards Act and Service Contract Labor Standards—Price Adjustment (MAY 2014) (29 U.S.C", "chunk_id": 64}, {"child_chunk": "Fair Labor Standards Act and Service Contract Labor Standards—Price Adjustment (MAY 2014) (29 U.S.C 206 and 41 U.S.C. chapter 67).[] (5) 52.222-51, Exemption from Application of the Service Contract Labor Standards to Contracts for Maintenance, Calibration, or Repair of Certain Equipment—Requirements (MAY 2014) (41 U.S.C. chapter 67).", "chunk_id": 64}, {"child_chunk": "Page 19---030ADV23R0054Section I---[] (6) 52.222-53, Exemption from Application of the Service Contract Labor Standards to Contracts for Certain Services—Requirements (MAY 2014) (41 U.S.C. chapter 67).[] (7) 52.222-55, Minimum Wages for Contractor Workers Under Executive Order 14026 (JAN 2022).[] (8) 52.222-62, Paid Sick Leave Under Executive Order 13706 (JAN 2022) (E.O. 13706).[] (9) 52.226–6, Promoting Excess Food Donation to Nonprofit Organizations (JUN", "chunk_id": 65}, {"child_chunk": "13706).[] (9) 52.226–6, Promoting Excess Food Donation to Nonprofit Organizations (JUN 2020) (42 U.S.C. 1792).(d) Comptroller General Examination of Record. The Contractor shall comply with the provisions of this paragraph (d) if this contract was awarded using other than sealed bid, is in excess of the simplified acquisition threshold, as defined in FAR 2.101, on the date of award of this contract, and does not contain the clause at 52.215-2, Audit and Records— Negotiation.(1) The Comptroller General of the United States, or an authorized representative of the Comptroller General, shall have access", "chunk_id": 65}, {"child_chunk": "Negotiation.(1) The Comptroller General of the United States, or an authorized representative of the Comptroller General, shall have access to and right to examine any of the Contractor's directly pertinent records involving transactions related to this contract.(2) The Contractor shall make available at its offices at all reasonable times the records, materials, and other evidence for examination, audit, or reproduction, until 3 years after final payment under this contract or for any shorter period specified in FAR Subpart 4.7, Contractor Records Retention, of the other clauses of this contract. If this contract is completely or partially terminated, the records relating to the work terminated shall be made available for 3 years after any resulting final termination settlement. Records relating", "chunk_id": 65}, {"child_chunk": "is completely or partially terminated, the records relating to the work terminated shall be made available for 3 years after any resulting final termination settlement. Records relating to appeals under the disputes clause or to litigation or the settlement of claims arising under or relating to this contract shall be made available until such appeals, litigation, or claims are finally resolved.(3) As used in this clause, records include books, documents, accounting procedures and practices, and other data, regardless of type and regardless of form. This does not require the Contractor to create or maintain any record that the Contractor does not maintain in the ordinary course of business or pursuant to a provision of law.(e)(1) Notwithstanding the requirements of the clauses in paragraphs (a), (b),", "chunk_id": 65}, {"child_chunk": "course of business or pursuant to a provision of law.(e)(1) Notwithstanding the requirements of the clauses in paragraphs (a), (b), (c), and (d) of this clause, the Contractor is not required to flow down any FAR clause, other than those in this paragraph (e)(1) in a subcontract for commercial products or commercial services. Unless otherwise indicated below, the extent of the flow down shall be as required by the clause—(i) 52.203–13, Contractor Code of Business Ethics and Conduct (NOV 2021) (41 U.S.C. 3509).(ii) 52.203-19, Prohibition on Requiring Certain Internal Confidentiality Agreements or Statements", "chunk_id": 65}, {"child_chunk": "U.S.C. 3509).(ii) 52.203-19, Prohibition on Requiring Certain Internal Confidentiality Agreements or Statements (JAN 2017) (section 743 of Division E, Title VII, of the Consolidated and Further Continuing Appropriations Act, 2015 (Pub. L. 113- 235) and its successor provisions in subsequent appropriations acts (and as extended in continuing resolutions)).(iii) 52.204–23, Prohibition on Contracting for Hardware, Software, and Services Developed or Provided by Kaspersky Lab and Other Covered Entities (NOV 2021) (Section 1634 of Pub. L. 115–91).(iv)", "chunk_id": 65}, {"child_chunk": "Lab and Other Covered Entities (NOV 2021) (Section 1634 of Pub. L. 115–91).(iv) 52.204–25, Prohibition on Contracting for Certain Telecommunications and Video Surveillance Services or Equipment. (NOV 2021) (Section 889(a)(1)(A) of Pub. L. 115–232).(v) 52.204–27, Prohibition on a ByteDance Covered Application (JUN 2023) (Section 102 of Division R of Pub. L. 117– 328).(vi) 52.219–8, Utilization of Small Business Concerns (OCT 2022) (15", "chunk_id": 65}, {"child_chunk": "328).(vi) 52.219–8, Utilization of Small Business Concerns (OCT 2022) (15 U.S.C. 637(d)(2) and (3)), in all subcontracts that offer further subcontracting opportunities. If the subcontract (except subcontracts to small business concerns) exceeds", "chunk_id": 65}, {"child_chunk": "Page 20---030ADV23R0054Section I---the applicable threshold specified in FAR 19.702(a) on the date of subcontract award, the subcontractor must include 52.219–8 in lower tier subcontracts that offer subcontracting opportunities.(vii) 52.222-21, Prohibition of Segregated Facilities (APR 2015).---(viii) 52.222–26, Equal Opportunity (SEP 2016) (E.O. 11246).", "chunk_id": 66}, {"child_chunk": "(ix) 52.222–35, Equal Opportunity for Veterans (JUN 2020) (38 U.S.C. 4212).---(x) 52.222–36, Equal Opportunity for Workers with Disabilities (JUN 2020) (29 U.S.C. 793).(xi) 52.222–37, Employment Reports on Veterans (JUN 2020) (38 U.S.C. 4212).---(xii) 52.222-40, Notification of Employee Rights Under the National Labor Relations Act (DEC 2010) (E.O. 13496). Flow down required in accordance with paragraph (f) of FAR clause 52.222-40.", "chunk_id": 67}, {"child_chunk": "(xiii) 52.222-41, Service Contract Labor Standards (AUG 2018) (41 U.S.C. chapter 67).---(xiv)(A) 52.222-50, Combating Trafficking in Persons (NOV 2021) (22 U.S.C. chapter 78 and E.O. 13627).(B) Alternate I (MAR 2015) of 52.222-50 (22 U.S.C. chapter 78 and E.O. 13627).(xv) 52.222-51, Exemption from Application of the Service Contract Labor Standards to Contracts for Maintenance, Calibration, or Repair of Certain Equipment—Requirements (MAY 2014) (41 U.S.C. chapter 67).(xvi) 52.222-53, Exemption from Application of the Service Contract Labor Standards to Contracts for Certain Services—Requirements (MAY 2014) (41 U.S.C. chapter 67).", "chunk_id": 68}, {"child_chunk": "(xvii) 52.222-54, Employment Eligibility Verification (MAY 2022) (E. O. 12989).---(xviii) 52.222-55, Minimum Wages for Contractor Workers Under Executive Order 14026 (JAN 2022).(xix) 52.222-62 Paid Sick Leave Under Executive Order 13706 (JAN 2022) (E.O. 13706).(xx)(A) 52.224-3, Privacy Training (JAN 2017) (5 U.S.C. 552a).(B) Alternate I (JAN 2017) of 52.224-3.(xxi) 52.225–26, Contractors Performing Private Security Functions Outside the United States (OCT 2016) (Section 862, as amended, of the National Defense Authorization Act for Fiscal Year 2008; 10 U.S.C. Subtitle A, Part V, Subpart G Note).(xxii) 52.226–6, Promoting Excess Food Donation to Nonprofit Organizations (JUN 2020) (42 U.S.C. 1792). Flow down required in accordance with paragraph (e) of FAR clause 52.226-6.(xxiii) 52.232–40, Providing Accelerated Payments to Small Business Subcontractors (MAR 2023) (31 U.S.C. 3903 and 10 U.S.C. 3801). Flow down required in accordance with paragraph (c) of 52.232–40.(xxiv) 52.247-64, Preference for Privately Owned U.S.-Flag Commercial Vessels (NOV 2021) (46 U.S.C. 55305 and 10 U.S.C. 2631). Flow down required in accordance with paragraph (d) of FAR clause 52.247-64.(2) While not required, the Contractor may include in its subcontracts for commercial products and commercial services a minimal number of additional clauses necessary to satisfy its contractual obligations.", "chunk_id": 69}, {"child_chunk": "(End of Clause)---I.3 52.217-8 OPTION TO EXTEND SERVICES (NOV 1999)The Government may require continued performance of any services within the limits and at the rates specified in the contract. These rates may be adjusted only as a result of revisions to prevailing labor rates provided by the Secretary of", "chunk_id": 70}, {"child_chunk": "Page 21---030ADV23R0054Section I---Labor. The option provision may be exercised more than once, but the total extension of performance hereunder shall not exceed 6 months. The Contracting Officer may exercise the option by written notice to the Contractor within 30 days prior to the end of the period of performance.", "chunk_id": 71}, {"child_chunk": "(End of Clause)---I.4 52.217-9 OPTION TO EXTEND THE TERM OF THE CONTRACT (MAR 2000)(a) The Government may extend the term of this contract by written notice to the Contractor within 30 days prior to the end of the period of performance; provided that the Government gives the Contractor a preliminary written notice of its intent to extend at least 60 days before the contract expires. The preliminary notice does not commit the Government to an extension.(b) If the Government exercises this option, the extended contract shall be considered to include this option clause.(c) The total duration of this contract, including the exercise of any options under this clause, shall not exceed two (2) years.", "chunk_id": 72}, {"child_chunk": "(End of Clause)---I.5 52.227-18 RIGHTS IN DATA—EXISTING WORKS (DEC 2007)(a) Except as otherwise provided in this contract, the Contractor grants to the Government, and others acting on its behalf, a paid-up, nonexclusive, irrevocable, worldwide license to reproduce, prepare derivative works, and perform publicly and display publicly, by or on behalf of the Government, for all the material or subject matter called for under this contract, or for which this clause is specifically made applicable.(b) The Contractor shall indemnify the Government and its officers, agents, and employees acting for the Government against any liability, including costs and expenses, incurred as the result of (1)", "chunk_id": 73}, {"child_chunk": "Government and its officers, agents, and employees acting for the Government against any liability, including costs and expenses, incurred as the result of (1) the violation of trade secrets, copyrights, or right of privacy or publicity, arising out of the creation, delivery, publication or use of any data furnished under this contract; or (2) any libelous or other unlawful matter contained in such data. The provisions of this paragraph do not apply unless the Government provides notice to the Contractor as soon as practicable of any claim or suit, affords the Contractor an opportunity under applicable laws, rules, or regulations to participate in the defense of the claim or suit, and obtains the Contractor's consent to the settlement of any claim or suit other than as", "chunk_id": 73}, {"child_chunk": "or regulations to participate in the defense of the claim or suit, and obtains the Contractor's consent to the settlement of any claim or suit other than as required by final decree of a court of competent jurisdiction; and do not apply to material furnished to the Contractor by the Government and incorporated in data to which this clause applies.", "chunk_id": 73}, {"child_chunk": "(End of Clause)---I.6 LC52.212-4 CONTRACT TERMS AND CONDITIONS - COMMERCIAL ITEMS (DEV) (FEB 2016)FAR 52.212-4, Contract Terms and Conditions – Commercial Items. The clause is modified as follows:(1) The Library will apply FAR 52.243-1 (Changes – Fixed Price) to any changes under this contract instead of section (c).(2) The reference in section (d) to the Disputes clause at FAR 52.233-1 refers to the clause as modified by the Library.(3) The references in section (g)(2) and (i)(2) to the Prompt Payment Act (31 U.S.C. 3903) and prompt payment regulations at 5 C.F.R. part 1315 refer instead to the Prompt Payment clause at FAR 52.232-25 as modified by the Library.", "chunk_id": 74}, {"child_chunk": "(End of Clause)---Page 22---030ADV23R0054Section I---I.7 LC52.212-5 CONTRACT TERMS AND CONDITIONS REQUIRED TO IMPLEMENT STATUTES OR EXECUTIVE ORDERS - COMMERCIAL ITEMS (DEV) (MAY 2015)FAR 52.212-5, The clause is modified as follows:(1) The Librarian of Congress has the same rights and access provided to the Comptroller General in FAR 52.212-5.", "chunk_id": 75}, {"child_chunk": "(End of Clause)---I.8 LC52.232-25 PROMPT PAYMENT (DEV) (JUL 2013)The Library of Congress is not an agency subject to the Prompt Payment Act. 31 U.S.C. 3901(a)(1). The clause is modified as follows:(1) The following new paragraph (iv) is added to the conditions for paying interest penalty payments in section (a)(4): “(a)(4)(iv) The contract or purchase order contained a provision that expressly required the Library of Congress to pay an interest penalty.”(2) The reference in section (a)(5)(ii) to the Disputes clause at FAR 52.233-1 refers to the clause as modified by the Library.(3) Section (a)(6) is replaced with the following: “Interest penalty payments shall be handled in accordance with the Prompt Payment clause at FAR 52.232-25 as modified by the Library.”(4) Section (b) relating to Contract Financing Payment is deleted.", "chunk_id": 76}, {"child_chunk": "(End of Clause)---I.9 LC52.233-1 52.233-1 (DEV) DISPUTES (MAY 2014)To reflect the provisions of the Legislative Branch Appropriations Act, 2008 (Pub. L. 110-161, div. H., title I, § 1501, Dec. 26, 2007, 121 Stat. 2249, 31 U.S.C. 702 note), the clause is modified as follows:The amount in sections (c), (d)(2)(i), and (e) is $50,000 instead of $100,000.See also regulations of the Government Accountability Office Contract Appeals Board at 4 C.F.R. part 22.", "chunk_id": 77}, {"child_chunk": "(End of Clause)---Page 23---030ADV23R0054Section J---PART III - LIST OF DOCUMENTS, EXHIBITS AND OTHER ATTACHMENTS---SECTION J - LIST OF ATTACHMENTS---See attached document: Attachment J1-LAS Technical Description - Data Dictionary.---Page 24---030ADV23R0054Section K---PART IV - REPRESENTATIONS AND INSTRUCTIONS---SECTION K - REPRESENTATIONS, CERTIFICATIONS AND OTHER STATEMENTS OF OFFERORS---K.1 52.212-3 OFFEROR REPRESENTATIONS AND CERTIFICATIONS—COMMERCIAL PRODUCTS AND COMMERCIAL SERVICES (DEC 2022)The Offeror shall complete only paragraph (b) of this provision if the", "chunk_id": 78}, {"child_chunk": "PRODUCTS AND COMMERCIAL SERVICES (DEC 2022)The Offeror shall complete only paragraph (b) of this provision if the Offeror has completed the annual representations and certification electronically in the System for Award Management (SAM) accessed through https://www.sam.gov. If the Offeror has not completed the annual representations and certifications electronically, the Offeror shall complete only paragraphs (c) through (v) of this provision.(a) Definitions. As used in this provision—Covered telecommunications equipment or services has the meaning provided in the clause 52.204-25, Prohibition on Contracting for Certain Telecommunications and Video Surveillance Services or Equipment.Economically disadvantaged women-owned small business (EDWOSB) concern means a small business", "chunk_id": 78}, {"child_chunk": "for Certain Telecommunications and Video Surveillance Services or Equipment.Economically disadvantaged women-owned small business (EDWOSB) concern means a small business concern that is at least 51 percent directly and unconditionally owned by, and the management and daily business operations of which are controlled by, one or more women who are citizens of the United States and who are economically disadvantaged in accordance with 13 CFR 127, and the concern is identified by SBA or an approved third-party certifier in accordance with 13 CFR 127.300. It automatically qualifies as a women-owned small business eligible under the WOSB Program.Forced or indentured child labor means all work or service—(1) Exacted from any person under the age of", "chunk_id": 78}, {"child_chunk": "the WOSB Program.Forced or indentured child labor means all work or service—(1) Exacted from any person under the age of 18 under the menace of any penalty for its nonperformance and for which the worker does not offer himself voluntarily; or(2) Performed by any person under the age of 18 pursuant to a contract the enforcement of which can be accomplished by process or penalties.Highest-level owner means the entity that owns or controls an immediate owner of the offeror, or that owns or controls one or more entities that control an immediate owner of the offeror. No entity owns or exercises control of the highest level owner.Immediate owner means an entity, other than the offeror, that has direct control of", "chunk_id": 78}, {"child_chunk": "No entity owns or exercises control of the highest level owner.Immediate owner means an entity, other than the offeror, that has direct control of the offeror. Indicators of control include, but are not limited to, one or more of the following: Ownership or interlocking management, identity of interests among family members, shared facilities and equipment, and the common use of employees.Inverted domestic corporation means a foreign incorporated entity that meets the definition of an inverted domestic corporation under 6 U.S.C. 395(b), applied in accordance with the rules and definitions of 6 U.S.C. 395(c).Manufactured end product means any end product in product and service codes (PSCs) 1000-9999,", "chunk_id": 78}, {"child_chunk": "395(c).Manufactured end product means any end product in product and service codes (PSCs) 1000-9999, except—", "chunk_id": 78}, {"child_chunk": "(1) PSC 5510, Lumber and Related Basic Wood Materials;---(2) Product or Service Group (PSG) 87, Agricultural Supplies;---Page 25---030ADV23R0054Section K---(3) PSG 88, Live Animals;---(4) PSG 89, Subsistence;---(5) PSC 9410, Crude Grades of Plant Materials;---(6) PSC 9430, Miscellaneous Crude Animal Products, Inedible;---(7) PSC 9440, Miscellaneous Crude Agricultural and Forestry Products;---(8) PSC 9610, Ores;", "chunk_id": 79}, {"child_chunk": "(9) PSC 9620, Minerals, Natural and Synthetic; and---(10) PSC 9630, Additive Metal Materials.---Place of manufacture means the place where an end product is assembled out of components, or otherwise made or processed from raw materials into the finished product that is to be provided to the Government. If a product is disassembled and reassembled, the place of reassembly is not the place of manufacture.Predecessor means an entity that is replaced by a successor and includes any predecessors of the predecessor.Reasonable inquiry has the meaning provided in the clause 52.204–25, Prohibition on Contracting for Certain Telecommunications and Video Surveillance Services or Equipment.Restricted business operations means business", "chunk_id": 80}, {"child_chunk": "the clause 52.204–25, Prohibition on Contracting for Certain Telecommunications and Video Surveillance Services or Equipment.Restricted business operations means business operations in Sudan that include power production activities, mineral extraction activities, oil-related activities, or the production of military equipment, as those terms are defined in the Sudan Accountability and Divestment Act of 2007 (Pub. L. 110-174). Restricted business operations do not include business operations that the person (as that term is defined in Section 2 of the Sudan Accountability and Divestment Act of 2007) conducting the business can demonstrate—(1) Are conducted under contract directly and exclusively with the regional government of southern Sudan;(2) Are conducted pursuant to specific authorization from", "chunk_id": 80}, {"child_chunk": "can demonstrate—(1) Are conducted under contract directly and exclusively with the regional government of southern Sudan;(2) Are conducted pursuant to specific authorization from the Office of Foreign Assets Control in the Department of the Treasury, or are expressly exempted under Federal law from the requirement to be conducted under such authorization;(3) Consist of providing goods or services to marginalized populations of Sudan;(4) Consist of providing goods or services to an internationally recognized peacekeeping force or humanitarian organization;(5) Consist of providing goods or services that are used only to promote health or education; or(6) Have been voluntarily suspended.", "chunk_id": 80}, {"child_chunk": "Sensitive technology—---(1) Means hardware, software, telecommunications equipment, or any other technology that is to be used specifically—(i) To restrict the free flow of unbiased information in Iran; or(ii) To disrupt, monitor, or otherwise restrict speech of the people of Iran; and(2) Does not include information or informational materials the export of which the President does not have the authority to regulate or prohibit pursuant to section 203(b)(3) of the International Emergency Economic Powers Act (50 U.S.C. 1702(b)(3)).", "chunk_id": 81}, {"child_chunk": "Page 26---030ADV23R0054Section K---Service-disabled veteran-owned small business concern—---(1) Means a small business concern—(i) Not less than 51 percent of which is owned by one or more service-disabled veterans or, in the case of any publicly owned business, not less than 51 percent of the stock of which is owned by one or more service-disabled veterans; and(ii) The management and daily business operations of which are controlled by one or more service-disabled veterans or, in the case of a service-disabled veteran with permanent and severe disability, the spouse or permanent caregiver of such veteran.(2) Service-disabled veteran means a veteran, as defined in 38 U.S.C. 101(2), with a disability that is service-connected, as defined in 38 U.S.C. 101(16).", "chunk_id": 82}, {"child_chunk": "Small business concern—---(1) Means a concern, including its affiliates, that is independently owned and operated, not dominant in its field of operation, and qualified as a small business under the criteria in 13 CFR part 121 and size standards in this solicitation.(2) Affiliates, as used in this definition, means business concerns, one of whom directly or indirectly controls or has the power to control the others, or a third party or parties control or have the power to control the others. In determining whether affiliation exists, consideration is given to all appropriate factors including common ownership, common management, and contractual relationships. SBA determines affiliation based on the factors set forth at 13 CFR 121.103.Small disadvantaged business concern,", "chunk_id": 83}, {"child_chunk": "common management, and contractual relationships. SBA determines affiliation based on the factors set forth at 13 CFR 121.103.Small disadvantaged business concern, consistent with 13 CFR 124.1002, means a small business concern under the size standard applicable to the acquisition, that—(1) Is at least 51 percent unconditionally and directly owned (as defined at 13 CFR 124.105) by—(i) One or more socially disadvantaged (as defined at 13 CFR 124.103) and economically disadvantaged (as defined at 13 CFR 124.104) individuals who are citizens of the United States; and(ii) Each individual claiming economic disadvantage has a net worth not exceeding $750,000 after taking into", "chunk_id": 83}, {"child_chunk": "individuals who are citizens of the United States; and(ii) Each individual claiming economic disadvantage has a net worth not exceeding $750,000 after taking into account the applicable exclusions set forth at 13 CFR 124.104(c)(2); and(2) The management and daily business operations of which are controlled (as defined at 13.CFR 124.106) by individuals, who meet the criteria in paragraphs (1)(i) and (ii) of this definition.Subsidiary means an entity in which more than 50 percent of the entity is owned—", "chunk_id": 83}, {"child_chunk": "(1) Directly by a parent corporation; or---(2) Through another subsidiary of a parent corporation.---Successor means an entity that has replaced a predecessor by acquiring the assets and carrying out the affairs of the predecessor under a new name (often through acquisition or merger). The term “successor” does not include new offices/divisions of the same company or a company that only changes its name. The extent of the responsibility of the successor for the liabilities of the predecessor may vary, depending on State law and specific circumstances.Veteran-owned small business concern means a small business concern—(1) Not less than 51 percent of which is owned by one or more veterans (as defined at 38 U.S.C. 101(2)) or, in the case of any publicly owned business, not less than 51 percent of the stock of which is owned by one or more veterans; and(2) The management and daily business operations of which are controlled by one or more veterans.", "chunk_id": 84}, {"child_chunk": "Page 27---030ADV23R0054Section K---Women-owned business concern means a concern which is at least 51 percent owned by one or more women; or in the case of any publicly owned business, at least 51 percent of its stock is owned by one or more women; and whose management and daily business operations are controlled by one or more women.Women-owned small business concern means a small business concern—(1) That is at least 51 percent owned by one or more women; or, in the case of any publicly owned business, at least 51 percent of the stock of which is owned by one or more women; and(2) Whose management and daily business operations are controlled by one or more", "chunk_id": 85}, {"child_chunk": "of the stock of which is owned by one or more women; and(2) Whose management and daily business operations are controlled by one or more women.Women-owned small business (WOSB) concern eligible under the WOSB Program (in accordance with 13 CFR part 127), means a small business concern that is at least 51 percent directly and unconditionally owned by, and the management and daily business operations of which are controlled by, one or more women who are citizens of the United States, and the concern is certified by SBA or an approved third-party certifier in accordance with 13 CFR 127.300.(b)(1) Annual Representations and Certifications. Any changes provided by the Offeror in paragraph", "chunk_id": 85}, {"child_chunk": "accordance with 13 CFR 127.300.(b)(1) Annual Representations and Certifications. Any changes provided by the Offeror in paragraph (b)(2) of this provision do not automatically change the representations and certifications in SAM.(2) The offeror has completed the annual representations and certifications electronically in SAM accessed through http://www.sam.gov. After reviewing SAM information, the Offeror verifies by submission of this offer that the representations and certifications currently posted electronically at FAR 52.212–3, Offeror Representations and Certifications—Commercial Products and Commercial Services, have been entered or updated in the last 12 months, are current, accurate, complete, and applicable to this solicitation (including the business size standard(s)", "chunk_id": 85}, {"child_chunk": "or updated in the last 12 months, are current, accurate, complete, and applicable to this solicitation (including the business size standard(s) applicable to the NAICS code(s) referenced for this solicitation), at the time this offer is submitted and are incorporated in this offer by reference (see FAR 4.1201), except for paragraphs .(c) Offerors must complete the following representations when the resulting contract is for supplies to be delivered or services to be performed in the United States or its outlying areas, or when the contracting officer has applied part 19 in accordance with 19.000(b)(1)(ii). Check all that apply.(1) Small business concern. The offeror represents as part of its offer", "chunk_id": 85}, {"child_chunk": "19.000(b)(1)(ii). Check all that apply.(1) Small business concern. The offeror represents as part of its offer that—(i) It [ ] is, [ ] is not a small business concern; or(ii) It [ ] is, [ ] is not a small business joint venture that complies with the requirements of 13 CFR 121.103(h) and 13 CFR 125.8(a) and (b). [The offeror shall enter the name and unique entity identifier of each party to the joint venture: __________________.](2) Veteran-owned small business concern. [Complete only if the offeror represented itself as a small business concern in paragraph (c)(1) of this", "chunk_id": 85}, {"child_chunk": "Veteran-owned small business concern. [Complete only if the offeror represented itself as a small business concern in paragraph (c)(1) of this provision.] The offeror represents as part of its offer that it [ ] is, [ ] is not a veteran-owned small business concern.(3) Service-disabled veteran-owned small business concern. [Complete only if the offeror represented itself as a veteran-owned small business concern in paragraph (c)(2) of this provision.] The offeror represents as part of its offer that—(i) It [ ] is, [ ] is not a service-disabled veteran-owned small business concern; or(ii) It [ ] is, [ ] is not a joint venture that complies with the requirements of 13", "chunk_id": 85}, {"child_chunk": "veteran-owned small business concern; or(ii) It [ ] is, [ ] is not a joint venture that complies with the requirements of 13 CFR 125.18(b)(1) and (2). [The offeror shall enter the name and unique entity identifier of each party to the joint venture: __________________.] Each service- disabled veteran-owned small business concern participating in the joint venture shall provide representation of its service-disabled veteran-owned small business concern status.", "chunk_id": 85}, {"child_chunk": "Page 28---030ADV23R0054Section K---(4) Small disadvantaged business concern. [Complete only if the offeror represented itself as a small business concern in paragraph (c)(1) of this provision.] The offeror represents that it [ ] is, [ ] is not a small disadvantaged business concern as defined in 13 CFR 124.1002.(5) Women-owned small business concern. [Complete only if the offeror represented itself as a small business concern in paragraph (c)(1) of this provision.] The offeror represents that it [ ] is, [ ] is not a women-owned small business concern.(6) WOSB join venture eligible under the WOSB Program. [Complete only if", "chunk_id": 86}, {"child_chunk": "[ ] is not a women-owned small business concern.(6) WOSB join venture eligible under the WOSB Program. [Complete only if the offeror represented itself as a women- owned small business concern in paragraph (c)(5) of this provision.] The offeror represents that it [ ] is, [ ] is not a joint venture that complies with the requirements of 13 CFR 127.506(a) through (c). [The offeror shall enter the name and unique entity identifier of each party to the joint venture: __________________.](7) Economically disadvantaged women-owned small business (EDWOSB) joint venture. The offeror represents that it [ ] is, [ ] is not a joint venture that", "chunk_id": 86}, {"child_chunk": "small business (EDWOSB) joint venture. The offeror represents that it [ ] is, [ ] is not a joint venture that complies with the requirements of 13 CFR part 127.506(a) through (c). [The offeror shall enter the name and unique entity identifier of each party to the joint venture: __________________.]Note to Paragraphs (c)(8) and (9): Complete paragraphs (c)(8) and (9) only if this solicitation is expected to exceed the simplified acquisition threshold.(8) Women-owned business concern (other than small business concern). [Complete only if the offeror is a women- owned business concern and did not represent itself as a small business concern in paragraph", "chunk_id": 86}, {"child_chunk": "small business concern). [Complete only if the offeror is a women- owned business concern and did not represent itself as a small business concern in paragraph (c)(1) of this provision.] The offeror represents that it [ ] is a women-owned business concern.(9) Tie bid priority for labor surplus area concerns. If this is an invitation for bid, small business offerors may identify the labor surplus areas in which costs to be incurred on account of manufacturing or production (by offeror or first-tier subcontractors) amount to more than 50 percent of the contract price:___________________________________________(10) HUBZone small business concern. [Complete only if the offeror represented itself as a small business concern in paragraph", "chunk_id": 86}, {"child_chunk": "HUBZone small business concern. [Complete only if the offeror represented itself as a small business concern in paragraph (c)(1) of this provision.] The offeror represents, as part of its offer, that—(i) It [ ] is, [ ] is not a HUBZone small business concern listed, on the date of this representation, as having been certified by SBA as a HUBZone small business concern in the Dynamic Small Business Search and SAM, and will attempt to maintain an employment rate of HUBZone residents of 35 percent of its employees during performance of a HUBZone contract (see 13 CFR 126.200(e)(1)); and(ii) It [ ] is, [ ] is not", "chunk_id": 86}, {"child_chunk": "a HUBZone contract (see 13 CFR 126.200(e)(1)); and(ii) It [ ] is, [ ] is not a HUBZone joint venture that complies with the requirements of 13 CFR Part 126.616(a) through (c). [The offeror shall enter the name and unique entity identifier of each party to the joint venture: __________________.] Each HUBZone small business concern participating in the HUBZone joint venture shall provide representation of its HUBZone status.(d) Representations required to implement provisions of Executive Order 11246—(1) Previous contracts and compliance. The offeror represents that—(i) It [ ] has, [ ] has not participated in a previous contract", "chunk_id": 86}, {"child_chunk": "Previous contracts and compliance. The offeror represents that—(i) It [ ] has, [ ] has not participated in a previous contract or subcontract subject to the Equal Opportunity clause of this solicitation; and(ii) It [ ] has, [ ] has not filed all required compliance reports.(2) Affirmative Action Compliance. The offeror represents that—", "chunk_id": 86}, {"child_chunk": "Page 29---030ADV23R0054Section K---(i) It [ ] has developed and has on file, [ ] has not developed and does not have on file, at each establishment, affirmative action programs required by rules and regulations of the Secretary of Labor (41 CFR parts 60-1 and 60-2), or(ii) It [ ] has not previously had contracts subject to the written affirmative action programs requirement of the rules and regulations of the Secretary of Labor.(e) Certification Regarding Payments to Influence Federal Transactions (31 U.S.C. 1352). (Applies only if the contract is expected to exceed $150,000.) By submission of its offer, the offeror certifies to the best of its", "chunk_id": 87}, {"child_chunk": "only if the contract is expected to exceed $150,000.) By submission of its offer, the offeror certifies to the best of its knowledge and belief that no Federal appropriated funds have been paid or will be paid to any person for influencing or attempting to influence an officer or employee of any agency, a Member of Congress, an officer or employee of Congress or an employee of a Member of Congress on his or her behalf in connection with the award of any resultant contract. If any registrants under the Lobbying Disclosure Act of 1995 have made a lobbying contact on behalf of the offeror with respect to this contract, the offeror shall complete and submit, with its offer, OMB Standard Form LLL, Disclosure of Lobbying", "chunk_id": 87}, {"child_chunk": "with respect to this contract, the offeror shall complete and submit, with its offer, OMB Standard Form LLL, Disclosure of Lobbying Activities, to provide the name of the registrants. The offeror need not report regularly employed officers or employees of the offeror to whom payments of reasonable compensation were made.(f) Buy American Certificate. (Applies only if the clause at Federal Acquisition Regulation (FAR) 52.225-1, Buy American—Supplies, is included in this solicitation.)(1)(i) The Offeror certifies that each end product, except those listed in paragraph (f)(2) of this provision, is a domestic end product and that each domestic end product listed in paragraph", "chunk_id": 87}, {"child_chunk": "product, except those listed in paragraph (f)(2) of this provision, is a domestic end product and that each domestic end product listed in paragraph (f)(3) of this provision contains a critical component.(ii) The Offeror shall list as foreign end products those end products manufactured in the United States that do not qualify as domestic end products. For those foreign end products that do not consist wholly or predominantly of iron or steel or a combination of both, the Offeror shall also indicate whether these foreign end products exceed 55 percent domestic content, except for those that are COTS items. If the percentage of the domestic content is unknown, select ‘‘no’’.(iii) The Offeror shall separately list the line item numbers of", "chunk_id": 87}, {"child_chunk": "If the percentage of the domestic content is unknown, select ‘‘no’’.(iii) The Offeror shall separately list the line item numbers of domestic end products that contain a critical component (see FAR 25.105).(iv) The terms ‘‘commercially available off-the-shelf (COTS) item,’’ ‘‘critical component,’’ ‘‘domestic end product,’’ ‘‘end product,’’ ‘‘foreign end product,’’ and ‘‘United States’’ are defined in the clause of this solicitation entitled ‘‘Buy American—Supplies.’’", "chunk_id": 87}, {"child_chunk": "(2) Foreign End Products:---Line item No.---Country of origin---Exceeds 55% domestic content (yes/no)---[List as necessary]---(3) Domestic end products containing a critical component: Line Item No. ___________[List as necessary]---(4) The Government will evaluate offers in accordance with the policies and procedures of FAR part 25.", "chunk_id": 88}, {"child_chunk": "Page 30---030ADV23R0054Section K---(g)(1) Buy American—Free Trade Agreements—Israeli Trade Act Certificate. (Applies only if the clause at FAR 52.225-3, Buy American—Free Trade Agreements—Israeli Trade Act, is included in this solicitation.)(i)(A) The Offeror certifies that each end product, except those listed in paragraph (g)(1)(ii) or (iii) of this provision, is a domestic end product and that each domestic end product listed in paragraph (g)(1)(iv) of this provision contains a critical component.(B) The terms ‘‘Bahrainian, Moroccan, Omani, Panamanian, or Peruvian end product,’’ ‘‘commercially available off- the-shelf (COTS) item,’’ ‘‘critical component,’’ ‘‘domestic end product,’’ ‘‘end product,’’ ‘‘foreign end product,’’ ‘‘Free Trade Agreement country,’’ ‘‘Free Trade Agreement country end product,’’ ‘‘Israeli end product,’’ and ‘‘United States’’ are defined in the clause of this solicitation entitled ‘‘Buy American—Free Trade Agreements—Israeli Trade Act.’’(ii) The Offeror certifies that the following supplies are Free Trade Agreement country end products (other than Bahrainian, Moroccan, Omani, Panamanian, or Peruvian end products) or Israeli end products as defined in the clause of this solicitation entitled ‘‘Buy American—Free Trade Agreements—Israeli Trade Act.’’Free Trade Agreement Country End Products (Other than Bahrainian, Moroccan, Omani, Panamanian, or Peruvian End Products) or Israeli End Products:", "chunk_id": 89}, {"child_chunk": "Line item No.---Country of origin---[List as necessary]---(iii) The Offeror shall list those supplies that are foreign end products (other than those listed in paragraph (g)(1)(ii) of this provision) as defined in the clause of this solicitation entitled ‘‘Buy American—Free Trade Agreements—Israeli Trade Act.’’ The Offeror shall list as other foreign end products those end products manufactured in the United States that do not qualify as domestic end products. For those foreign end products that do not consist wholly or predominantly of iron or steel or a combination of both, the Offeror shall also indicate whether these foreign end products exceed 55 percent domestic content, except for those that are COTS items. If the percentage of the domestic content is unknown, select ‘‘no’’.", "chunk_id": 90}, {"child_chunk": "Other Foreign End Products:---Line item No.---Country of origin---Exceeds 55% domestic content (yes/no)---[List as necessary]---(iv) The Offeror shall list the line item numbers of domestic end products that contain a critical component (see FAR 25.105). Line Item No. ___________[List as necessary]---Page 31---030ADV23R0054", "chunk_id": 91}, {"child_chunk": "Section K---(v) The Government will evaluate offers in accordance with the policies and procedures of FAR part 25.(2) Buy American—Free Trade Agreements—Israeli Trade Act Certificate, Alternate II. If Alternate II to the clause at FAR 52.225-3 is included in this solicitation, substitute the following paragraph (g)(1)(ii) for paragraph (g)(1)(ii) of the basic provision:(g)(1)(ii) The offeror certifies that the following supplies are Israeli end products as defined in the clause of this solicitation entitled “Buy American—Free Trade Agreements—Israeli Trade Act”:", "chunk_id": 92}, {"child_chunk": "Israeli End Products:---Line item No.---Country of origin---[List as necessary]---(3) Buy American—Free Trade Agreements—Israeli Trade Act Certificate, Alternate III. If Alternate III to the clause at FAR 52.225-3 is included in this solicitation, substitute the following paragraph (g)(1)(ii) for paragraph (g)(1)(ii) of the basic provision:(g)(1)(ii) The offeror certifies that the following supplies are Free Trade Agreement country end products (other than Bahrainian, Korean, Moroccan, Omani, Panamanian, or Peruvian end products) or Israeli end products as defined in the clause of this solicitation entitled “Buy American—Free Trade Agreements—Israeli Trade Act”:Free Trade Agreement Country End Products (Other than Bahrainian, Korean, Moroccan, Omani, Panamanian, or Peruvian End Products) or Israeli End Products:", "chunk_id": 93}, {"child_chunk": "Line item No.---Country of origin---[List as necessary]---(4) Trade Agreements Certificate. (Applies only if the clause at FAR 52.225-5, Trade Agreements, is included in this solicitation.)(i) The offeror certifies that each end product, except those listed in paragraph (g)(5)(ii) of this provision, is a U.S.- made or designated country end product, as defined in the clause of this solicitation entitled “Trade Agreements”.(ii) The offeror shall list as other end products those end products that are not U.S.-made or designated country end products.", "chunk_id": 94}, {"child_chunk": "Other End Products:---Line item No.---Country of origin---Page 32---030ADV23R0054Section K---[List as necessary]---(iii) The Government will evaluate offers in accordance with the policies and procedures of FAR Part 25. For line items covered by the WTO GPA, the Government will evaluate offers of U.S.-made or designated country end products without regard to the restrictions of the Buy American statute. The Government will consider for award only offers of U.S.-made or designated country end products unless the Contracting Officer determines that there are no offers for such products or that the offers for such products are insufficient to fulfill the requirements of the solicitation.(h) Certification Regarding Responsibility Matters (Executive Order", "chunk_id": 95}, {"child_chunk": "for such products or that the offers for such products are insufficient to fulfill the requirements of the solicitation.(h) Certification Regarding Responsibility Matters (Executive Order 12689). (Applies only if the contract value is expected to exceed the simplified acquisition threshold.) The offeror certifies, to the best of its knowledge and belief, that the offeror and/or any of its principals—(1) [ ] Are, [ ] are not presently debarred, suspended, proposed for debarment, or declared ineligible for the award of contracts by any Federal agency;(2) [ ] Have, [ ] have not, within a three-year period preceding this offer, been convicted of or had a civil judgment rendered against them for: commission of fraud", "chunk_id": 95}, {"child_chunk": "[ ] have not, within a three-year period preceding this offer, been convicted of or had a civil judgment rendered against them for: commission of fraud or a criminal offense in connection with obtaining, attempting to obtain, or performing a Federal, state or local government contract or subcontract; violation of Federal or state antitrust statutes relating to the submission of offers; or Commission of embezzlement, theft, forgery, bribery, falsification or destruction of records, making false statements, tax evasion, violating Federal criminal tax laws, or receiving stolen property;(3) [ ] Are, [ ] are not presently indicted for, or otherwise criminally or civilly charged by a Government entity with, commission of any of these offenses enumerated in paragraph", "chunk_id": 95}, {"child_chunk": "] are not presently indicted for, or otherwise criminally or civilly charged by a Government entity with, commission of any of these offenses enumerated in paragraph (h)(2) of this clause; and(4) [ ] Have, [ ] have not, within a three-year period preceding this offer, been notified of any delinquent Federal taxes in an amount that exceeds the threshold at 9.104–5(a)(2) for which the liability remains unsatisfied.(i) Taxes are considered delinquent if both of the following criteria apply:(A) The tax liability is finally determined. The liability is finally determined if it has been assessed. A liability is not finally determined if there is a pending administrative or judicial challenge. In the", "chunk_id": 95}, {"child_chunk": "The liability is finally determined if it has been assessed. A liability is not finally determined if there is a pending administrative or judicial challenge. In the case of a judicial challenge to the liability, the liability is not finally determined until all judicial appeal rights have been exhausted.(B) The taxpayer is delinquent in making payment. A taxpayer is delinquent if the taxpayer has failed to pay the tax liability when full payment was due and required. A taxpayer is not delinquent in cases where enforced collection action is precluded.", "chunk_id": 95}, {"child_chunk": "(ii) Examples.---(A) The taxpayer has received a statutory notice of deficiency, under I.R.C. Sec. 6212, which entitles the taxpayer to seek Tax Court review of a proposed tax deficiency. This is not a delinquent tax because it is not a final tax liability. Should the taxpayer seek Tax Court review, this will not be a final tax liability until the taxpayer has exercised all judicial appeal rights.(B) The IRS has filed a notice of Federal tax lien with respect to an assessed tax liability, and the taxpayer has been issued a notice under I.R.C. Sec. 6320 entitling the taxpayer to request a hearing with the IRS Office of Appeals", "chunk_id": 96}, {"child_chunk": "Page 33---030ADV23R0054Section K---contesting the lien filing, and to further appeal to the Tax Court if the IRS determines to sustain the lien filing. In the course of the hearing, the taxpayer is entitled to contest the underlying tax liability because the taxpayer has had no prior opportunity to contest the liability. This is not a delinquent tax because it is not a final tax liability. Should the taxpayer seek tax court review, this will not be a final tax liability until the taxpayer has exercised all judicial appeal rights.(C) The taxpayer has entered into an installment agreement pursuant to I.R.C. Sec. 6159. The taxpayer is making timely payments and is in full compliance with the agreement terms. The taxpayer", "chunk_id": 97}, {"child_chunk": "pursuant to I.R.C. Sec. 6159. The taxpayer is making timely payments and is in full compliance with the agreement terms. The taxpayer is not delinquent because the taxpayer is not currently required to make full payment.(D) The taxpayer has filed for bankruptcy protection. The taxpayer is not delinquent because enforced collection action is stayed under 11 U.S.C. 362 (the Bankruptcy Code).(i) Certification Regarding Knowledge of Child Labor for Listed End Products (Executive Order 13126).(1) Listed end products.Listed end productListed countries of origin(2) Certification. [If the Contracting Officer has identified end products and countries of origin in paragraph (i)(1) of this provision, then the", "chunk_id": 97}, {"child_chunk": "Certification. [If the Contracting Officer has identified end products and countries of origin in paragraph (i)(1) of this provision, then the offeror must certify to either (i)(2)(i) or (i)(2)(ii) by checking the appropriate block.][ ] (i) The offeror will not supply any end product listed in paragraph (i)(1) of this provision that was mined, produced, or manufactured in the corresponding country as listed for that product.[ ] (ii) The offeror may supply an end product listed in paragraph (i)(1) of this provision that was mined, produced, or manufactured in the corresponding country as listed for that product. The offeror certifies that it has made a", "chunk_id": 97}, {"child_chunk": "this provision that was mined, produced, or manufactured in the corresponding country as listed for that product. The offeror certifies that it has made a good faith effort to determine whether forced or indentured child labor was used to mine, produce, or manufacture any such end product furnished under this contract. On the basis of those efforts, the offeror certifies that it is not aware of any such use of child labor.(j) Place of manufacture. (Does not apply unless the solicitation is predominantly for the acquisition of manufactured end products.) For statistical purposes only, the offeror shall indicate whether the place of manufacture of the end products it expects to provide in response to this solicitation is predominantly—(1) __ In the United States", "chunk_id": 97}, {"child_chunk": "whether the place of manufacture of the end products it expects to provide in response to this solicitation is predominantly—(1) __ In the United States (Check this box if the total anticipated price of offered end products manufactured in the United States exceeds the total anticipated price of offered end products manufactured outside the United States); or", "chunk_id": 97}, {"child_chunk": "(2) __ Outside the United States.---(k) Certificates regarding exemptions from the application of the Service Contract Labor Standards. (Certification by the offeror as to its compliance with respect to the contract also constitutes its certification as to compliance by its subcontractor if it subcontracts out the exempt services.) [The contracting officer is to check a box to indicate if paragraph (k)(1) or (k)(2) applies.]", "chunk_id": 98}, {"child_chunk": "Page 34---030ADV23R0054Section K---[] (1) Maintenance, calibration, or repair of certain equipment as described in FAR 22.1003-4(c)(1). The offeror [ ] does [ ] does not certify that—(i) The items of equipment to be serviced under this contract are used regularly for other than Governmental purposes and are sold or traded by the offeror (or subcontractor in the case of an exempt subcontract) in substantial quantities to the general public in the course of normal business operations;(ii) The services will be furnished at prices which are, or are based on, established catalog or market prices (see FAR 22.1003-", "chunk_id": 99}, {"child_chunk": "The services will be furnished at prices which are, or are based on, established catalog or market prices (see FAR 22.1003- 4(c)(2)(ii)) for the maintenance, calibration, or repair of such equipment; and(iii) The compensation (wage and fringe benefits) plan for all service employees performing work under the contract will be the same as that used for these employees and equivalent employees servicing the same equipment of commercial customers.[] (2) Certain services as described in FAR 22.1003- 4(d)(1). The offeror [ ] does [ ] does not certify that—(i) The services under the contract are offered and sold regularly to non-Governmental customers, and are", "chunk_id": 99}, {"child_chunk": "does [ ] does not certify that—(i) The services under the contract are offered and sold regularly to non-Governmental customers, and are provided by the offeror (or subcontractor in the case of an exempt subcontract) to the general public in substantial quantities in the course of normal business operations;(ii) The contract services will be furnished at prices that are, or are based on, established catalog or market prices (see FAR 22.1003-4(d)(2)(iii));(iii) Each service employee who will perform the services under the contract will spend only a small portion of his or her time (a monthly average of less than 20 percent of the available hours on an annualized basis, or less than", "chunk_id": 99}, {"child_chunk": "small portion of his or her time (a monthly average of less than 20 percent of the available hours on an annualized basis, or less than 20 percent of available hours during the contract period if the contract period is less than a month) servicing the Government contract; and(iv) The compensation (wage and fringe benefits) plan for all service employees performing work under the contract is the same as that used for these employees and equivalent employees servicing commercial customers.", "chunk_id": 99}, {"child_chunk": "(3) If paragraph (k)(1) or (k)(2) of this clause applies—---(i) If the offeror does not certify to the conditions in paragraph (k)(1) or (k)(2) and the Contracting Officer did not attach a Service Contract Labor Standards wage determination to the solicitation, the offeror shall notify the Contracting Officer as soon as possible; and(ii) The Contracting Officer may not make an award to the offeror if the offeror fails to execute the certification in paragraph (k)(1) or (k)(2) of this clause or to contact the Contracting Officer as required in paragraph (k)(3)(i) of this clause.(l) Taxpayer Identification", "chunk_id": 100}, {"child_chunk": "of this clause or to contact the Contracting Officer as required in paragraph (k)(3)(i) of this clause.(l) Taxpayer Identification Number (TIN) (26 U.S.C. 6109, 31 U.S.C. 7701). (Not applicable if the offeror is required to provide this information to SAM to be eligible for award.)(1) All offerors must submit the information required in paragraphs (l)(3) through (l)(5) of this provision to comply with debt collection requirements of 31 U.S.C. 7701(c) and 3325(d), reporting requirements of 26 U.S.C. 6041, 6041A, and", "chunk_id": 100}, {"child_chunk": "7701(c) and 3325(d), reporting requirements of 26 U.S.C. 6041, 6041A, and 6050M, and implementing regulations issued by the Internal Revenue Service (IRS).(2) The TIN may be used by the Government to collect and report on any delinquent amounts arising out of the offeror's relationship with the Government (31 U.S.C. 7701(c)(3)). If the resulting contract is subject to the payment reporting requirements described in FAR 4.904, the TIN provided hereunder may be matched with IRS records to verify the accuracy of the offeror's TIN.", "chunk_id": 100}, {"child_chunk": "(3) Taxpayer Identification Number (TIN).---Page 35---030ADV23R0054Section K---[ ] TIN: _____________________.[ ] TIN has been applied for.[ ] TIN is not required because:[ ] Offeror is a nonresident alien, foreign corporation, or foreign partnership that does not have income effectively connected with the conduct of a trade or business in the United States and does not have an office or place of business or a fiscal paying agent in the United States;[ ] Offeror is an agency or instrumentality of a foreign government;[ ] Offeror is an agency or instrumentality of the Federal Government.", "chunk_id": 101}, {"child_chunk": "(4) Type of organization.---[ ] Sole proprietorship;---[ ] Partnership;---[ ] Corporate entity (not tax-exempt);---[ ] Corporate entity (tax-exempt);---[ ] Government entity (Federal, State, or local);---[ ] Foreign government;---[ ] International organization per 26 CFR 1.6049-4;---[ ] Other _________________________.(5) Common parent.---[ ] Offeror is not owned or controlled by a common parent;", "chunk_id": 102}, {"child_chunk": "[ ] Name and TIN of common parent:---Name _____________________.TIN _____________________.(m) Restricted business operations in Sudan. By submission of its offer, the offeror certifies that the offeror does not conduct any restricted business operations in Sudan.(n) Prohibition on Contracting with Inverted Domestic Corporations.---(1) Government agencies are not permitted to use appropriated (or otherwise made available) funds for contracts with either an inverted domestic corporation, or a subsidiary of an inverted domestic corporation, unless the exception at 9.108-2(b) applies or the requirement is waived in accordance with the procedures at 9.108-4.", "chunk_id": 103}, {"child_chunk": "(2) Representation. The Offeror represents that—---(i) It [ ] is, [ ] is not an inverted domestic corporation; and(ii) It [ ] is, [ ] is not a subsidiary of an inverted domestic corporation.(o) Prohibition on contracting with entities engaging in certain activities or transactions relating to Iran.(1) The offeror shall email questions concerning sensitive technology to the Department of State at CISADA106@state.gov.", "chunk_id": 104}, {"child_chunk": "Page 36---030ADV23R0054Section K---(2) Representation and certifications. Unless a waiver is granted or an exception applies as provided in paragraph (o)(3) of this provision, by submission of its offer, the offeror—(i) Represents, to the best of its knowledge and belief, that the offeror does not export any sensitive technology to the government of Iran or any entities or individuals owned or controlled by, or acting on behalf or at the direction of, the government of Iran;(ii) Certifies that the offeror, or any person owned or controlled by the offeror, does not engage in any activities for which sanctions may be imposed under section 5 of the Iran Sanctions Act;", "chunk_id": 105}, {"child_chunk": "or controlled by the offeror, does not engage in any activities for which sanctions may be imposed under section 5 of the Iran Sanctions Act; and(iii) Certifies that the offeror, and any person owned or controlled by the offeror, does not knowingly engage in any transaction that exceeds the threshold at FAR 25.703–2(a)(2) with Iran’s Revolutionary Guard Corps or any of its officials, agents, or affiliates, the property and interests in property of which are blocked pursuant to the International Emergency Economic Powers Act (50 U.S.C. 1701 et seq.) (see OFAC’s Specially Designated Nationals and Blocked Persons List at", "chunk_id": 105}, {"child_chunk": "Economic Powers Act (50 U.S.C. 1701 et seq.) (see OFAC’s Specially Designated Nationals and Blocked Persons List at https://www.treasury.gov/resource-center/sanctions/SDN-List/Pages/default.aspx).(3) The representation and certification requirements of paragraph (o)(2) of this provision do not apply if—(i) This solicitation includes a trade agreements certification (e.g., 52.212–3(g) or a comparable agency provision); and(ii) The offeror has certified that all the offered products to be supplied are designated country end products.(p) Ownership or Control of Offeror. (Applies in all solicitations when there is a requirement to be registered in", "chunk_id": 105}, {"child_chunk": "designated country end products.(p) Ownership or Control of Offeror. (Applies in all solicitations when there is a requirement to be registered in SAM or a requirement to have a unique entity identifier in the solicitation).(1) The Offeror represents that it [ ] has or [ ] does not have an immediate owner. If the Offeror has more than one immediate owner (such as a joint venture), then the Offeror shall respond to paragraph (2) and if applicable, paragraph (3) of this provision for each participant in the joint venture.(2) If the Offeror indicates “has” in paragraph (p)(1) of this provision, enter the following information:", "chunk_id": 105}, {"child_chunk": "Immediate owner CAGE code: ____.---Immediate owner legal name: ____.---(Do not use a “doing business as” name)Is the immediate owner owned or controlled by another entity: [ ] Yes or [ ] No.(3) If the Offeror indicates “yes” in paragraph (p)(2) of this provision, indicating that the immediate owner is owned or controlled by another entity, then enter the following information:", "chunk_id": 106}, {"child_chunk": "Highest-level owner CAGE code: ____.---Highest-level owner legal name: ____.---(Do not use a “doing business as” name)(q) Representation by Corporations Regarding Delinquent Tax Liability or a Felony Conviction under any Federal Law.(1) As required by sections 744 and 745 of Division E of the Consolidated and Further Continuing Appropriations Act, 2015 (Pub. L. 113-235), and similar provisions, if contained in subsequent appropriations acts, The Government will not enter into a contract with any corporation that—(i) Has any unpaid Federal tax liability that has been assessed, for which all judicial and administrative remedies have been exhausted or have lapsed, and that is not being paid in a timely manner pursuant to an agreement with the", "chunk_id": 107}, {"child_chunk": "Page 37---030ADV23R0054Section K---authority responsible for collecting the tax liability, where the awarding agency is aware of the unpaid tax liability, unless an agency has considered suspension or debarment of the corporation and made a determination that suspension or debarment is not necessary to protect the interests of the Government; or(ii) Was convicted of a felony criminal violation under any Federal law within the preceding 24 months, where the awarding agency is aware of the conviction, unless an agency has considered suspension or debarment of the corporation and made a determination that this action is not necessary to protect the interests of the Government.", "chunk_id": 108}, {"child_chunk": "(2) The Offeror represents that—---(i) It is [ ] is not [ ] a corporation that has any unpaid Federal tax liability that has been assessed, for which all judicial and administrative remedies have been exhausted or have lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability; and(ii) It is [ ] is not [ ] a corporation that was convicted of a felony criminal violation under a Federal law within the preceding 24 months.(r) Predecessor of Offeror. (Applies in all solicitations that include the provision at 52.204-16, Commercial and Government Entity Code Reporting.)(1) The Offeror represents that it [ ] is or [ ] is not a successor to a predecessor that held a Federal contract or grant within the last three years.(2) If the Offeror has indicated “is” in paragraph (r)(1) of this provision, enter the following information for all predecessors that held a Federal contract or grant within the last three years (if more than one predecessor, list in reverse chronological order):Predecessor CAGE code: ____ (or mark “Unknown”).", "chunk_id": 109}, {"child_chunk": "Predecessor legal name: ____.---(Do not use a “doing business as” name).(s) [Reserved](t) Public Disclosure of Greenhouse Gas Emissions and Reduction Goals. Applies in all solicitations that require offerors to register in SAM (12.301(d)(1)).(1) This representation shall be completed if the Offeror received $7.5 million or more in contract awards in the prior Federal fiscal year. The representation is optional if the Offeror received less than $7.5 million in Federal contract awards in the prior Federal fiscal year.(2) Representation. [Offeror to check applicable block(s) in paragraph (t)(2)(i) and (ii)]. (i) The Offeror", "chunk_id": 110}, {"child_chunk": "Representation. [Offeror to check applicable block(s) in paragraph (t)(2)(i) and (ii)]. (i) The Offeror (itself or through its immediate owner or highest-level owner) [ ] does, [ ] does not publicly disclose greenhouse gas emissions, i.e., makes available on a publicly accessible Web site the results of a greenhouse gas inventory, performed in accordance with an accounting standard with publicly available and consistently applied criteria, such as the Greenhouse Gas Protocol Corporate Standard.(ii) The Offeror (itself or through its immediate owner or highest-level owner) [ ] does, [ ] does not publicly disclose a quantitative greenhouse gas emissions reduction goal, i.e., make available on a publicly accessible Web site a target", "chunk_id": 110}, {"child_chunk": "] does, [ ] does not publicly disclose a quantitative greenhouse gas emissions reduction goal, i.e., make available on a publicly accessible Web site a target to reduce absolute emissions or emissions intensity by a specific quantity or percentage.(iii) A publicly accessible Web site includes the Offeror’s own Web site or a recognized, third-party greenhouse gas emissions reporting program.", "chunk_id": 110}, {"child_chunk": "Page 38---030ADV23R0054Section K---(3) If the Offeror checked “does” in paragraphs (t)(2)(i) or (t)(2)(ii) of this provision, respectively, the Offeror shall provide the publicly accessible Web site(s) where greenhouse gas emissions and/or reduction goals are reported:_____.(u)(1) In accordance with section 743 of Division E, Title VII, of the Consolidated and Further Continuing Appropriations Act, 2015 (Pub. L. 113-235) and its successor provisions in subsequent appropriations acts (and as extended in continuing resolutions), Government agencies are not permitted to use appropriated (or otherwise made available) funds for contracts with an entity", "chunk_id": 111}, {"child_chunk": "appropriations acts (and as extended in continuing resolutions), Government agencies are not permitted to use appropriated (or otherwise made available) funds for contracts with an entity that requires employees or subcontractors of such entity seeking to report waste, fraud, or abuse to sign internal confidentiality agreements or statements prohibiting or otherwise restricting such employees or subcontractors from lawfully reporting such waste, fraud, or abuse to a designated investigative or law enforcement representative of a Federal department or agency authorized to receive such information.(2) The prohibition in paragraph (u)(1) of this provision does not contravene requirements applicable to Standard Form 312 (Classified Information Nondisclosure Agreement), Form 4414 (Sensitive Compartmented Information Nondisclosure Agreement), or any other", "chunk_id": 111}, {"child_chunk": "(Classified Information Nondisclosure Agreement), Form 4414 (Sensitive Compartmented Information Nondisclosure Agreement), or any other form issued by a Federal department or agency governing the nondisclosure of classified information.(3) Representation. By submission of its offer, the Offeror represents that it will not require its employees or subcontractors to sign or comply with internal confidentiality agreements or statements prohibiting or otherwise restricting such employees or subcontractors from lawfully reporting waste, fraud, or abuse related to the performance of a Government contract to a designated investigative or law enforcement representative of a Federal department or agency authorized to receive such information (e.g., agency Office of the Inspector General).(v) Covered Telecommunications Equipment or Services—Representation. Section", "chunk_id": 111}, {"child_chunk": "or agency authorized to receive such information (e.g., agency Office of the Inspector General).(v) Covered Telecommunications Equipment or Services—Representation. Section 889(a)(1)(A) and section 889(a)(1)(B) of Public Law 115-232.(1) The Offeror shall review the list of excluded parties in the System for Award Management (SAM) (https://www.sam.gov) for entities excluded from receiving federal awards for “covered telecommunications equipment or services”.", "chunk_id": 111}, {"child_chunk": "(2) The Offeror represents that—---(i) It [ ] does, [ ] does not provide covered telecommunications equipment or services as a part of its offered products or services to the Government in the performance of any contract, subcontract, or other contractual instrument.(ii) After conducting a reasonable inquiry for purposes of this representation, that it [ ] does, [ ] does not use covered telecommunications equipment or services, or any equipment, system, or service that uses covered telecommunications equipment or services.", "chunk_id": 112}, {"child_chunk": "(End of Provision)---Page 39---030ADV23R0054Section L---SECTION L - INSTRUCTIONS, CONDITIONS, AND NOTICES TO OFFERORS---FAR Number---Title---Date---52.212-1INSTRUCTIONS TO OFFERORS—COMMERCIAL PRODUCTS AND COMMERCIAL SERVICES---MAR 2023L.1 LC52.215-3 PROPOSAL SUBMISSION INSTRUCTIONS – LOW PRICE TECHNICALLY ACCEPTABLE (JUL 2016)All proposals shall be submitted electronically via email to the Contracting Officer Price, Veronica vprice@loc.gov and the Contract Specialist Leonhardt, Riley rleonhardt@loc.gov no later than the response date specified in the solicitation. If the proposal does not comply materially with the submission instructions, the Library reserves the right in its discretion to determine that the offeror is ineligible for award. The offeror shall provide sufficient information regarding the proposed good and services to demonstrate conformity with all solicitation specifications and requirements. The offeror shall provide a firm fixed price for each contract line item number (CLIN) identified in section B.This is a Simplified Acquisition in accordance with FAR Part 13. The Library will not follow formal FAR Part 15 procedures for this action.", "chunk_id": 113}, {"child_chunk": "(End of Clause)---Page 40---030ADV23R0054Section M---SECTION M - EVALUATION FACTORS FOR AWARD---M.1 LC52.233-2 PROTESTS TO THE LIBRARY OF CONGRESS (DEC 2013)Offerors may submit a protest directly to the Contracting Officer or to the Government Accountability Office. Protests filed with the contracting officer will be decided promptly, and may be appealed to the Library’s Senior Procurement Executive for purposes of conducting an independent review of the contracting officer’s decision.", "chunk_id": 114}, {"child_chunk": "(End of Provision)---M.2 LC52.215-4 EVALUATION – LOW PRICE TECHNICALLY ACCEPTABLE (JUL 2016)The Government will award a contract resulting from this solicitation to the responsible offeror that provides a technically acceptable proposal at the lowest price. The Library will evaluate the technical acceptability of goods and services for conformity with the specifications and requirements identified in this solicitation. The Library will establish a total evaluated price by multiplying the unit price by the quantity specified in the schedule for each CLIN in Section B.", "chunk_id": 115}, {"child_chunk": "(End of Clause)---End of Document---Page 41---", "chunk_id": 116}]