[{"chunk": "REQUEST FOR PROPOSAL (RFP)70Z04424RESDIAB01Risk Management Framework (RMF) Support Services---Issued by: U.S. Coast Guard C5I Contracting and Procurement, CG-914 4000 Coast Guard Blvd., Annex 4 Portsmouth, VA 23703-2199Contracting POC: Eric R. St. Pierre, Contract Specialist Telephone Number: (757) 638-2741 E-Mail Address: Eric.R.St.Pierre@uscg.milRFP Issue Date: August XX, 2023---PROPOSAL DUE DATE/TIME: Phase One: September XX, 2023 11:00 AM Eastern---DUE DATE/TIME FOR ANY QUESTIONS REGARDING THIS RFP: August XX, 2023 11:00 AM EasternDO NOT submit removable memory/storage devices or media, such as, flash drives, thumb drives, memory sticks, hard drives, CDs, DVDs, or any other similar devices. USCG policy prohibits the use of removable memory/storage devices or media on USCG workstations and the USCG network.If submitted electronically via email, total combined file sizes cannot be more than 10MB total per email. Zip files shall not be submitted.NOTICE FOR FILING AGENCY PROTESTS---United States Coast Guard Ombudsman Program---It is the policy of the United States Coast Guard (USCG) to issue solicitations and make contract awards in a fair and timely manner. The Ombudsman Program for Agency Protests (OPAP) was established to investigate agency protest issues and resolve them without expensive and time- consuming litigation. OPAP is an independent reviewing authority that is empowered to grant a prevailing protester essentially the same relief as the Government Accountability Office (GAO).Interested parties are encouraged to seek resolution of their concerns within the USCG as an Alternative Dispute Resolution (ADR) forum rather than filing a protest with the GAO or some external forum. Interested parties may seek resolution of their concerns informally or opt to file a formal agency protest with the Contracting Officer or Ombudsman.Informal Forum with the Ombudsman. Interested parties who believe a specific USCG procurement is unfair or otherwise defective should first direct their concerns to the applicable Contracting Officer. If the Contracting Officer is unable to satisfy their concerns, interested parties are encouraged to contact the U.S. Coast Guard Ombudsman for Agency Protests. Under this informal process the agency is not required to suspend contract award performance. Use of an informal forum does not suspend any time requirement for filing a protest with the agency or other forum. In order to ensure a timely response, interested parties should provide the following information to the Ombudsman: solicitation/contract number, contracting office, Contracting Officer, and solicitation closing date (if applicable).Formal Agency Protest with the Ombudsman. Prior to submitting a formal agency protest, protesters must first use their best efforts to resolve their concerns with the Contracting Officer through open and frank discussions. If the protester’s concerns are unresolved, an Independent Review is available by the Ombudsman. The protester may file a formal agency protest to either the Contracting Officer or as an alternative to that, the Ombudsman under the OPAP program. Contract award or performance will be suspended during the protest period unless contract award or performance is justified, in writing, for urgent and compelling reasons or is determined in writing to be in the best interest of the government. The agency’s goal is to resolve protests in less than 35 calendar days from the date of filing. Protests shall include the information set forth in FAR 33.103(d)(2). If the protester fails to submit the required information, resolution of the protest may be delayed or the protest may be dismissed. To be timely protests must be filed within the period specified in FAR 33.103(e). Formal protests filed under the OPAP program should be submitted electronically to OPAP@uscg.mil and the Contracting Officer or by hand delivery to the Contracting Officer.Election of Forum. After an interested party protests a Coast Guard procurement to the Contracting Officer or the Ombudsman, and while the protest is pending, the protester agrees not to file a protest with the GAO or other external forum. If the protest is filed with an external forum, the agency protest will be dismissed.", "chunk_id": 1, "page_no": 2}, {"chunk": "RFP: 70Z04424RESIAB01---2INTRODUCTION / INDEX---INTRODUCTION: The United States Coast Guard (USCG) has a requirement for the service described in Attachment 1, Scope of Work (SOW).This RFP is issued, and award will be made, in accordance with the Federal Acquisition Regulation (FAR) Subpart 12.6, Streamlined Procedures for Evaluation and Solicitation for Commercial Items in conjunction with Subpart 15.2, Solicitation and Receipt of Proposals and Information. FAR Part 12 shall take precedent in the event of a conflict. Task Orders (TOs) will be in accordance with FAR Part 16.5 Fair Opportunity.The RMF Support Services requirements will be solicited as a 100% 8(a) competitive set-aside acquisition for commercial services. The Government intends to award a single-award Indefinite Delivery Indefinite Quantity (IDIQ) 8(a) contract resulting from this RFP, however the Government reserves the right to withdraw, modify, or eliminate various aspects of the requirement determined to be too costly or impractical prior to award.CONTRACT: Single-Award Indefinite Delivery/Indefinite Quantity (IDIQ) Contract---CONTRACT TYPE: Indefinite Delivery/Indefinite Quantity (IDIQ) with Fixed Price type task orders---NAICS CODE: 541519; Size Standard $34M---INSTRUCTIONS FOR SUBMITTING A PROPOSAL: See Section E---QUESTIONS: All questions regarding this RFP shall be submitted via e-mail (no telephone calls) on Exhibit 2, Question and Comment Form, to the Contract Specialist (listed below) so that they can be addressed before proposals are due.Contractors shall reference the RFP number in the subject line of their e-mail and provide enough information in their e-mail so the Government can easily respond to their questions/concerns/assumptions. All questions/concerns/assumptions that are received in reference to this RFP will be compiled, answered, and posted to SAM.gov by Amendment to the RFP.", "chunk_id": 2, "page_no": 3}, {"chunk": "Submit Questions To: Eric.R.St.Pierre@uscg.mil, and Jessica.L.Coltz@uscg.mil---Deadline for Submission of Questions: See RFP Cover Page---RFP: 70Z04424RESIAB01---3INDEX---The below Sections will be included in the Award Document Section A – Standard Form (SF) 1449 Section B – Schedule of Supplies or Services / CLINs Section C – Contract Clauses Section D – Contract Documents, Exhibits, and AttachmentsThe below Sections will not be included in the Award Document Section E – Solicitation ProvisionsSection E – Instructions to Offerors – Commercial Items Section E – Evaluation – Commercial ItemsRFP: 70Z04424RESIAB01---4B. SCHEDULE OF SUPPLIES OR SERVICES AND PRICE/COST---B.1 General Description The Contractor shall perform work as set forth in general terms in the attached Scope of Work (SOW) (Attachment 1). Detailed support services to be performed shall be identified in each individual Task Order (TO) issued against the primary Indefinite Quantity/Indefinite Delivery (IDIQ) contract awarded.B.2 Contract/IDIQ The term of the RMF Support Services contract is a five (5) year ordering period. This is not a multi-year contract as defined in FAR Part 17.1, Multiyear Contracting.B.3 Contract/IDIQ Administration/Management Notwithstanding the Contractor’s responsibility for total management during the performance of the Contract, the administration at the Contract level will require coordination between the Government and the Contractor. The U.S. Coast Guard, C5I Contracting and Procurement, CG-914, Contracting Office will perform all Contract administration and overall Task Order oversight. The individuals listed below in B.4 and B.5 will be the Government points of contact during the performance period.", "chunk_id": 3, "page_no": 5}, {"chunk": "Contracting Office:---U.S. Coast Guard C5I Contracting and Procurement, CG-914 4000 Coast Guard Blvd., Annex 4 Portsmouth, VA 23703-2199B.4 Contract/IDIQ Contracting Officer (KO) The Contracting Officer (KO) is responsible for ensuring performance of all necessary actions for effective contracting, ensuring compliance with the contract terms, and safeguarding the interests of the United States in the contractual relationship. The KO is responsible for ensuring that the Contractor receives impartial, fair, and equitable treatment under this contract. The KO is ultimately responsible for the final determination of the adequacy of the Contractor’s performance, to include, but not limited to (1) Provide scope oversight; (2) Ensure compliance with contract requirements; (3) Issue the Contracting Officer's final decision and handle all contract-level contractual disputes under the Contract Disputes Act; and (4) Place all contract modifications against the Contract. Communications pertaining to contractual administrative matters for this IDIQ shall be addressed to the KO listed below.Contracting Officer: Jessica L. Coltz---Telephone #: E-Mail: Jessica.L.Coltz@uscg.mil---(757) 686-6846B.5 Contract/IDIQ Administrator (Contract Specialist) The Contract Specialist (KS) serves as the point of contact between the Contractor and the Contracting Officer for this Contract; however, this person does not have a warrant that provides the authority to contractually commit the Government and is not authorized to change any of the terms and conditions of the Contract.", "chunk_id": 4, "page_no": 5}, {"chunk": "Contract Specialist: Eric R. St. Pierre---Telephone #: (757) 638-2741 E-Mail: Eric.R.St.Pierre@uscg.mil---B.6 Contract/IDIQ Contracting Officer’s Representative (COR) The COR is a Government employee designated in writing by the Contracting Officer to act as a technical advisor for the Contracting Officer for items within the scope of this Contract. The COR performs functions such as review and/or inspection and acceptance of supplies and services and of a technical nature. A COR Appointment Letter will provide the name and contact information of the COR and set forth the authorities and limitations of the COR under the contract. A COR does not have a warrant that providesRFP: 70Z04424RESIAB01---5the authority to contractually commit the Government and is not authorized to change any of the terms and conditions of the Contract.B.7 Ordering/Task Order (TO) Contracting Officer, Contract Specialist, and COR To Be Determined at time of TO solicitation/award. Only a warranted Contracting Officer may place task/delivery orders against the IDIQ. The primary users are U.S. Coast Guard C5ISC.B.8 Ordering/Task Order – By Designated Ordering Official The TO KO will order services to be furnished under this contract by issuing TOs, in accordance with FAR Part 52.216-18 Ordering, and 52.216-19 Order Limitations, on Optional Form 347, or an agency prescribed form, within the contract ordering period. The TO KO will be responsible for the issuance, administration, reporting, payment and closeout of the TO. All TOs are subject to the terms and conditions of this contract. This contract shall take precedent in the event of a conflict with any TO.B.9 Ordering/Task Order Responsibilities Each TO KO has the primary responsibility for the administration of TOs placed with the Contractor to include, but not limited to (1) Issue and administer the TO to include all TO modifications; (2) Ensuring that TOs are within the scope of the contract; (3) Administering and final closeout of TOs; (4) Performing (in conjunction with the TO COR) inspection and acceptance or rejection of the equipment/services provided by the Contractor; and (5) Making payment, withholds, or partial payment of invoices.B.10 Invoicing Schedule The Contractor shall submit invoices monthly, unless otherwise approved by the KO, for CLINs completed / received, inspected, and accepted by the Government.The Coast Guard will process invoice payment requests for your award through the Invoice Processing Platform (IPP) at https://www.ipp.gov/. IPP is a government-wide, secure web-based payment information service offered free of charge to government agencies and their suppliers by the U.S. Department of Treasury’s Bureau of the Fiscal Service.B.11 Electronic Submission of Payment Requests (a) Definitions. As used in these instructions - (1) “Payment request” means a bill, voucher, invoice, or request for contract financing payment with associated supporting documentation. The payment request must: comply with the requirements identified in FAR 32.905(b), “Content of Invoices” and the applicable Payment clause included in this contract. In addition, discount offerings and small business status if available shall be stated. If travel was allowable and approved, components in accordance with FAR 31.205-46 shall be provided.(b) Except as provided in paragraph (c) of this clause, the contractor shall submit payment requests electronically using the Invoice Processing Platform (IPP). Information regarding IPP, including IPP Customer Support contact information, is available at www.ipp.gov or any successor site.(c) The contractor may submit payment requests using a method other than IPP only when the contracting officer authorizes alternate procedures in writing in accordance with Coast Guard procedures.(d) If alternate payment procedures are authorized, the contractor shall include a copy of the contracting officer's written authorization with each payment request.(e) IPP enrollment information is at https://www.uscg.mil/fincen/IPP/.", "chunk_id": 5, "page_no": 6}, {"chunk": "B.12 System for Award Management (SAM)---RFP: 70Z04424RESIAB01---6The contractor shall be registered in the SAM database prior to award, during performance, and through final payment of all Orders and closeout of the Contract.B.13 Contract Type and Pricing The USCG anticipates awarding a single IDIQ type contract with Firm-Fixed-Price (FFP) type task orders (TO). Firm-Fixed-Price (FFP) is defined under FAR 16.201, Fixed-Price Contracts, and other applicable agency-specific regulatory supplements.B.14 Contract Line Item (CLIN) and Contract Type by CLIN See Attachment 4, IDIQ Pricing Rates.Government identified labor categories are included in Attachment 4, IDIQ Pricing Rates. The fully burdened labor rates included in Attachment 4, IDIQ Pricing Rates, are the maximum firm-fixed-price rates allowable for performance of requirements as specified in TOs. Additional labor categories not specified within the IDIQ Attachment 4 may be proposed at the TO level to meet specific TO requirements. Labor categories not specified within the IDIQ Attachment 4 consistently required at the TO level to meet specific TO requirements, may result in the modification of Attachment 4 to incorporate these additional labor categories at the IDIQ level by the Contracting Officer.The markup percentages for Travel and ODCs (Subcontracts and Material) costs and ceiling labor rates contained in Attachment 4, IDIQ Pricing Rates, will not be revised over the life of the contract. Years 2 – 5 include escalation based on Year 1 which reflect the Offeror’s best judgement.B.15 MINIMUM and MAXIMUM QUANTITIES In accordance with paragraph (b) of the “Indefinite Quantity” clause, the guaranteed minimum amount to be ordered under this contract is $10,000.00. The contract maximum is the total awarded IDIQ maximum estimated value of $160M.B.16 Task Order (TO) Procedures The Contractor’s services shall be obtained on an as-needed basis (i.e., through the issuance of TOs). The Contractor shall perform the required effort for these services, within CONUS locations, throughout the term of this contract.B.17 Task Order (TO) Performance Period and Pricing TOs may be issued at any time during the five (5) year contract ordering period. The performance period of each TO will be specified in the TO and may include option periods which, if exercised, may extend the TO period of performance beyond the IDIQ 5-year ordering period.All non-severable TOs issued under the CEDISS IDIQ contract must be completed within 24 months after the expiration of the IDIQ (excluding exercise of options under FAR 52.217-8).All severable TOs must be completed within 12 months after the expiration of the IDIQ (excluding exercise of options under FAR 52.217-8).B.18 Delivery The IDIQ deliverables are identified in Exhibit A. The items required under each individual TO shall be delivered and received at destination within the timeframe specific in each TO.B.19 Accounting and Appropriation Data Accounting and appropriation data for obligations under the contract will be set forth within individual TOs.(END OF SECTION)", "chunk_id": 6, "page_no": 7}, {"chunk": "C. CONTRACT CLAUSES---RFP: 70Z04424RESIAB01---7FAR Clause 52.252-2, Clauses Incorporated By Reference (FEB 1998) This contract incorporates one or more clauses by reference, with the same force and effect as if they were given in full text. Upon request, the Contracting Officer will make their full text available. Also, the full text of a clause may be accessed electronically at this/these address(es): http://www.acquisition.gov/far/(End of clause)---FAR Clause 52.252-6, Authorized Deviations in Clauses. (NOV 2020) (a) The use in this solicitation or contract of any Federal Acquisition Regulation (48 CFR Chapter 1) clause with an authorized deviation is indicated by the addition of \"(DEVIATION)\" after the date of the clause.(b) The use in this solicitation or contract of any Homeland Security Acquisition Regulation (48 CFR Chapter 30) clause with an authorized deviation is indicated by the addition of \"(DEVIATION)\" after the name of the regulation.(End of clause)---Clauses Incorporated by Reference---Clause No. Title 52.204-2 52.204-9 52.204-13 52.204-18 52.212-4Date AUG 1996 JAN 2011 OCT 2018 AUG 2020 DEC 2022Security Requirements Personal Identity Verification of Contractor Personnel System for Award Management Maintenance Commercial and Government Entity Code Maintenance Contract Terms and Conditions – Commercial Products and Commercial Services Rights in Data – General Stop Work Order52.227-14 52.242-15MAY 2014 AUG 1989FAR Clause 52.203-17, Contractor Employee Whistleblower Rights and Requirement To Inform Employees of Whistleblower Rights. (SEPT 2013) (DEVIATION 14-01) a) This contract and employees working on this contract will be subject to the whistleblower rights and remedies in the enhancement of whistleblower protections for Contractor employees established at 10 U.S.C. 2409 by section 827 of the NDAA for FY2013 (Pub. L. 112-239) and FAR 3.908. (b) The Contractor shall inform its employees in writing, in the predominant language of the workforce, of employee whistleblower rights and protections under 10 U.S.C. 2409, as described in section 3.908 of the FAR. (c) The Contractor shall insert the substance of this clause, including this paragraph (c), in all subcontracts over the simplified acquisition threshold.", "chunk_id": 7, "page_no": 8}, {"chunk": "(End of Clause)---FAR Clause 52.204-1, Approval of Contract (Dec 1989) This contract is subject to the written approval of the U.S. Coast Guard Head of Contracting Activity (HCA), or designee and shall not be binding until so approved.(End of clause)---FAR Clause 52.204-23, Prohibition on Contracting for Hardware, Software, and Services Developed or Provided by Kaspersky Lab and Other Covered Entities. (APR 2020) (DEVIATION 20-05) (a) Definitions. As used in this clause- \"Covered article\" means any hardware, software, or service that- (1) Is developed or provided by a covered entity; (2) Includes any hardware, software, or service developed or provided in whole or in part by a covered entity; or (3) Contains components using any hardware or software developed in whole or in part by a covered entity.RFP: 70Z04424RESIAB01---8\"Covered entity\" means- (1) Kaspersky Lab; (2) Any successor entity to Kaspersky Lab; (3) Any entity that controls, is controlled by, or is under common control with Kaspersky Lab; or (4) Any entity of which Kaspersky Lab has a majority ownership. (b) Prohibition. Section 1634 of Division A of the National Defense Authorization Act for Fiscal Year 2018 (Pub. L. 115-91) prohibits Government use of any covered article. The Contractor is prohibited from- (1) Providing any covered article that the Government will use on or after October 1, 2018; and (2) Using any covered article on or after October 1, 2018, in the development of data or deliverables first produced in the performance of the contract. (c) Reporting requirement. (1) In the event the Contractor identifies covered article provided to the Government during contract performance, or the Contractor is notified of such by a subcontractor at any tier or by any other source, the Contractor shall report, in writing, via email, to the Contracting Officer, Contracting Officer's Representative, and the Enterprise Security Operations Center (SOC) at NDAA Incidents@hq.dhs.gov, with required information in the body of the email. In the case of the Department ofDefense, the Contractor shall report to the website at https://dibnet.dod.mil. For indefinite delivery contracts, the Contractor shall report to the Enterprise SOC, Contracting Officer for the indefinite delivery contract and the Contracting Officer(s) and Contracting Officer's Representative(s) for any affected order or, in the case of the Department of Defense, identify both the indefinite delivery contract and any affected orders in the report provided at https://dibnet.dod.mil. (2) The Contractor shall report the following information pursuant to paragraph (c)(1) of this clause: (i) Within 1 business day from the date of such identification or notification: the contract number; the order number( s ), if applicable; supplier name; brand; model number (Original Equipment Manufacturer (OEM) number, manufacturer part number, or wholesaler number); item description; and any readily available information about mitigation actions undertaken or recommended. (ii) Within 10 business days of submitting the report pursuant to paragraph (c)(l) of this clause: any further available information about mitigation actions undertaken or recommended. In addition, the Contractor shall describe the efforts it undertook to prevent use or submission of a covered article, any reasons that led to the use or submission of the covered article, and any additional efforts that will be incorporated to prevent future use or submission of covered articles. (c) Subcontracts. The Contractor shall insert the substance of this clause, including this paragraph (d), in all subcontracts, including subcontracts for the acquisition of commercial items.", "chunk_id": 8, "page_no": 9}, {"chunk": "(End of clause)---FAR Clause 52.204-25, Prohibition on Contracting for Certain Telecommunications and Video Surveillance Services or Equipment. (DEC 2020) (DEVIATION 20-05, Revision 2) (a) Definitions. As used in this clause- \"Backhaul\" means intermediate links between the core network, or backbone network, and the small subnetworks at the edge of the network ( e.g., connecting cell phones/towers to the core telephone network). Backhaul can be wireless (e.g., microwave) or wired (e.g., fiber optic, coaxial cable, Ethernet). \"Covered foreign country\" means The People's Republic of China. \"Covered telecommunications equipment or services\" means- (1) Telecommunications equipment produced by Huawei Technologies Company or ZTE Corporation (or any subsidiary or affiliate of such entities); (2) For the purpose of public safety, security of Government facilities, physical security surveillance of critical infrastructure, and other national security purposes, video surveillance and telecommunications equipment produced by Hytera Communications Corporation, Hangzhou Hikvision Digital Technology Company, or Dahua Technology Company ( or any subsidiary or affiliate of such entities); (3) Telecommunications or video surveillance services provided by such entities or using such equipment; or (4) Telecommunications or video surveillance equipment or services produced or provided by an entity that the Secretary of Defense, in consultation with the Director of National Intelligence or the Director of the", "chunk_id": 9, "page_no": 9}, {"chunk": "RFP: 70Z04424RESIAB01---9Federal Bureau of Investigation, reasonably believes to be an entity owned or controlled by, or otherwise connected to, the government of a covered foreign country. \"Critical technology\" means- (1) Defense articles or defense services included on the United States Munitions List set forth in the International Traffic in Arms Regulations under subchapter M of chapter I of title 22, Code of Federal Regulations; (2) Items included on the Commerce Control List set forth in Supplement No. 1 to part 774 of the Export Administration Regulations under subchapter C of chapter VII of title 15, Code of Federal Regulations, and controlled- (i) Pursuant to multilateral regimes, including for reasons relating to national security, chemical and biological weapons proliferation, nuclear nonproliferation, or missile technology; or (ii) For reasons relating to regional stability or surreptitious listening; (3) Specially designed and prepared nuclear equipment, parts and components, materials, software, and technology covered by part 810 of title 10, Code of Federal Regulations (relating to assistance to foreign atomic energy activities); (4) Nuclear facilities, equipment, and material covered by part 110 of title 10, Code of Federal Regulations (relating to export and import of nuclear equipment and material); (5) Select agents and toxins covered by part 331 of title 7, Code of Federal Regulations, part 121 of title 9 of such Code, or part 73 of title 42 of such Code; or (6) Emerging and foundational technologies controlled pursuant to section 1758 of the Export Control Reform Act of2018 (50 U.S.C. 4817). \"Interconnection arrangements\" means arrangements governing the physical connection of two or more networks to allow the use of another's network to hand off traffic where it is ultimately delivered ( e.g., connection of a customer of telephone provider A to a customer of telephone company B) or sharing data and other information resources. \"Reasonable inquiry\" means an inquiry designed to uncover any information in the entity's possession about the identity of the producer or provider of covered telecommunications equipment or services used by the entity that excludes the need to include an internal or third-party audit. \"Roaming\" means cellular communications services (e.g., voice, video, data) received from a visited network when unable to connect to the facilities of the home network either because signal coverage is too weak or because traffic is too high. \"Substantial or essential component\" means any component necessary for the proper function or performance of a piece of equipment, system, or service. (b) Prohibition. (1) Section 889(a)(l)(A) of the John S. McCain National Defense Authorization Act for Fiscal Year 2019 (Pub. L. 115-232) prohibits the head of an executive agency on or after August 13, 2019, from procuring or obtaining, or extending or renewing a contract to procure or obtain, any equipment, system, or service that uses covered telecommunications equipment or services as a substantial or essential component of any system, or as critical technology as part of any system. The Contractor is prohibited from providing to the Government any equipment, system, or service that uses covered telecommunications equipment or services as a substantial or essential component of any system, or as critical technology as part of any system, unless an exception at paragraph (c) of this clause applies or the covered telecommunication equipment or services are covered by a waiver described in FAR 4.2104. (2) Section 889(a)(l)(B) of the John S. McCain National Defense Authorization Act for Fiscal Year 2019 (Pub. L. 115-232) prohibits the head of an executive agency on or after August 13, 2020, from entering into a contract, or extending or renewing a contract, with an entity that uses any equipment, system, or service that uses covered telecommunications equipment or services as a substantial or essential component of any system, or as critical technology as part of any system, unless an exception at paragraph (c) of this clause applies or the covered telecommunication equipment or services are covered by a waiver described in FAR 4 .2104. This prohibition applies to the use of covered telecommunications equipment or services, regardless of whether that use is in performance of work under a Federal contract. (c) Exceptions. This clause does not prohibit contractors from providing-", "chunk_id": 10, "page_no": 10}, {"chunk": "RFP: 70Z04424RESIAB01---10(1) A service that connects to the facilities of a third-party, such as backhaul, roaming, or interconnection arrangements; or (2) Telecommunications equipment that cannot route or redirect user data traffic or permit visibility into any user data or packets that such equipment transmits or otherwise handles. (d) Reporting requirement. (1) In the event the Contractor identifies covered telecommunications equipment or services used as a substantial or essential component of any system, or as critical technology as part of any system, during contract performance, or the Contractor is notified of such by a subcontractor at any tier or by any other source, the Contractor shall report the information in paragraph (d)(2) of this clause in writing via email to the Contracting Officer, Contracting Officer's Representative, and the Network Operations Security Center (NOSC) at NDAA Incidents@hg.dhs.gov, with required information in the body of the email. In the case of the Department of Defense, the Contractor shall report to the website at https://dibnet.dod.mil. For indefinite delivery contracts, the Contractor shall report to the NOSC, Contracting Officer for the indefinite delivery contract and the Contracting Officer(s) and Contracting Officer's Representative(s) for any affected order or, in the case of the Department of Defense, identify both the indefinite delivery contract and any affected orders in the report provided at https://dibnet.dod.mil. (2) The Contractor shall report the following information pursuant to paragraph (d)(l) of this clause (i) Within one business day from the date of such identification or notification: the contract number; the order number( s ), if applicable; supplier name; supplier unique entity identifier (if known); supplier Commercial and Government Entity (CAGE) code (if known); brand; model number (original equipment manufacturer number, manufacturer part number, or wholesaler number); item description; and any readily available information about mitigation actions undertaken or recommended. (ii) Within 10 business days of submitting the information in paragraph (d)(2)(i) of this clause: any further available information about mitigation actions undertaken or recommended. In addition, the Contractor shall describe the efforts it undertook to prevent use or submission of covered telecommunications equipment or services, and any additional efforts that will be incorporated to prevent future use or submission of covered telecommunications equipment or services. (e) Subcontracts. The Contractor shall insert the substance of this clause, including this paragraph (e) and excluding paragraph (b)(2), in all subcontracts and other contractual instruments, including subcontracts for the acquisition of commercial items.", "chunk_id": 11, "page_no": 11}, {"chunk": "(End of clause)---FAR Clause 52.216-18, Ordering (Aug 2020)---(a) Any supplies and services to be furnished under this contract shall be ordered by issuance of delivery orders or task orders by the individuals or activities designated in the Schedule. Such orders may be issued from date of award through five years after date of award.(b) All delivery orders or task orders are subject to the terms and conditions of this contract. In the event of conflict between a delivery order or task order and this contract, the contract shall control.(c) A delivery order or task order is considered \"issued\" when—(1) If sent by mail (includes transmittal by U.S. mail or private delivery service), the Governmentdeposits the order in the mail;---(1) If sent by fax, the Government transmits the order to the Contractor's fax number; or(2) If sent electronically, the Government either—(i) Posts a copy of the delivery order or task order to a Government document access system, andnotice is sent to the Contractor; or(ii) Distributes the delivery order or task order via email to the Contractor's email address.RFP: 70Z04424RESIAB01---11(d) Orders may be issued by methods other than those enumerated in this clause only if authorized in the contract.(End of clause)---FAR Clause 52.216-19, Order Limitations (Oct 1995) (a) Minimum order. When the Government requires supplies or services covered by this contract in an amount of less than $25.00 the Government is not obligated to purchase, nor is the Contractor obligated to furnish, those supplies or services under the contract.(b) Maximum order. The Contractor is not obligated to honor— (1) Any order for a single item in excess of $4,000,000.00; (2) Any order for a combination of items in excess of $4,000,000.00; or (3) A series of orders from the same ordering office within 2 days that together call for quantities exceeding the limitation in paragraph (b)(1) or (2) of this section.(c) If this is a requirements contract (i.e., includes the Requirements clause at subsection 52.216-21 of the Federal Acquisition Regulation (FAR)), the Government is not required to order a part of any one requirement from the Contractor if that requirement exceeds the maximum-order limitations in paragraph (b) of this section.(d) Notwithstanding paragraphs (b) and (c) of this section, the Contractor shall honor any order exceeding the maximum order limitations in paragraph (b), unless that order (or orders) is returned to the ordering office within 5 days after issuance, with written notice stating the Contractor’s intent not to ship the item (or items) called for and the reasons. Upon receiving this notice, the Government may acquire the supplies or services from another source.", "chunk_id": 12, "page_no": 12}, {"chunk": "(End of clause)---FAR Clause 52.216-22, Indefinite Quantity (Oct 1995) (a) This is an indefinite-quantity contract for the supplies or services specified, and effective for the period stated, in the Schedule. The quantities of supplies and services specified in the Schedule are estimates only and are not purchased by this contract.(b) Delivery or performance shall be made only as authorized by orders issued in accordance with the Ordering clause. The Contractor shall furnish to the Government, when and if ordered, the supplies or services specified in the Schedule up to and including the quantity designated in the Schedule as the “maximum.” The Government shall order at least the quantity of supplies or services designated in the Schedule as the “minimum.”(c) Except for any limitations on quantities in the Order Limitations clause or in the Schedule, there is no limit on the number of orders that may be issued. The Government may issue orders requiring delivery to multiple destinations or performance at multiple locations.(d) Any order issued during the effective period of this contract and not completed within that period shall be completed by the Contractor within the time specified in the order. The contract shall govern the Contractor’s and Government’s rights and obligations with respect to that order to the same extent as if the order were completed during the contract’s effective period; provided, that the Contractor shall not be required to make any deliveries under this contract after 11 October 2029.", "chunk_id": 13, "page_no": 12}, {"chunk": "(End of clause)---FAR Clause 52.217-8, Option to Extend Services (NOV 1999) The Government may require continued performance of any services within the limits and at the rates specified in the contract. These rates may be adjusted only as a result of revisions to prevailing labor rates provided by the Secretary of Labor. The option provision may be exercised more than once, but the totalRFP: 70Z04424RESIAB01---12extension of performance hereunder shall not exceed six (6) months. The Contracting Officer may exercise the option by written notice to the Contractor at least 15 calendar days before the contract expires.(End of clause)---FAR Clause 52.217-9, Option to Extend the Term of the Contract (MAR 2000) (Applicable to Task Orders) (a) The Government may extend the term of issued task orders by written notice to the Contractor prior to the expiration of the task order; provided that the Government gives the Contractor a preliminary written notice of its intent to extend at least five (5) days before the task order expires. The preliminary notice does not commit the Government to an extension.(b) If the Government exercises this option, the extended task order shall be considered to include this option clause.(c) The total duration of this task order, including the exercise of any options under this clause, shall not exceed IDIQ terms (See B.17) plus six (6) months under 52.217-8.", "chunk_id": 14, "page_no": 13}, {"chunk": "(End of Clause)---FAR Clause 52.219-14, Limitations on Subcontracting. (OCT 2021) (DEVIATION 22-02) (a) This clause does not apply to the unrestricted portion of a partial set-aside. (b) Definition. Similarly situated entity, as used in this clause, means a first-tier subcontractor, including an independent contractor, that— (1) Has the same small business program status as that which qualified the prime contractor for the award (e.g., for a small business set-aside contract, any small business concern, without regard to its socioeconomic status); and (2) Is considered small for the size standard under the North American Industry Classification System (NAICS) code the prime contractor assigned to the subcontract. (c) Applicability. This clause applies only to— (1) Contracts that have been set aside for any of the small business concerns identified in 19.000(a)(3); (2) Part or parts of a multiple-award contract that have been set aside for any of the small business concerns identified in 19.000(a)(3); (3) Contracts that have been awarded on a sole-source basis in accordance with subparts 19.8, 19.13, 19.14, and 19.15; (4) Orders expected to exceed the simplified acquisition threshold and that are— (i) Set aside for small business concerns under multiple-award contracts, as described in 8.405-5 and 16.505(b)(2)(i)(F); or (ii) Issued directly to small business concerns under multiple-award contracts as described in 19.504(c)(1)(ii); (5) Orders, regardless of dollar value, that are— (i) Set aside in accordance with subparts 19.8, 19.13, 19.14, or 19.15 under multiple award contracts, as described in 8.405-5 and 16.505(b)(2)(i)(F); or (ii) Issued directly to concerns that qualify for the programs described in subparts 19.8, 19.13, 19.14, or 19.15 under multiple-award contracts, as described in 19.504(c)(1)(ii); and (6) Contracts using the HUBZone price evaluation preference to award to a HUBZone small business concern unless the concern waived the evaluation preference. (d) Independent contractors. An independent contractor shall be considered a subcontractor. (e) Limitations on subcontracting. By submission of an offer and execution of a contract, the Contractor agrees to the following requirements in the performance of a contract assigned a North American Industry Classification System (NAICS) code applicable to this contract: (1) Services (except construction). It will not pay more than 50 percent of the amount paid by the Government for contract performance, excluding certain other direct costs and certain work performed outside the United States (see paragraph (e)(1)(i)), to subcontractors that are not similarly situated entities. Any work that a", "chunk_id": 15, "page_no": 13}, {"chunk": "RFP: 70Z04424RESIAB01---13similarly situated entity further subcontracts will count towards the prime contractor’s 50 percent subcontract amount that cannot be exceeded. When a contract includes both services and supplies, the 50 percent limitation shall apply only to the service portion of the contract. (i) The following services may be excluded from the 50 percent limitation: (A) Other direct costs, to the extent they are not the principal purpose of the acquisition and small business concerns do not provide the service. Examples include airline travel, work performed by a transportation or disposal entity under a contract assigned the environmental remediation NAICS code (562910), cloud computing services, or mass media purchases. (B) Work performed outside the United States on awards made pursuant to the Foreign Assistance Act of 1961, or work performed outside the United States required to be performed by a local contractor. (2) Supplies (other than procurement from a nonmanufacturer of such supplies). It will not pay more than 50 percent of the amount paid by the Government for contract performance, excluding the cost of materials, to subcontractors that are not similarly situated entities. Any work that a similarly situated entity further subcontracts will count towards the prime contractor’s 50 percent subcontract amount that cannot be exceeded. When a contract includes both supplies and services, the 50 percent limitation shall apply only to the supply portion of the contract. (3) General construction. It will not pay more than 85 percent of the amount paid by the Government for contract performance, excluding the cost of materials, to subcontractors that are not similarly situated entities. Any work that a similarly situated entity further subcontracts will count towards the prime contractor’s 85 percent subcontract amount that cannot be exceeded. (4) Construction by special trade contractors. It will not pay more than 75 percent of the amount paid by the Government for contract performance, excluding the cost of materials, to subcontractors that are not similarly situated entities. Any work that a similarly situated entity further subcontracts will count towards the prime contractor’s 75 percent subcontract amount that cannot be exceeded. (f) The Contractor shall comply with the limitations on subcontracting as follows: (1) For contracts, in accordance with paragraphs (c)(1), (2), (3) and (6) of this clause – [Contracting Officer check as appropriate.] __ By the end of the base term of the contract and then by the end of each subsequent option period; or X By the end of the performance period for each order issued under the contract. (2) For orders, in accordance with paragraphs (c)(4) and (5) of this clause, by the end of the performance period for the order. (g) A joint venture agrees that, in the performance of the contract, the applicable percentage specified in paragraph (e) of this clause will be performed by the aggregate of the joint venture participants.", "chunk_id": 16, "page_no": 14}, {"chunk": "(End of Clause)---FAR Clause 52.219-17, Section 8(a) Award (Oct 2019) (a) By execution of a contract, the Small Business Administration (SBA) agrees to the following: (1) To furnish the supplies or services set forth in the contract according to the specifications and the terms and conditions by subcontracting with the Offeror who has been determined an eligible concern pursuant to the provisions of section 8(a) of the Small Business Act, as amended (15 U.S.C. 637(a)).(2) Except for novation agreements, delegates to the Department of Homeland Security, U.S. Coast Guard, C5I Contracting and Procurement, CG-914, the responsibility for administering the contract with complete authority to take any action on behalf of the Government under the terms and conditions of the contract; provided, however that the contracting agency shall give advance notice to the SBA before it issues a final notice terminating the right of the subcontractor to proceed with further performance, either in whole or in part, under the contract.(3) That payments to be made under the contract will be made directly to the subcontractor by the contracting activity.RFP: 70Z04424RESIAB01---14(4) To notify the Department of Homeland Security, U.S. Coast Guard, C5I Contracting and Procurement, CG-914 Contracting Officer immediately upon notification by the subcontractor that the owner or owners upon whom 8(a) eligibility was based plan to relinquish ownership or control of the concern.(5) That the subcontractor awarded a subcontract hereunder shall have the right of appeal from decisions of the cognizant Contracting Officer under the “Disputes” clause of the subcontract.(b) The offeror/subcontractor agrees and acknowledges that it will, for and on behalf of the SBA, fulfill and perform all of the requirements of the contract.(c) The offeror/subcontractor agrees that it will not subcontract the performance of any of the requirements of this subcontract to any lower tier subcontractor without the prior written approval of the SBA and the cognizant Contracting Officer of the Department of Homeland Security, Federal Protective Service.", "chunk_id": 17, "page_no": 15}, {"chunk": "(End of Clause)---FAR Clause 52.219-18, Notification of Competition Limited to Eligible 8(a) Concerns – Alternate III (NOV 2005) (DEVIATION 06-02) (a) Offers are solicited only from small business concerns expressly certified by the Small Business Administration (SBA) for participation in the SBA’s 8(a) Program and which meet the following criteria at the time of submission of offer- (1) The Offeror is in conformance with the 8(a) support limitation set forth in its approved business plan; and (2) The Offeror is in conformance with the Business Activity Targets set forth in its approved business plan or any remedial action directed by the SBA. (b) By submission of its offer, the Offeror represents that it meets all of the criteria set forth in paragraph (a) of this clause. (c) Any award resulting from this solicitation will be made directly by the Contracting Officer to the successful 8(a) offeror selected through the evaluation criteria set forth in this solicitation. (d) The SBA's 8(a) contractor will notify the U.S. Coast Guard Contracting Officer in writing immediately upon entering an agreement (either oral or written) to transfer all or part of its stock.(End of Clause)---FAR Clause 52.224-3, Privacy Training, Alternate I. (DEVIATION 17-03) (a) Definition. As used in this clause, “personally identifiable information” means information that can be used to distinguish or trace an individual's identity, either alone or when combined with other information that is linked or linkable to a specific individual. (See Office of Management and Budget (OMB) Circular A-130, Managing Federal Information as a Strategic Resource). (b) The Contractor shall ensure that initial privacy training, and annual privacy training thereafter, is completed by contractor employees who– (1) Have access to a system of records; (2) Create, collect, use, process, store, maintain, disseminate, disclose, dispose, or otherwise handle personally identifiable information on behalf of an agency; or (3) Design, develop, maintain, or operate a system of records (see also FAR subpart 24.1 and 39.105). (c) The contracting agency will provide initial privacy training, and annual privacy training thereafter, to Contractor employees for the duration of this contract. Contractor employees shall satisfy this requirement by completing Privacy at DHS: Protecting Personal Information accessible at https://www.dhs.gov/dhs-security- and-training-requirements-contractors. Training shall be completed within 30 days of contract award and be completed on an annual basis thereafter not later than October 31st of each year. (d) The Contractor shall maintain and, upon request, provide documentation of completion of privacy training to the Contracting Officer. (e) The Contractor shall not allow any employee access to a system of records, or permit any employee to create, collect, use, process, store, maintain, disseminate, disclose, dispose or otherwise handle personally", "chunk_id": 18, "page_no": 15}, {"chunk": "RFP: 70Z04424RESIAB01---15identifiable information, or to design, develop, maintain, or operate a system of records unless the employee has completed privacy training, as required by this clause. (f) The substance of this clause, including this paragraph (f), shall be included in all subcontracts under this contract, when subcontractor employees will– (1) Have access to a system of records; (2) Create, collect, use, process, store, maintain, disseminate, disclose, dispose, or otherwise handle personally identifiable information; or (3) Design, develop, maintain, or operate a system of records. (End of Clause)FAR Clause 52.232-40, Providing Accelerated Payments to Small Business Subcontractors. (DEC 2013) (DEVIATION 20-04, Revision 1) (a)(l) In accordance with 31 U.S.C. 3903 and 10 U.S.C. 2307, upon receipt of accelerated payments from the Government, the Contractor shall make accelerated payments to its small business subcontractors under this contract in accordance with the accelerated payment date established, to the maximum extent practicable and prior to when such payment is otherwise required under the applicable contract or subcontract, with a goal of 15 days after receipt of a proper invoice and all other required documentation from the small business subcontractor if a specific payment date is not established by contract. (2) The Contractor agrees to make such payments to its small business subcontractors without any further consideration from or fees charged to the subcontractor. (b) The acceleration of payments under this clause does not provide any new rights under the Prompt Payment Act. (c) Include the substance of this clause, including this paragraph (c), in all subcontracts with small business concerns, including subcontracts with small business concerns for the acquisition of commercial items.", "chunk_id": 19, "page_no": 16}, {"chunk": "(End of Clause)---HSAR 3052.212-70 Contract Terms and Conditions Applicable to DHS Acquisition of Commercial Items (SEP 2012) The Contractor agrees to comply with any provision or clause that is incorporated herein by reference to implement agency policy applicable to acquisition of commercial items or components. The provision or clause in effect based on the applicable regulation cited on the date the solicitation is issued applies unless otherwise stated herein. The following provisions and clauses are incorporated by reference:(a) Provisions. None.---(b) Clauses. 3052.203-70, Instructions for Contractor Disclosure of Violations. 3052.204-71, Contractor Employee Access, Alternate 1. 3052.205-70, Advertisement, Publicizing Awards, and Releases. 3052.215-70, Key Personnel or Facilities. (Applicable at the Task Order Level) 3052.242-72, Contracting Officer’s Technical Representative. 3052.249-90, Contract Termination (USCG).(End of clause)---HSAR 3052.209-72, Organizational Conflict of Interest (Jun 2006) (a) Determination. The Government has determined that this effort may result in an actual or potential conflict of interest, or may provide one or more offerors with the potential to attain an unfair competitive advantage. The nature of the conflict of interest and the limitation on future contracting is that any contractor or subcontractors supporting this USCG Information Assurance Contract are not eligible for award as prime/subcontractor/teaming partner of any resulting USCG software engineering, hardware, network, and infrastructure engineering, data center operations, or application helpdesk efforts. (b) If any such conflict of interest is found to exist, the Contracting Officer may", "chunk_id": 20, "page_no": 16}, {"chunk": "RFP: 70Z04424RESIAB01---16(1) disqualify the offeror, or (2) determine that it is otherwise in the best interest of the United States to contract with the offeror and include the appropriate provisions to avoid, neutralize, mitigate, or waive such conflict in the contract awarded. After discussion with the offeror, the Contracting Officer may determine that the actual conflict cannot be avoided, neutralized, mitigated or otherwise resolved to the satisfaction of the Government, and the offeror may be found ineligible for award.(c) Disclosure: The offeror hereby represents, to the best of its knowledge that:___ (1) It is not aware of any facts which create any actual or potential organizational conflicts of interest relating to the award of this contract, or ___ (2) It has included information in its proposal, providing all current information bearing on the existence of any actual or potential organizational conflicts of interest, and has included a mitigation plan in accordance with paragraph (d) of this clause.(d) Mitigation. If an offeror with a potential or actual conflict of interest or unfair competitive advantage believes the conflict can be avoided, neutralized, or mitigated, the offeror shall submit a mitigation plan to the Government for review. Award of a contract where an actual or potential conflict of interest exists shall not occur before Government approval of the mitigation plan. If a mitigation plan is approved, the restrictions of this clause do not apply to the extent defined in the mitigation plan. (e) Other Relevant Information: In addition to the mitigation plan, the Contracting Officer may require further relevant information from the offeror. The Contracting Officer will use all information submitted by the offeror, and any other relevant information known to DHS, to determine whether an award to the offeror may take place, and whether the mitigation plan adequately neutralizes or mitigates the conflict. (f) Corporation Change. The successful offeror shall inform the Contracting Officer within thirty (30) calendar days of the effective date of any corporate mergers, acquisitions, and/or divestures that may affect this clause. (g) Flow-down. The contractor shall insert the substance of this clause in each first tier subcontract that exceeds the simplified acquisition threshold. (End of clause)HSAR 3052.209-73, Limitation on Future Contracting (Jun 2006) (a) The Contracting Officer has determined that this acquisition may give rise to a potential organizational conflict of interest. Accordingly, the attention of prospective offerors is invited to FAR Subpart 9.5 -- Organizational Conflicts of Interest. (b) The nature of this conflict is that any contractor or subcontractors supporting this USCG Information Assurance Contract are not eligible for award as prime/subcontractor/teaming partner of any resulting USCG software engineering, hardware, network, and infrastructure engineering, data center operations, or application helpdesk efforts. (c) The restrictions upon future contracting are as follows:(1) If the Contractor, under the terms of this contract, or through the performance of tasks pursuant to this contract, is required to develop specifications or statements of work that are to be incorporated into a solicitation, the Contractor shall be ineligible to perform the work described in that solicitation as a prime or first-tier subcontractor under an ensuing DHS contract. This restriction shall remain in effect for a reasonable time, as agreed to by the Contracting Officer and the Contractor, sufficient to avoid unfair competitive advantage or potential bias (this time shall in no case be less than the duration of the initial production contract). DHS shall not unilaterally require the Contractor to prepare such specifications or statements of work under this contract. (2) To the extent that the work under this contract requires access to proprietary, business confidential, or financial data of other companies, and as long as these data remain proprietary or confidential, the Contractor shall protect these data from unauthorized use and disclosure and agrees not to use them to compete with those other companies.", "chunk_id": 21, "page_no": 17}, {"chunk": "(End of clause)---DHS Special Clause: Safeguarding of Sensitive Information (Mar 2015) (HSAR Class Deviation 15-01)RFP: 70Z04424RESIAB01---17(a) Applicability. This clause applies to the Contractor, its subcontractors, and Contractor employees (hereafter referred to collectively as “Contractor”). The Contractor shall insert the substance of this clause in all subcontracts. (b) Definitions. As used in this clause— “Personally Identifiable Information (PII)” means information that can be used to distinguish or trace an individual's identity, such as name, social security number, or biometric records, either alone, or when combined with other personal or identifying information that is linked or linkable to a specific individual, such as date and place of birth, or mother’s maiden name. The definition of PII is not anchored to any single category of information or technology. Rather, it requires a case-by-case assessment of the specific risk that an individual can be identified. In performing this assessment, it is important for an agency to recognize that non-personally identifiable information can become personally identifiable information whenever additional information is made publicly available—in any medium and from any source—that, combined with other available information, could be used to identify an individual. PII is a subset of sensitive information. Examples of PII include, but are not limited to: name, date of birth, mailing address, telephone number, Social Security number (SSN), email address, zip code, account numbers, certificate/license numbers, vehicle identifiers including license plates, uniform resource locators (URLs), static Internet protocol addresses, biometric identifiers such as fingerprint, voiceprint, iris scan, photographic facial images, or any other unique identifying number or characteristic, and any information where it is reasonably foreseeable that the information will be linked with other information to identify the individual. “Sensitive Information” is defined in HSAR clause 3052.204-71, Contractor Employee Access, as any information, which if lost, misused, disclosed, or, without authorization is accessed, or modified, could adversely affect the national or homeland security interest, the conduct of Federal programs, or the privacy to which individuals are entitled under section 552a of Title 5, United States Code (the Privacy Act), but which has not been specifically authorized under criteria established by an Executive Order or an Act of Congress to be kept secret in the interest of national defense, homeland security or foreign policy. This definition includes the following categories of information: (1) Protected Critical Infrastructure Information (PCII) as set out in the Critical Infrastructure Information Act of 2002 (Title II, Subtitle B, of the Homeland Security Act, Public Law 107-296, 196 Stat. 2135), as amended, the implementing regulations thereto (Title 6, Code of Federal Regulations, Part 29) as amended, the applicable PCII Procedures Manual, as amended, and any supplementary guidance officially communicated by an authorized official of the Department of Homeland Security (including the PCII Program Manager or his/her designee); (2) Sensitive Security Information (SSI), as defined in Title 49, Code of Federal Regulations, Part 1520, as amended, “Policies and Procedures of Safeguarding and Control of SSI,” as amended, and any supplementary guidance officially communicated by an authorized official of the Department of Homeland Security (including the Assistant Secretary for the Transportation Security Administration or his/her designee); (3) Information designated as “For Official Use Only,” which is unclassified information of a sensitive nature and the unauthorized disclosure of which could adversely impact a person’s privacy or welfare, the conduct of Federal programs, or other programs or operations essential to the national or homeland security interest; and (4) Any information that is designated “sensitive” or subject to other controls, safeguards or protections in accordance with subsequently adopted homeland security information handling procedures. “Sensitive Information Incident” is an incident that includes the known, potential, or suspected exposure, loss of control, compromise, unauthorized disclosure, unauthorized acquisition, or unauthorized access or attempted access of any Government system, Contractor system, or sensitive information. “Sensitive Personally Identifiable Information (SPII)” is a subset of PII, which if lost, compromised or disclosed without authorization, could result in substantial harm, embarrassment, inconvenience, or unfairness to an individual. Some forms of PII are sensitive as stand-alone elements. Examples of such PII include: Social Security numbers (SSN), driver’s license or state identification number, Alien Registration Numbers (A-number), financial account number, and biometric identifiers such as fingerprint, voiceprint, or iris scan. Additional examples include any groupings of information that contain an individual’s name or other unique identifier plus one or more of the following elements: (1) Truncated SSN (such as last 4 digits) (2) Date of birth (month, day, and year)", "chunk_id": 22, "page_no": 18}, {"chunk": "RFP: 70Z04424RESIAB01---18(3) Citizenship or immigration status (4) Ethnic or religious affiliation (5) Sexual orientation (6) Criminal History (7) Medical Information (8) System authentication information such as mother’s maiden name, account passwords or personal identification numbers (PIN) Other PII may be “sensitive” depending on its context, such as a list of employees and their performance ratings or an unlisted home address or phone number. In contrast, a business card or public telephone directory of agency employees contains PII but is not sensitive. (c) Authorities. The Contractor shall follow all current versions of Government policies and guidance accessible at http://www.dhs.gov/dhs-security-and-training-requirements-contractors, or available upon request from the Contracting Officer, including but not limited to: (1) DHS Management Directive 11042.1 Safeguarding Sensitive But Unclassified (for Official Use Only) Information (2) DHS Sensitive Systems Policy Directive 4300A (3) DHS 4300A Sensitive Systems Handbook and Attachments (4) DHS Security Authorization Process Guide (5) DHS Handbook for Safeguarding Sensitive Personally Identifiable Information (6) DHS Instruction Handbook 121-01-007 Department of Homeland Security Personnel Suitability and Security Program (7) DHS Information Security Performance Plan (current fiscal year) (8) DHS Privacy Incident Handling Guidance (9) Federal Information Processing Standard (FIPS) 140-2 Security Requirements for Cryptographic Modules accessible at http://csrc.nist.gov/groups/STM/cmvp/standards.html (10) National Institute of Standards and Technology (NIST) Special Publication 800-53 Security and Privacy Controls at Systems Information http://csrc.nist.gov/publications/PubsSPs.html (11) NIST Special Publication 800-88 Guidelines http://csrc.nist.gov/publications/PubsSPs.html (d) Handling of Sensitive Information. Contractor compliance with this clause, as well as the policies and procedures described below, is required. (1) Department of Homeland Security (DHS) policies and procedures on Contractor personnel security requirements are set forth in various Management Directives (MDs), Directives, and Instructions. MD 11042.1, Safeguarding Sensitive But Unclassified (For Official Use Only) Information describes how Contractors must handle sensitive but unclassified information. DHS uses the term “FOR OFFICIAL USE ONLY” to identify sensitive but unclassified information that is not otherwise categorized by statute or regulation. Examples of sensitive information that are categorized by statute or regulation are PCII, SSI, etc. The DHS Sensitive Systems Policy Directive 4300A and the DHS 4300A Sensitive Systems Handbook provide the policies and procedures on security for Information Technology (IT) resources. The DHS Handbook for Safeguarding Sensitive Personally Identifiable Information provides guidelines to help safeguard SPII in both paper and electronic form. DHS Instruction Handbook 121-01-007 Department of Homeland Security Personnel Suitability and Security Program establishes procedures, program responsibilities, minimum standards, and reporting protocols for the DHS Personnel Suitability and Security Program. (2) The Contractor shall not use or redistribute any sensitive information processed, stored, and/or transmitted by the Contractor except as specified in the contract. (3) All Contractor employees with access to sensitive information shall execute DHS Form 11000-6, Department of Homeland Security Non-Disclosure Agreement (NDA), as a condition of access to such information. The Contractor shall maintain signed copies of the NDA for all employees as a record of compliance. The Contractor shall provide copies of the signed NDA to the Contracting Officer’s Representative (COR) no later than two (2) days after execution of the form. (4) The Contractor’s invoicing, billing, and other recordkeeping systems maintained to support financial or other administrative functions shall not maintain SPII. It is acceptable to maintain in these systems the names,", "chunk_id": 23, "page_no": 19}, {"chunk": "for---Federal---and---Organizations---accessible---for Media Sanitization---accessible---at---RFP: 70Z04424RESIAB01---19titles and contact information for the COR or other Government personnel associated with the administration of the contract, as needed. (e) Authority to Operate. The Contractor shall not input, store, process, output, and/or transmit sensitive information within a Contractor IT system without an Authority to Operate (ATO) signed by the Headquarters or Component CIO, or designee, in consultation with the Headquarters or Component Privacy Officer. Unless otherwise specified in the ATO letter, the ATO is valid for three (3) years. The Contractor shall adhere to current Government policies, procedures, and guidance for the Security Authorization (SA) process as defined below. (1) Complete the Security Authorization process. The SA process shall proceed according to the DHS Sensitive Systems Policy Directive 4300A (Version 11.0, April 30, 2014), or any successor publication, DHS 4300A Sensitive Systems Handbook (Version 9.1, July 24, 2012), or any successor publication, and the Security Authorization Process Guide including templates. (i) Security Authorization Process Documentation. SA documentation shall be developed using the Government provided Requirements Traceability Matrix and Government security documentation templates. SA documentation consists of the following: Security Plan, Contingency Plan, Contingency Plan Test Results, Configuration Management Plan, Security Assessment Plan, Security Assessment Report, and Authorization to Operate Letter. Additional documents that may be required include a Plan(s) of Action and Milestones and Interconnection Security Agreement(s). During the development of SA documentation, the Contractor shall submit a signed SA package, validated by an independent third party, to the COR for acceptance by the Headquarters or Component CIO, or designee, at least thirty (30) days prior to the date of operation of the IT system. The Government is the final authority on the compliance of the SA package and may limit the number of resubmissions of a modified SA package. Once the ATO has been accepted by the Headquarters or Component CIO, or designee, the Contracting Officer shall incorporate the ATO into the contract as a compliance document. The Government’s acceptance of the ATO does not alleviate the Contractor’s responsibility to ensure the IT system controls are implemented and operating effectively. (ii) Independent Assessment. Contractors shall have an independent third party validate the security and privacy controls in place for the system(s). The independent third party shall review and analyze the SA package, and report on technical, operational, and management level deficiencies as outlined in NIST Special Publication 800-53 Security and Privacy Controls for Federal Information Systems and Organizations. The Contractor shall address all deficiencies before submitting the SA package to the Government for acceptance. (iii) Support the completion of the Privacy Threshold Analysis (PTA) as needed. As part of the SA process, the Contractor may be required to support the Government in the completion of the PTA. The requirement to complete a PTA is triggered by the creation, use, modification, upgrade, or disposition of a Contractor IT system that will store, maintain and use PII, and must be renewed at least every three (3) years. Upon review of the PTA, the DHS Privacy Office determines whether a Privacy Impact Assessment (PIA) and/or Privacy Act System of Records Notice (SORN), or modifications thereto, are required. The Contractor shall provide all support necessary to assist the Department in completing the PIA in a timely manner and shall ensure that project management plans and schedules include time for the completion of the PTA, PIA, and SORN (to the extent required) as milestones. Support in this context includes responding timely to requests for information from the Government about the use, access, storage, and maintenance of PII on the Contractor’s system, and providing timely review of relevant compliance documents for factual accuracy. Information on the DHS privacy compliance process, including PTAs, PIAs, and SORNs, is accessible at http://www.dhs.gov/privacy- compliance. (2) Renewal of ATO. Unless otherwise specified in the ATO letter, the ATO shall be renewed every three (3) years. The Contractor is required to update its SA package as part of the ATO renewal process. The Contractor shall update its SA package by one of the following methods: (1) Updating the SA documentation in the DHS automated information assurance tool for acceptance by the Headquarters or Component CIO, or designee, at least 90 days before the ATO expiration date for review and verification of security controls; or (2) Submitting an updated SA package directly to the COR for approval by the Headquarters or Component CIO, or designee, at least 90 days before the ATO expiration date for review and verification of security controls. The 90 day review process is independent of the system production date and therefore it is important that the Contractor build the review into project schedules. The reviews may include onsite visits that involve physical or logical inspection of the Contractor environment to ensure controls are in place.", "chunk_id": 24, "page_no": 20}, {"chunk": "RFP: 70Z04424RESIAB01---20(3) Security Review. The Government may elect to conduct random periodic reviews to ensure that the security requirements contained in this contract are being implemented and enforced. The Contractor shall afford DHS, the Office of the Inspector General, and other Government organizations access to the Contractor’s facilities, installations, operations, documentation, databases and personnel used in the performance of this contract. The Contractor shall, through the Contracting Officer and COR, contact the Headquarters or Component CIO, or designee, to coordinate and participate in review and inspection activity by Government organizations external to the DHS. Access shall be provided, to the extent necessary as determined by the Government, for the Government to carry out a program of inspection, investigation, and audit to safeguard against threats and hazards to the integrity, availability and confidentiality of Government data or the function of computer systems used in performance of this contract and to preserve evidence of computer crime. (4) Continuous Monitoring. All Contractor-operated systems that input, store, process, output, and/or transmit sensitive information shall meet or exceed the continuous monitoring requirements identified in the Fiscal Year 2014 DHS Information Security Performance Plan, or successor publication. The plan is updated on an annual basis. The Contractor shall also store monthly continuous monitoring data at its location for a period not less than one year from the date the data is created. The data shall be encrypted in accordance with FIPS 140-2 Security Requirements for Cryptographic Modules and shall not be stored on systems that are shared with other commercial or Government entities. The Government may elect to perform continuous monitoring and IT security scanning of Contractor systems from Government tools and infrastructure. (5) Revocation of ATO. In the event of a sensitive information incident, the Government may suspend or revoke an existing ATO (either in part or in whole). If an ATO is suspended or revoked in accordance with this provision, the Contracting Officer may direct the Contractor to take additional security measures to secure sensitive information. These measures may include restricting access to sensitive information on the Contractor IT system under this contract. Restricting access may include disconnecting the system processing, storing, or transmitting the sensitive information from the Internet or other networks or applying additional security controls. (6) Federal Reporting Requirements. Contractors operating information systems on behalf of the Government or operating systems containing sensitive information shall comply with Federal reporting requirements. Annual and quarterly data collection will be coordinated by the Government. Contractors shall provide the COR with requested information within three (3) business days of receipt of the request. Reporting requirements are determined by the Government and are defined in the Fiscal Year 2014 DHS Information Security Performance Plan, or successor publication. The Contractor shall provide the Government with all information to fully satisfy Federal reporting requirements for Contractor systems. (f) Sensitive Information Incident Reporting Requirements. (1) All known or suspected sensitive information incidents shall be reported to the Headquarters or Component Security Operations Center (SOC) within one hour of discovery in accordance with 4300A Sensitive Systems Handbook Incident Response and Reporting requirements. When notifying the Headquarters or Component SOC, the Contractor shall also notify the Contracting Officer, COR, Headquarters or Component Privacy Officer, and US-CERT using the contact information identified in the contract. If the incident is reported by phone or the Contracting Officer’s email address is not immediately available, the Contractor shall contact the Contracting Officer immediately after reporting the incident to the Headquarters or Component SOC. The Contractor shall not include any sensitive information in the subject or body of any e-mail. To transmit sensitive information, the Contractor shall use FIPS 140-2 Security Requirements for Cryptographic Modules compliant encryption methods to protect sensitive information in attachments to email. Passwords shall not be communicated in the same email as the attachment. A sensitive information incident shall not, by itself, be interpreted as evidence that the Contractor has failed to provide adequate information security safeguards for sensitive information, or has otherwise failed to meet the requirements of the contract. (2) If a sensitive information incident involves PII or SPII, in addition to the reporting requirements in 4300A Sensitive Systems Handbook Incident Response and Reporting, Contractors shall also provide as many of the following data elements that are available at the time the incident is reported, with any remaining data elements provided within 24 hours of submission of the initial incident report: (i) Data Universal Numbering System (DUNS); (ii) Contract numbers affected unless all contracts by the company are affected; (iii) Facility CAGE code if the location of the event is different than the prime contractor location;", "chunk_id": 25, "page_no": 21}, {"chunk": "RFP: 70Z04424RESIAB01---21(iv) Point of contact (POC) if different than the POC recorded in the System for Award Management (address, position, telephone, email); (v) Contracting Officer POC (address, telephone, email); (vi) Contract clearance level; (vii) Name of subcontractor and CAGE code if this was an incident on a subcontractor network; (viii) Government programs, platforms or systems involved; (ix) Location(s) of incident; (x) Date and time the incident was discovered; (xi) Server names where sensitive information resided at the time of the incident, both at the Contractor and subcontractor level; (xii) Description of the Government PII and/or SPII contained within the system; (xiii) Number of people potentially affected and the estimate or actual number of records exposed and/or contained within the system; and (xiv) Any additional information relevant to the incident. (g) Sensitive Information Incident Response Requirements. (1) All determinations related to sensitive information incidents, including response activities, notifications to affected individuals and/or Federal agencies, and related services (e.g., credit monitoring) will be made in writing by the Contracting Officer in consultation with the Headquarters or Component CIO and Headquarters or Component Privacy Officer. (2) The Contractor shall provide full access and cooperation for all activities determined by the Government to be required to ensure an effective incident response, including providing all requested images, log files, and event information to facilitate rapid resolution of sensitive information incidents. (3) Incident response activities determined to be required by the Government may include, but are not limited to, the following: (i) Inspections, (ii) Investigations, (iii) Forensic reviews, and (iv) Data analyses and processing. (4) The Government, at its sole discretion, may obtain the assistance from other Federal agencies and/or third- party firms to aid in incident response activities. (h) Additional PII and/or SPII Notification Requirements. (1) The Contractor shall have in place procedures and the capability to notify any individual whose PII resided in the Contractor IT system at the time of the sensitive information incident not later than 5 business days after being directed to notify individuals, unless otherwise approved by the Contracting Officer. The method and content of any notification by the Contractor shall be coordinated with, and subject to prior written approval by the Contracting Officer, in consultation with the Headquarters or Component Privacy Officer, utilizing the DHS Privacy Incident Handling Guidance. The Contractor shall not proceed with notification unless the Contracting Officer, in consultation with the Headquarters or Component Privacy Officer, has determined in writing that notification is appropriate. (1) Subject to Government analysis of the incident and the terms of its instructions to the Contractor regarding any resulting notification, the notification method may consist of letters to affected individuals sent by first class mail, electronic means, or general public notice, as approved by the Government. Notification may require the Contractor’s use of address verification and/or address location services. At a minimum, the notification shall include: (i) A brief description of the incident; (ii) A description of the types of PII and SPII involved; (iii) A statement as to whether the PII or SPII was encrypted or protected by other means; (iv) Steps individuals may take to protect themselves; (v) What the Contractor and/or the Government are doing to investigate the incident, to mitigate the incident, and to protect against any future incidents; and (vi) Information identifying who individuals may contact for additional information. (i) Credit Monitoring Requirements. In the event that a sensitive information incident involves PII or SPII, the Contractor may be required to, as directed by the Contracting Officer:", "chunk_id": 26, "page_no": 22}, {"chunk": "RFP: 70Z04424RESIAB01---22(1) Provide notification to affected individuals as described above; and/or (2) Provide credit monitoring services to individuals whose data was under the control of the Contractor or resided in the Contractor IT system at the time of the sensitive information incident for a period beginning the date of the incident and extending not less than 18 months from the date the individual is notified. Credit monitoring services shall be provided from a company with which the Contractor has no affiliation. At a minimum, credit monitoring services shall include: (i) Triple credit bureau monitoring; (ii) Daily customer service; (iii) Alerts provided to the individual for changes and fraud; and (iv) Assistance to the individual with enrollment in the services and the use of fraud alerts; and/or (3) Establish a dedicated call center. Call center services shall include: (i) A dedicated telephone number to contact customer service within a fixed period; (ii) Information necessary for registrants/enrollees to access credit reports and credit scores; (iii) Weekly reports on call center volume, issue escalation (i.e., those calls that cannot be handled by call center staff and must be resolved by call center management or DHS, as appropriate), and other key metrics; (iv) Escalation of calls that cannot be handled by call center staff to call center management or DHS, as appropriate; (v) Customized FAQs, approved in writing by the Contracting Officer in coordination with the Headquarters or Component Chief Privacy Officer; and (vi) Information for registrants to contact customer service representatives and fraud resolution representatives for credit monitoring assistance. (j) Certification of Sanitization of Government and Government-Activity-Related Files and Information. As part of contract closeout, the Contractor shall submit the certification to the COR and the Contracting Officer following the template provided in NIST Special Publication 800-88 Guidelines for Media Sanitization.", "chunk_id": 27, "page_no": 23}, {"chunk": "(End of Clause)---DHS Special Clause: Information Technology Security and Privacy Training (Mar 2015) (HSAR Class Deviation 15-01) (a) Applicability. This clause applies to the Contractor, its subcontractors, and Contractor employees (hereafter referred to collectively as “Contractor”). The Contractor shall insert the substance of this clause in all subcontracts. (b) Security Training Requirements. (1) All users of Federal information systems are required by Title 5, Code of Federal Regulations, Part 930.301, Subpart C, as amended, to be exposed to security awareness materials annually or whenever system security changes occur, or when the user’s responsibilities change. The Department of Homeland Security (DHS) requires that Contractor employees take an annual Information Technology Security Awareness Training course before accessing sensitive information under the contract. Unless otherwise specified, the training shall be completed within thirty (30) days of contract award and be completed on an annual basis thereafter not later than October 31st of each year. Any new Contractor employees assigned to the contract shall complete the training before accessing sensitive information under the contract. The training is accessible at http://www.dhs.gov/dhs-security-and-training-requirements-contractors. The Contractor shall maintain copies of training certificates for all Contractor and subcontractor employees as a record of compliance. Unless otherwise specified, initial training certificates for each Contractor and subcontractor employee shall be provided to the Contracting Officer’s Representative (COR) not later than thirty (30) days after contract award. Subsequent training certificates to satisfy the annual training requirement shall be submitted to the COR via e- mail notification not later than October 31st of each year. The e-mail notification shall state the required training has been completed for all Contractor and subcontractor employees. (2) The DHS Rules of Behavior apply to every DHS employee, Contractor and subcontractor that will have access to DHS systems and sensitive information. The DHS Rules of Behavior shall be signed before accessing DHS systems and sensitive information. The DHS Rules of Behavior is a document that informs users of their responsibilities when accessing DHS systems and holds users accountable for actions taken while accessing DHS systems and using DHS Information Technology resources capable of inputting, storing, processing, outputting, and/or transmitting sensitive information. The DHS Rules of Behavior is accessible at", "chunk_id": 28, "page_no": 23}, {"chunk": "RFP: 70Z04424RESIAB01---23http://www.dhs.gov/dhs-security-and-training-requirements-contractors. Unless otherwise specified, the DHS Rules of Behavior shall be signed within thirty (30) days of contract award. Any new Contractor employees assigned to the contract shall also sign the DHS Rules of Behavior before accessing DHS systems and sensitive information. The Contractor shall maintain signed copies of the DHS Rules of Behavior for all Contractor and subcontractor employees as a record of compliance. Unless otherwise specified, the Contractor shall e-mail copies of the signed DHS Rules of Behavior to the COR not later than thirty (30) days after contract award for each employee. The DHS Rules of Behavior will be reviewed annually and the COR will provide notification when a review is required. (c) Privacy Training Requirements. All Contractor and subcontractor employees that will have access to Personally Identifiable Information (PII) and/or Sensitive PII (SPII) are required to take Privacy at DHS: Protecting Personal Information before accessing PII and/or SPII. The training is accessible at http://www.dhs.gov/dhs-security-and-training-requirements-contractors. Training shall be completed within thirty (30) days of contract award and be completed on an annual basis thereafter not later than October 31st of each year. Any new Contractor employees assigned to the contract shall also complete the training before accessing PII and/or SPII. The Contractor shall maintain copies of training certificates for all Contractor and subcontractor employees as a record of compliance. Initial training certificates for each Contractor and subcontractor employee shall be provided to the COR not later than thirty (30) days after contract award. Subsequent training certificates to satisfy the annual training requirement shall be submitted to the COR via e- mail notification not later than October 31st of each year. The e-mail notification shall state the required training has been completed for all Contractor and subcontractor employees.", "chunk_id": 29, "page_no": 24}, {"chunk": "(End of Clause)---CGAP Clause, Trusted Associate Sponsorship System (TASS). (CGAP 3004.1301-90 per CGAP June 10, 2022) (a) \"Contractor employee\" means an employee of a firm, or an individual, under contract or subcontract to the Coast Guard to provide services who also requires one or more of the following: (1) Physical access to multiple Coast Guard facilities or multiple federally controlled facilities on behalf of the Coast Guard on a recurring basis (a minimum of 2 times per week and/or 8 times per month) for a period of 6 months or more. (2) Remote access, via logon, to Coast Guard network using Coast Guard-approved remote access procedures. (3) Both physical access to Coast Guard facility and logical access, via logon, to Coast Guard networks on-site or remotely. Access to the Coast Guard network must require the use of a computer with government-controlled configuration or use of Coast Guard-approved remote access procedure in accordance with the Defense Information Systems Agency (DISA) Security Technical Implementation Guide. (b) Homeland Security Presidential Directive (HSPD)-12 mandates a Federal standard for secure and reliable forms of identification for Federal employees and contractor employees. The Common Access Card (CAC) is a personal identification card for the Department of Defense/Uniformed Services and complies with HSPD- 12. The Coast Guard has instituted the CAC as its HSPD-12 compliant personal identification card for contractor and subcontractor employees who are required to access a Coast Guard, Department of Defense (DOD), or other federally-controlled computer information system and/or facility, or need public key infrastructure (PKI) authentication to perform their contractual duties. The Trusted Associate Sponsorship System (TASS) is the automated application process for obtaining a CAC. (c) Contractor and subcontractor employees working pursuant to this contract who are required to access a Coast Guard, DOD, or other federally-controlled computer information system and/or facility, or need PKI authentication to perform their contractual duties shall use TASS to obtain a CAC. (d) The COR or Assisting COR (ACOR) is the TASS Trusted Agent (TA) and initiates contractor accounts in the TASS, approving, returning, or rejecting CAC applications (as applicable); re-verifying assigned contractors every six months; revoking contractor and employee eligibility for a CAC. (e) The TA ensures that contractor personnel satisfy the security requirements for CAC issuance prior to creating the CAC application in TASS. Current investigative requirements shall be verified according to Commandant Instruction COMDTINST 5500.18, Coast Guard Trusted Associate Sponsorship System. The initial CAC issuance requires a favorably adjudicated Tier 1 investigation (equivalent or higher) or a Tier 1 background investigation (BI) (equivalent or higher) package that has been successfully scheduled with the", "chunk_id": 30, "page_no": 24}, {"chunk": "RFP: 70Z04424RESIAB01---24investigative service provider (ISP) and a FBI fingerprint check with favorable results. The TA and Sponsor or other appropriate federal government representative must coordinate with the unit BI Verifier (Command Security Officer /Trusted Agent Security Manager) or the U.S. Coast Guard Security (SECCEN) to confirm the appropriate investigation has been favorably adjudicated or scheduled at the ISP with favorable FBI fingerprint results. (f) The COR or KO provides such forms to, or requests such information from, contractor employees that may be necessary for obtaining a CAC via the TASS. The Contractor submits completed forms and information as directed by the COR or KO. Contractors are responsible for the accuracy and completeness of the information submitted and for any liability resulting from the government's reliance on inaccurate or incomplete information. (g) Contractor employees who are declined via the TASS are ineligible to perform work under this contract. (h) When an employee with a CAC is no longer performing work under this contract, the employee must return the CAC to the COR/TA or KO on the same day the employee stops working. (i) The contractor shall insert this clause in all subcontracts when a subcontractor's employee is required to access a Coast Guard, DOD, or other federally-controlled computer information system and/or facility, or need PKI authentication to perform contractual duties.", "chunk_id": 31, "page_no": 25}, {"chunk": "(End of Clause)---52.212-5 Contract Terms and Conditions Required To Implement Statutes or Executive Orders—Commercial Products and Commercial Services (MAR 2023)(a) The Contractor shall comply with the following Federal Acquisition Regulation (FAR) clauses, which are incorporated in this contract by reference, to implement provisions of law or Executive orders applicable to acquisitions of commercial products and commercial services:(1) 52.203-19, Prohibition on Requiring Certain Internal Confidentiality Agreements or Statements (Jan 2017) (section 743 of Division E, Title VII, of the Consolidated and Further Continuing Appropriations Act, 2015 (Pub. L. 113-235) and its successor provisions in subsequent appropriations acts (and as extended in continuing resolutions)).(2) 52.204-23, Prohibition on Contracting for Hardware, Software, and Services Developed or Provided by Kaspersky Lab and Other Covered Entities (Nov 2021) (Section 1634 of Pub. L. 115-91).(3) 52.204-25, Prohibition on Contracting for Certain Telecommunications and Video Surveillance Services or Equipment. (Nov 2021) (Section 889(a)(1)(A) of Pub. L. 115-232).(4) 52.209-10, Prohibition on Contracting with Inverted Domestic Corporations (Nov 2015).---(5) 52.232-40, Providing Accelerated Payments to Small Business Subcontractors (Mar 2023) (31 U.S.C. 3903 and 10 U.S.C. 3801).(6) 52.233-3, Protest After Award (Aug 1996) (31 U.S.C. 3553).(7) 52.233-4, Applicable Law for Breach of Contract Claim (Oct 2004) (Public Laws 108- 77 and 108-78 (19 U.S.C. 3805 note)).(b) The Contractor shall comply with the FAR clauses in this paragraph (b) that the Contracting Officer has indicated as being incorporated in this contract by reference to implement provisions of law or Executive orders applicable to acquisitions of commercial products and commercial services:", "chunk_id": 32, "page_no": 25}, {"chunk": "RFP: 70Z04424RESIAB01---25X (1) 52.203-6, Restrictions on Subcontractor Sales to the Government (Jun 2020), with Alternate I (Nov 2021) (41 U.S.C. 4704 and 10 U.S.C. 4655). X (2) 52.203-13, Contractor Code of Business Ethics and Conduct (Nov 2021) (41 U.S.C. 3509)). __ (3) 52.203-15, Whistleblower Protections under the American Recovery and Reinvestment Act of 2009 (Jun 2010) (Section 1553 of Pub. L. 111-5). (Applies to contracts funded by the American Recovery and Reinvestment Act of 2009.) X (4) 52.204-10, Reporting Executive Compensation and First-Tier Subcontract Awards (Jun 2020) (Pub. L. 109-282) (31 U.S.C. 6101 note). __ (5) [Reserved]. __ (6) 52.204-14, Service Contract Reporting Requirements (Oct 2016) (Pub. L. 111-117, section 743 of Div. C). X (7) 52.204-15, Service Contract Reporting Requirements for Indefinite-Delivery Contracts (Oct 2016) (Pub. L. 111-117, section 743 of Div. C). X (8) 52.209-6, Protecting the Government’s Interest When Subcontracting with Contractors Debarred, Suspended, or Proposed for Debarment. (Nov 2021) (31 U.S.C. 6101 note). X (9) 52.209-9, Updates of Publicly Available Information Regarding Responsibility Matters (Oct 2018) (41 U.S.C. 2313). __ (10) [Reserved]. __ (11) 52.219-3, Notice of HUBZone Set-Aside or Sole-Source Award (Oct 2022) (15 U.S.C. 657a). __ (12) 52.219-4, Notice of Price Evaluation Preference for HUBZone Small Business Concerns (Oct 2022) (if the offeror elects to waive the preference, it shall so indicate in its offer) (15 U.S.C. 657a). __ (13) [Reserved] X (14) (i) 52.219-6, Notice of Total Small Business Set-Aside (Nov 2020) (15 U.S.C. 644). __ (ii) Alternate I (Mar 2020) of 52.219-6. __ (15) (i) 52.219-7, Notice of Partial Small Business Set-Aside (Nov 2020) (15 U.S.C. 644). __ (ii) Alternate I (Mar 2020) of 52.219-7. X (16) 52.219-8, Utilization of Small Business Concerns (Oct 2022) (15 U.S.C. 637(d)(2) and (3)). __ (17) (i) 52.219-9, Small Business Subcontracting Plan (Oct 2022) (15 U.S.C. 637(d)(4)). __ (ii) Alternate I (Nov 2016) of 52.219-9. __ (iii) Alternate II (Nov 2016) of 52.219-9. __ (iv) Alternate III (Jun 2020) of 52.219-9. __ (v) Alternate IV (Sep 2021) of 52.219-9. __ (18) (i) 52.219-13, Notice of Set-Aside of Orders (Mar 2020) (15 U.S.C. 644(r)). __ (ii) Alternate I (Mar 2020) of 52.219-13. X (19) 52.219-14, Limitations on Subcontracting (Oct 2022) (15 U.S.C. 637s). (DHS- USCG DEVIATION 22-02 – see full text clause above) __ (20) 52.219-16, Liquidated Damages—Subcontracting Plan (Sep 2021) (15 U.S.C. 637(d)(4)(F)(i)). __ (21) 52.219-27, Notice of Service-Disabled Veteran-Owned Small Business Set-Aside (Oct 2022) ( 15 U.S.C. 657f). X (22) (i) 52.219-28, Post Award Small Business Program Rerepresentation (Mar 2023)(15 U.S.C. 632(a)(2)). __ (ii) Alternate I (Mar 2020) of 52.219-28. __ (23) 52.219-29, Notice of Set-Aside for, or Sole-Source Award to, Economically Disadvantaged Women-Owned Small Business Concerns (Oct 2022) (15 U.S.C. 637(m)).", "chunk_id": 33, "page_no": 26}, {"chunk": "RFP: 70Z04424RESIAB01---26__ (24) 52.219-30, Notice of Set-Aside for, or Sole-Source Award to, Women-Owned Small Business Concerns Eligible Under the Women-Owned Small Business Program (Oct 2022) (15 U.S.C. 637(m)). __ (25) 52.219-32, Orders Issued Directly Under Small Business Reserves (Mar 2020) (15 U.S.C. 644(r)). __ (26) 52.219-33, Nonmanufacturer Rule (Sep 2021) (15U.S.C. 637(a)(17)). X (27) 52.222-3, Convict Labor (Jun 2003) (E.O.11755). __ (28) 52.222-19, Child Labor-Cooperation with Authorities and Remedies (Dec 2022) (E.O.13126). X (29) 52.222-21, Prohibition of Segregated Facilities (Apr 2015). X (30) (i) 52.222-26, Equal Opportunity (Sep 2016) (E.O.11246). __ (ii) Alternate I (Feb 1999) of 52.222-26. X (31) (i) 52.222-35, Equal Opportunity for Veterans (Jun 2020) (38 U.S.C. 4212). __ (ii) Alternate I (Jul 2014) of 52.222-35. X (32) (i) 52.222-36, Equal Opportunity for Workers with Disabilities (Jun 2020) (29 U.S.C. 793). __ (ii) Alternate I (Jul 2014) of 52.222-36. X (33) 52.222-37, Employment Reports on Veterans (Jun 2020) (38 U.S.C. 4212). X (34) 52.222-40, Notification of Employee Rights Under the National Labor Relations Act (Dec 2010) (E.O. 13496). X (35) (i) 52.222-50, Combating Trafficking in Persons (Nov 2021) (22 U.S.C. chapter 78 and E.O. 13627). __ (ii) Alternate I (Mar 2015) of 52.222-50 (22 U.S.C. chapter 78 and E.O. 13627). X (36) 52.222-54, Employment Eligibility Verification (May 2022) (Executive Order 12989). (Not applicable to the acquisition of commercially available off-the-shelf items or certain other types of commercial products or commercial services as prescribed in FAR 22.1803.) __ (37) (i) 52.223-9, Estimate of Percentage of Recovered Material Content for EPA– Designated Items (May 2008) (42 U.S.C. 6962(c)(3)(A)(ii)). (Not applicable to the acquisition of commercially available off-the-shelf items.) __ (ii) Alternate I (May 2008) of 52.223-9 ( 42 U.S.C. 6962(i)(2)(C)). (Not applicable to the acquisition of commercially available off-the-shelf items.) __ (38) 52.223-11, Ozone-Depleting Substances and High Global Warming Potential Hydrofluorocarbons (Jun 2016) (E.O. 13693). __ (39) 52.223-12, Maintenance, Service, Repair, or Disposal of Refrigeration Equipment and Air Conditioners (Jun 2016) (E.O. 13693). __ (40) (i) 52.223-13, Acquisition of EPEAT®-Registered Imaging Equipment (Jun 2014) (E.O.s 13423 and 13514). __ (ii) Alternate I (Oct 2015) of 52.223-13. __ (41) (i) 52.223-14, Acquisition of EPEAT®-Registered Televisions (Jun 2014) (E.O.s 13423 and 13514). __ (ii) Alternate I (Jun2014) of 52.223-14. __ (42) 52.223-15, Energy Efficiency in Energy-Consuming Products (May 2020) (42 U.S.C. 8259b). __ (43) (i) 52.223-16, Acquisition of EPEAT®-Registered Personal Computer Products (Oct 2015) (E.O.s 13423 and 13514). __ (ii) Alternate I (Jun 2014) of 52.223-16. X (44) 52.223-18, Encouraging Contractor Policies to Ban Text Messaging While Driving (Jun 2020) (E.O. 13513). __ (45) 52.223-20, Aerosols (Jun 2016) (E.O. 13693). __ (46) 52.223-21, Foams (Jun2016) (E.O. 13693). X (47) (i) 52.224-3 Privacy Training (Jan 2017) (5 U.S.C. 552 a). (DHS-USCG DEVIATION 17-03 - see full text clause above)", "chunk_id": 34, "page_no": 27}, {"chunk": "RFP: 70Z04424RESIAB01---27__ (ii) Alternate I (Jan 2017) of 52.224-3. __ (48) (i) 52.225-1, Buy American-Supplies (Oct 2022) (41 U.S.C. chapter 83). __ (ii) Alternate I (Oct 2022) of 52.225-1. __ (49) (i) 52.225-3, Buy American-Free Trade Agreements-Israeli Trade Act (Dec 2022) (19 U.S.C. 3301 note, 19 U.S.C. 2112 note, 19 U.S.C. 3805 note, 19 U.S.C. 4001 note, 19 U.S.C. chapter 29 (sections 4501-4732), Public Law 103-182, 108-77, 108-78, 108-286, 108-302, 109-53, 109-169, 109-283, 110-138, 112-41, 112-42, and 112-43. __ (ii) Alternate I [Reserved]. __ (iii) Alternate II (Dec 2022) of 52.225-3. __ (iv) Alternate III (Jan 2021) of 52.225-3. __ (v) Alternate IV (Oct 2022) of 52.225-3. __ (50) 52.225-5, Trade Agreements (Dec 2022) (19 U.S.C. 2501, et seq., 19 U.S.C. 3301 note). X (51) 52.225-13, Restrictions on Certain Foreign Purchases (Feb 2021) (E.O.’s, proclamations, and statutes administered by the Office of Foreign Assets Control of the Department of the Treasury). __ (52) 52.225-26, Contractors Performing Private Security Functions Outside the United States (Oct 2016) (Section 862, as amended, of the National Defense Authorization Act for Fiscal Year 2008; 10 U.S.C. Subtitle A, Part V, Subpart G Note). __ (53) 52.226-4, Notice of Disaster or Emergency Area Set-Aside (Nov 2007) (42 U.S.C. 5150). __ (54) 52.226-5, Restrictions on Subcontracting Outside Disaster or Emergency Area (Nov2007) (42 U.S.C. 5150). X (55) 52.229-12, Tax on Certain Foreign Procurements (Feb 2021). __ (56) 52.232-29, Terms for Financing of Purchases of Commercial Products and Commercial Services (Nov 2021) (41 U.S.C. 4505, 10 U.S.C. 3805). __ (57) 52.232-30, Installment Payments for Commercial Products and Commercial Services (Nov 2021) (41 U.S.C. 4505, 10 U.S.C. 3805). X (58) 52.232-33, Payment by Electronic Funds Transfer-System for Award Management (Oct2018) (31 U.S.C. 3332). __ (59) 52.232-34, Payment by Electronic Funds Transfer-Other than System for Award Management (Jul 2013) ( 31 U.S.C. 3332). __ (60) 52.232-36, Payment by Third Party (May 2014) (31 U.S.C. 3332). __ (61) 52.239-1, Privacy or Security Safeguards (Aug 1996) (5 U.S.C. 552a). __ (62) 52.242-5, Payments to Small Business Subcontractors (Jan 2017) (15 U.S.C. 637(d)(13)). __ (63) (i) 52.247-64, Preference for Privately Owned U.S.-Flag Commercial Vessels (Nov 2021) (46 U.S.C. 55305 and 10 U.S.C. 2631). __ (ii) Alternate I (Apr 2003) of 52.247-64. __ (iii) Alternate II (Nov 2021) of 52.247-64.(c) The Contractor shall comply with the FAR clauses in this paragraph (c), applicable to commercial services, that the Contracting Officer has indicated as being incorporated in this contract by reference to implement provisions of law or Executive orders applicable to acquisitions of commercial products and commercial services:__ (1) 52.222-41, Service Contract Labor Standards (Aug 2018) (41 U.S.C. chapter67). __ (2) 52.222-42, Statement of Equivalent Rates for Federal Hires (May 2014) (29 U.S.C. 206 and 41 U.S.C. chapter 67). __ (3) 52.222-43, Fair Labor Standards Act and Service Contract Labor Standards-Price Adjustment (Multiple Year and Option Contracts) (Aug 2018) (29 U.S.C. 206 and 41 U.S.C. chapter 67).", "chunk_id": 35, "page_no": 28}, {"chunk": "RFP: 70Z04424RESIAB01---28__ (4) 52.222-44, Fair Labor Standards Act and Service Contract Labor Standards-Price Adjustment (May 2014) (29 U.S.C. 206 and 41 U.S.C. chapter 67). __ (5) 52.222-51, Exemption from Application of the Service Contract Labor Standards to Contracts for Maintenance, Calibration, or Repair of Certain Equipment-Requirements (May 2014) (41 U.S.C. chapter 67). __ (6) 52.222-53, Exemption from Application of the Service Contract Labor Standards to Contracts for Certain Services-Requirements (May 2014) (41 U.S.C. chapter 67). __ (7) 52.222-55, Minimum Wages for Contractor Workers Under Executive Order 14026 (Jan 2022). __ (8) 52.222-62, Paid Sick Leave Under Executive Order 13706 (Jan 2022) (E.O. 13706). __ (9) 52.226-6, Promoting Excess Food Donation to Nonprofit Organizations (Jun 2020) (42 U.S.C. 1792).(d) Comptroller General Examination of Record. The Contractor shall comply with the provisions of this paragraph (d) if this contract was awarded using other than sealed bid, is in excess of the simplified acquisition threshold, as defined in FAR 2.101, on the date of award of this contract, and does not contain the clause at 52.215-2, Audit and Records-Negotiation.(1) The Comptroller General of the United States, or an authorized representative of the Comptroller General, shall have access to and right to examine any of the Contractor’s directly pertinent records involving transactions related to this contract.(2) The Contractor shall make available at its offices at all reasonable times the records, materials, and other evidence for examination, audit, or reproduction, until 3 years after final payment under this contract or for any shorter period specified in FAR subpart 4.7, Contractor Records Retention, of the other clauses of this contract. If this contract is completely or partially terminated, the records relating to the work terminated shall be made available for 3 years after any resulting final termination settlement. Records relating to appeals under the disputes clause or to litigation or the settlement of claims arising under or relating to this contract shall be made available until such appeals, litigation, or claims are finally resolved.(3) As used in this clause, records include books, documents, accounting procedures and practices, and other data, regardless of type and regardless of form. This does not require the Contractor to create or maintain any record that the Contractor does not maintain in the ordinary course of business or pursuant to a provision of law.(e) (1) Notwithstanding the requirements of the clauses in paragraphs (a), (b), (c), and (d) of this clause, the Contractor is not required to flow down any FAR clause, other than those in this paragraph (e)(1), in a subcontract for commercial products or commercial services. Unless otherwise indicated below, the extent of the flow down shall be as required by the clause-(i) 52.203-13, Contractor Code of Business Ethics and Conduct (Nov 2021) (41 U.S.C. 3509).(ii) 52.203-19, Prohibition on Requiring Certain Internal Confidentiality Agreements or Statements (Jan 2017) (section 743 of Division E, Title VII, of the Consolidated and Further Continuing Appropriations Act, 2015 (Pub. L. 113-235) and its successor provisions in subsequent appropriations acts (and as extended in continuing resolutions)).", "chunk_id": 36, "page_no": 29}, {"chunk": "RFP: 70Z04424RESIAB01---29(iii) 52.204-23, Prohibition on Contracting for Hardware, Software, and Services Developed or Provided by Kaspersky Lab and Other Covered Entities (Nov 2021) (Section 1634 of Pub. L. 115-91).(iv) 52.204-25, Prohibition on Contracting for Certain Telecommunications and Video Surveillance Services or Equipment. (Nov 2021) (Section 889(a)(1)(A) of Pub. L. 115- 232).(v) 52.219-8, Utilization of Small Business Concerns (Oct 2022) (15 U.S.C. 637(d)(2) and (3)), in all subcontracts that offer further subcontracting opportunities. If the subcontract (except subcontracts to small business concerns) exceeds the applicable threshold specified in FAR 19.702(a) on the date of subcontract award, the subcontractor must include 52.219-8 in lower tier subcontracts that offer subcontracting opportunities.(vi) 52.222-21, Prohibition of Segregated Facilities (Apr 2015).---(vii) 52.222-26, Equal Opportunity (Sep 2015) (E.O.11246).(viii) 52.222-35, Equal Opportunity for Veterans (Jun 2020) (38 U.S.C. 4212).---(ix) 52.222-36, Equal Opportunity for Workers with Disabilities (Jun 2020) (29 U.S.C. 793).(x) 52.222-37, Employment Reports on Veterans (Jun 2020) (38 U.S.C. 4212).---(xi) 52.222-40, Notification of Employee Rights Under the National Labor Relations Act (Dec 2010) (E.O. 13496). Flow down required in accordance with paragraph (f) of FAR clause 52.222-40.(xii) 52.222-41, Service Contract Labor Standards (Aug 2018) (41 U.S.C. chapter 67).---(xiii) (A) 52.222-50, Combating Trafficking in Persons (Nov 2021) (22 U.S.C. chapter 78 and E.O 13627). (B) Alternate I (Mar 2015) of 52.222-50 (22 U.S.C. chapter 78 and E.O. 13627).(xiv) 52.222-51, Exemption from Application of the Service Contract Labor Standards to Contracts for Maintenance, Calibration, or Repair of Certain Equipment- Requirements (May 2014) (41 U.S.C. chapter 67).(xv) 52.222-53, Exemption from Application of the Service Contract Labor Standards to Contracts for Certain Services-Requirements (May 2014) (41 U.S.C. chapter 67).", "chunk_id": 37, "page_no": 30}, {"chunk": "(xvi) 52.222-54, Employment Eligibility Verification (May 2022) (E.O. 12989).---(xvii) 52.222-55, Minimum Wages for Contractor Workers Under Executive Order 14026 (Jan 2022).(xviii) 52.222-62, Paid Sick Leave Under Executive Order 13706 (Jan 2022) (E.O. 13706).(xix) (A) 52.224-3, Privacy Training (Jan 2017) (5 U.S.C. 552a). (B) Alternate I (Jan 2017) of 52.224-3.RFP: 70Z04424RESIAB01---30(xx) 52.225-26, Contractors Performing Private Security Functions Outside the United States (Oct 2016) (Section 862, as amended, of the National Defense Authorization Act for Fiscal Year 2008; 10 U.S.C. Subtitle A, Part V, Subpart G Note).(xxi) 52.226-6, Promoting Excess Food Donation to Nonprofit Organizations (Jun 2020) (42 U.S.C. 1792). Flow down required in accordance with paragraph (e) of FAR clause 52.226-6.(xxii) 52.232-40, Providing Accelerated Payments to Small Business Subcontractors (Mar 2023) (31 U.S.C. 3903 and 10 U.S.C. 3801). Flow down required in accordance with paragraph (c) of 52.232-40.(xxiii) 52.247-64, Preference for Privately Owned U.S.-Flag Commercial Vessels (Nov 2021) (46 U.S.C. 55305 and 10 U.S.C. 2631). Flow down required in accordance with paragraph (d) of FAR clause 52.247-64.(2) While not required, the Contractor may include in its subcontracts for commercial products and commercial services a minimal number of additional clauses necessary to satisfy its contractual obligations.(End of clause)---All Clauses in Section C flow down and are applicable to all TOs. Individual TOs may include additional clauses.(END OF SECTION)", "chunk_id": 38, "page_no": 31}, {"chunk": "RFP: 70Z04424RESIAB01---31D. CONTRACT DOCUMENTS, EXHIBITS, AND ATTACHMENTS---Attachment 1: Scope of Work Attachment 2: Reserved Attachment 3: Reserved Attachment 4: IDIQ Pricing Rates Attachment 5: Labor Categories Attachment 6: C5ISC Task Order Performance Work Statement (PWS) Exhibit A: CDRL A001, Post Award Conference Exhibit 1: Past Performance Questionnaire Exhibit 2: Question and Answer TemplateNote: Exhibit 1 and 2 will not be included in the contract upon award. All other documents listed in Section D will be incorporated into the contract upon award. For Attachment 4, the awardee’s proposed fully burdened rates will be incorporated upon award.(END OF SECTION)RFP: 70Z04424RESIAB01---32E. SOLICITATION PROVISIONS---FAR Provision 52.252-1 Solicitation Provisions Incorporated by Reference (FEB 1998) This solicitation incorporates one or more solicitation provisions by reference, with the same force and effect as if they were given in full text. Upon request, the Contracting Officer will make their full text available. The offeror is cautioned that the listed provisions may include blocks that must be completed by the offeror and submitted with its quotation or offer. In lieu of submitting the full text of those provisions, the offeror may identify the provision by paragraph identifier and provide the appropriate information with its quotation or offer. Also, the full text of a solicitation provision may be accessed electronically at this/these address(es): http://www.acquisition.gov/far/", "chunk_id": 39, "page_no": 33}, {"chunk": "(End of provision)---Provisions Incorporated by Reference---Provision No. 52.204-7 52.204-16Title---Date---System for Award Management Commercial and Government Entity Code Reporting Representation Regarding Certain Telecommunications and Video NOV 2021 Surveillance Services or Equipment OCT 2020 Covered Telecommunications Equipment or Services-Representation Instructions to Offerors—Commercial Products and Commercial Services MAR 2023OCT 2018 AUG 202052.204-24 52.204-26 52.212-1FAR Provision 52.212-1, Instructions to Offerors - Commercial Products and Commercial Services (MAR 2023) is incorporated by reference.Addendum to FAR Provision 52.212-1---a) North American Industry Classification System (NAICS) code and small business size standard. The NAICS code and small business size standard for this acquisition is 541519, Other Computer Related Services, small business size standard is $34,000,000.00.b) Submission of offers---1) Offeror shall submit a complete proposal as specified below:Phase One: No Later Than XX September 2023 at 11:00 AM Eastern Time2) Delivery of Proposal. Offerors shall submit proposal electronically to the addresses as indicatedbelow.---E-Mail: Offerors shall submit their proposal to Eric.R.St.Pierre@uscg.mil, and Jessica.L.Coltz@uscg.mil. Note: Attachments to e-mails shall be less than 10MB and USCG policy does not allow receipt of WinZip files via e-mail.3) Proposals shall include the solicitation number on all submissions. It is each Offeror’s responsibility to ensure the proposal is received on time. Any proposal received after the date and time indicated will be considered late.4) It shall be the obligation of the Offeror to exercise due diligence to discover and to bring to theattention of the USCG any ambiguities, inconsistencies, or concerns regarding the information in the Request for Proposal by the established question due date. All questions regarding this RFP shall be submitted in writing using Exhibit 2, Question and Comment Form, toEric.R.St.Pierre@uscg.mil and", "chunk_id": 40, "page_no": 33}, {"chunk": "RFP: 70Z04424RESIAB01---33Jessica.L.Coltz@uscg.mil. All questions are due No Later Than XX August 2023 at 11:00 AM Eastern Time5) Period of acceptance of offers. The offeror agrees to hold the prices in its offer firm for 180calendar days from the date specified for receipt of offers, unless another time period is specified in an addendum to the solicitation.c) Instructions to Offerors:---1) Offers submitted in response to this solicitation shall be in the English language and in terms of U.S. dollars. Paper size shall be 8-1/2 by 11-inch. The font (typewritten or printed letters) shall be 12- point Times New Roman (with the exception of pre-printed product literature). No reduction in font or print size is permitted except for organization charts or other graphic illustrations. In those instances where reduction is allowable, Offerors shall ensure that the print is easily readable; no less than 8-point font on graphs and 10-point font on tables. Each page shall have at least one-inch margins on each side. Information in the header/footer will not be evaluated.Proposal Volume---Description---# of Pages 1 page---Volume I---Cover Letter Solicitation, Offeror, and Certifications/Representations---Volume II---N/A---1 page for the Prime Contractor + 1 page for each subcontractor or teaming partner (if appropriate)Volume III---Facility Clearance (Pass/Fail)---Phase One; Factor 1: Prior Experience Phase Two; Factor 2: Technical Approach Phase Two; Factor 3: Management Approach", "chunk_id": 41, "page_no": 34}, {"chunk": "Volume IV---10 pages---Volume V---10 pages---Volume VI---5 pages---One Exhibit 1 – Past Performance Questionnaire for each Past Performance example submitted 5 pages + Attachment 4Phase Two; Factor 4: Past Performance---Volume VII---Volume VIII---Phase Two; Factor 5: Pricing---2) The proposal shall be submitted in two (2) phases, and five (5) volumes. Proposal Volumes I-III shall be submitted with Phase One proposal submission, however are not considered to be part of Phase One.3) Phase One: An email version of the offeror’s proposal is requested that includes Volume IV.4) Phase Two: The email submission requirements will be identified in the Phase Two Instructions.Between each phase the Government will send advisory notifications to Offerors participating in the current phase after the Government has concluded evaluations. The notification will advise the Offeror of the Government’s advisory recommendation to proceed or not to proceed to the next Phase. The Government does not intend to provide debriefings after the completion of the advisory notifications. Offerors who are found to be viable competitors will be advised to proceed to the next Phase of the proposal submission process. Offerors who are identified as unlikely to be viable competitors will be advised that they are unlikely to be viable competitors. The intent of the advisory", "chunk_id": 42, "page_no": 34}, {"chunk": "RFP: 70Z04424RESIAB01---34notice is to minimize development and other costs for those Offerors with little to no chance of receiving an award. The Government’s advice will be recommendation only and Offerors may elect to continue or not to continue their participation in the procurement. The Government will provide specific instructions for the next Phase after receiving the Offeror’s decision to proceed. Note: The Government will not provide Offerors feedback regarding their proposals until after award.Following Government advisory recommendation post Phase I, Offerors will have approximately two (2) business days to notify Government of their intent to proceed to Phase II; actual timeline will be communicated within the notification. Upon receipt of the intent to proceed or not, the Government will provide Phase II specific instructions in approximately two (2) business days. Each Offeror will have at least two (2) weeks from the Government’s release of the Phase II specific instructions to prepare the submission for Phase II.An Offeror must submit a response for Phase I at the time of the proposal submission date to be considered for evaluation and award. Failure to submit a response in Phase I precludes an Offeror from submitting a response for Phase II. An Offeror that does not participate in both Phases of the procurement process will not be eligible for award consideration.", "chunk_id": 43, "page_no": 35}, {"chunk": "5) VOLUMES I – VIII---i. Volume I - Cover Letter (Page limit 1 page): Cover Letter shall include the Offer’s name and address; USCG solicitation number; System for Award Management (SAM) Unique Entity Identification (UEI) number; CAGE number; Offeror’s point of contract including their phone number and e-mail address, and the date the Offeror’s proposal expires and acknowledgement of solicitation Amendments if applicable.ii. Volume II – Solicitation, Offer, and Certifications/Representation: A completed copy of the representations and certifications at FAR 52.212-3, Alternate 1. A statement specifying the extent of agreement with all terms, conditions and provisions included in the solicitation. Offerors that fail to furnish required representations or information, or reject the terms and conditions of the solicitation, may be excluded from considerations.iii. Volume III – Facility Clearance (Page limit 1 page for Prime Contractor and 1 page each for any subcontractors or teaming partners): Offerors shall include a current facility clearance at a level of Secret issued by the Defense Counter-Intelligence and Security Agency (DCSA) for the Prime contractor, Joint Venture, or one or more members of the partnership/proposed partnership, at the time of proposal submission. This shall be provided on company letterhead and must include full business name and address, UEI number, Commercial and Government Entity (CAGE) code, date FCL granted, and cognizant DSS security office address with phone number.", "chunk_id": 44, "page_no": 35}, {"chunk": "Phase One---iv. Volume IV – Prior Experience (Page limit 10 pages): Offerors shall provide examples for the prime Offeror and subcontractor, if applicable. The prime Offeror and any subcontractor must submit at least one example of prior experience. The examples of prior experience must be for contracts that are ongoing or completed within the past three (3) years from the date of the solicitation. Offerors shall furnish any number of examples (within the page limitations) that collectively demonstrate experience with the following areas:(1) Information System Security Officer (ISSO) and Alternate ISSO (AISSO) services, Information System Security Engineer (ISSE) services, Security Control Assessor (SCA) services, and Cybersecurity Compliance and Readiness Services as described in the IDIQRFP: 70Z04424RESIAB01---35Scope of Work to meet the requirements of the USCG Cybersecurity RMF process and cybersecurity of USCG Information Systems.(2) Assignment and management of concurrent work efforts under multiple task orders.---Each example of demonstrated experience shall include an information section detailing: agency or company name for whom the work is being/was performed, client name and contact information (phone number/email address), contract/task order number (only one contract/task number per example), period of performance, and a concise description of services provided.The Government is interested in the Offeror’s experience as a whole. The information provided shall be sufficiently detailed that the Government can determine whether the examples demonstrate the Offeror’s experience. The Government is more interested in the similarity of the prior experience examples to the areas above than the quantity of examples. The Government will not contact references to obtain detail lacking from the Offeror’s response. However, the Government reserves the right to contact the references provided to confirm the accuracy of the information provided in the Offeror’s response.", "chunk_id": 45, "page_no": 36}, {"chunk": "Phase Two---vi. Volume V – (Page limit 10 pages total). Technical Approach: The offeror’s technical responseshall address the proposed technical approach to accomplish all tasking areas stated within the IDIQ Scope of Work. The approach should address each requirement in sufficient detail to demonstrate a clear understanding of the IDIQ Scope of Work. Offerors shall include a discussion of their efficiencies and unique aspects of their technical approach.Specific scenario-based questions will be provided with the Phase Two instructions and must be addressed within the offeror’s technical approach, Volume V.vii. Volume VI – (Page limit 5 pages total). Management Approach: The Offeror’s management approach should contain the offeror’s plan for program management and organization structure to accomplish the tasks of the Scope of Work as well as its plan for maintaining competent staffing for all task orders within the confines of 52.219-14. The offeror shall demonstrate their management approach with emphasis on the applied use of quality controls, performance monitoring and policies to ensure appropriate management and execution of the requirements specified in the Scope of Work. The Offeror’s proposal shall also address the proposed organizational structure, staffing/labor mix, understanding and ability to provide personnel, key and non-key, with the required qualifications/certifications, and their proposed retention plan.viii. Volume VII - Past Performance (Exhibit 1): Offerors shall utilize the Past PerformanceQuestionnaire (PPQ) (Exhibit 1). Offerors shall complete Section 1 of the PPQ and send it to the POC, which is listed in Section 1 of the PPQ. Offerors shall request that each POC complete Section 2 of the PPQ and return it to the USCG in accordance with the instructions in Section 2. It is the Offeror’s responsibility to ensure all the required information in Section 1 is valid.Offerors shall submit at least three (3) but no more than five (5) relevant past performance references. The references shall cover contracts with private industry or government entities (Federal, state, or local) for Information Assurance (IA) Risk Management Framework (RMF) services as specified in the IDIQ Scope of Work. The Offeror is not required to submit past performance references for the examples submitted under the Prior Experience Factor. If available, past performance may be provided for those contracts identified under prior experience.", "chunk_id": 46, "page_no": 36}, {"chunk": "RFP: 70Z04424RESIAB01---36ix. Volume VIII - Price (Page limit 5 pages and Attachment 4): Offerors shall complete andsubmit Attachment 4, IDIQ Pricing Rates.---a) Attachment 4 is comprised of two worksheets, Instructions and IDIQ Maximum Rates. Offerors shall include fully-burdened hourly labor rates for each labor category for both Government Site and Contractor Site performance.11) Proposal Preparation Costs: This RFP does not commit the Government to pay any cost for thepreparation and submission of a proposal in response to this RFP. The KO is the only individual who can legally commit the Government to the expenditure of public funds in connection with this procurement.(End of provision)---FAR Provision 52.212-2, Evaluation – Commercial Items (Oct 2014)---The Government intends to award a single IDIQ contract resulting from this solicitation to the responsible offeror whose proposal conforms to the solicitation and will be most advantageous to the Government, price and other factors considered. The following factors shall be used to evaluate offers and are listed in descending order of importance:Factor 1: Prior Experience (Phase One) Factor 2: Technical Approach (Phase Two) Factor 3: Management Approach (Phase Two) Factor 4: Past Performance (Phase Two) Factor 5: Price (Phase Two)Phase One Factor 1 will be used initially to prepare the advisory notice on offerors viability for Phase Two.Phase Two Factors 2 through 4 will be evaluated.Factors 1-4 Prior Experience, Technical Approach, Management Approach, and Past Performance are arranged in descending order of importance and, when combined, are significantly more important than Factor 5, Price.The Government will conduct a tradeoff to determine the Offeror whose proposal represents the best value to the Government. For the purposes of this RFP, “best value” is defined as the procurement process resulting in the most advantageous acquisition decision for the Government and is performed through a trade-off analysis among the five evaluation factors. In doing so, the Government may award to other than the lowest priced proposal or other than the highest rated proposal.a) The Government intends to evaluate the proposals and award without discussions with Offerors.Therefore, the Offeror’s initial proposal should contain the Offeror’s best terms from a technical and price standpoint. However, the Government reserves the right to conduct discussions with one or more Offerors at any time during the evaluation Phases.b) The Government may reject any and all proposals if such action is in the Government’s interest. TheGovernment may waive informalities and minor irregularities in proposals received.c) For each Phase, the Government will review the proposal to ensure that all requiredvolumes/information have been included for the current Phase. If the proposal is missing any required volumes/information, the proposal will be rejected and the Offeror will not be eligible for award. If the Offeror submits a proposal conforming to the solicitation, the Offeror’s proposal will be evaluated.", "chunk_id": 47, "page_no": 37}, {"chunk": "RFP: 70Z04424RESIAB01---37e) The Government reserves the right to incorporate any part of the awardee’s proposal, in part or whole, into the award. If the Government elects to exercise this right, the Government will address with the awardee whether or not that aspect of the proposal needs to be protected due to being proprietary or a trade secret.f) Factors 1-4 will receive confidence ratings. Under the price factor, Factor 5, the total evaluated priceproposed for evaluation purposes will be evaluated for reasonableness.d) PHASE ONE:---1. FACILITY CLEARANCE---The Government will evaluate the Offeror’s Facility Clearance (FCL) at time of proposal submission to ensure the Prime Contractor or Joint Venture, as well as any subcontractors if applicable, have a SECRET FCL approved/issued by Defense Counter Intelligence and Security Agency (DCSA) and posted in the Defense Security Service (DSS) Industrial Security Facility Database (ISFD).If the Offeror possesses a verifiable SECRET FCL at the time of proposal submission, the Offeror’s Factor 1 submission will be evaluated. If the Offeror does not possess a verifiable SECRET FCL at the time of proposal submission, the Offeror’s Factor 1 submission will not be evaluated and the Offeror will be ineligible for award.2. FACTOR 1: PRIOR EXPERIENCE---The Government will evaluate the prime Offeror’s and each subcontractor’s ability to successfully perform the IDIQ scope based on its collectively demonstrated prior experience in the areas listed in paragraph (c)5.iv of FAR Provision 52.212-1 above on contracts that are ongoing or have been completed within three (3) years of the date of the solicitation. The Government is more interested in the similarity of the prior experience examples to the IDIQ Scope of Work than the quantity of examples.", "chunk_id": 48, "page_no": 38}, {"chunk": "e) PHASE TWO:---1. FACTOR 2: TECHNICAL APPROACH---The Government will evaluate the offeror’s proposed technical approach and responses to the scenario- based questions, to determine if the offeror demonstrates a clear understanding of the work to be performed. Offeror’s responses to scenario-based questions will be evaluated and incorporated into the overall evaluation of the factor.2. FACTOR 3: MANAGEMENT APPROACH---The Government will evaluate the Offeror’s proposed organizational structure and proposed labor categories and program management approach for attracting, retaining, and/or acquiring qualified personnel across multiple task orders that lead to the successful accomplishment of the full scope of work. The Government will also evaluate the offeror’s proposed management approach to ensure compliance with Limitation on Subcontracting, FAR 52.219-14.3. FACTOR 4: PAST PERFORMANCE---The Government will evaluate the Offeror’s past performance information by reviewing and considering the information provided in the Past Performance Questionnaires. The Government reserves the right toRFP: 70Z04424RESIAB01---38utilize past performance information from sources including, but not limited to, data contained in the Contractor Performance Assessment Reporting System (CPARS).An Offeror without a record of relevant past performance within the past three years, or for whom information on past performance is not available, will not be evaluated favorably or unfavorably, but will receive a confidence rating of neutral.", "chunk_id": 49, "page_no": 39}, {"chunk": "4. FACTOR 5: PRICE---The Government will evaluate each Offeror's total evaluated price for reasonableness. The total evaluated price consists of the total amount for each year for both the Government Site Rates and Contractor Site rates, utilizing the IDIQ Maximum Labor Rates Tab in Attachment 4, IDIQ Pricing Rates, as well as the 6-month option period under FAR 52.217-8, Option to Extend Services. The price for the 6-month option period will be evaluated using year 5 rates. Evaluation of the 6-months under 52.217-8 does not obligate the Government to exercise it.f) Selection for Award---Award shall be made to the Offeror whose proposal, in conforming to this solicitation, is determined to be the best value to the Government based on a tradeoff among the non-priced and priced factors considered. Additionally, only an apparent successful contractor determined to be responsible pursuant to FAR 9.104-1 will be issued a contract.(End of provision)---FAR Provision 52.204-20, Predecessor of Offeror (AUG 2020)---(a) Definitions. As used in this provision–Commercial and Government Entity (CAGE) code means–---(1) An identifier assigned to entities located in the United States or its outlying areas by the DefenseLogistics Agency (DLA) Commercial and Government Entity (CAGE) Branch to identify a commercial or government entity by unique location; or(2) An identifier assigned by a member of the North Atlantic Treaty Organization (NATO) or by theNATO Support and Procurement Agency (NSPA) to entities located outside the United States and its outlying areas that the DLA Commercial and Government Entity (CAGE) Branch records and maintains in the CAGE master file. This type of code is known as a NATO CAGE (NCAGE) code.Predecessor means an entity that is replaced by a successor and includes any predecessors of", "chunk_id": 50, "page_no": 39}, {"chunk": "the predecessor.---Successor means an entity that has replaced a predecessor by acquiring the assets and carrying out theaffairs of the predecessor under a new name (often through acquisition or merger). The term \"successor\" does not include new offices/divisions of the same company or a company that only changes its name. The extent of the responsibility of the successor for the liabilities of the predecessor may vary, depending on State law and specific circumstances.(b) The Offeror represents that it □ is or □ is not a successor to a predecessor that held a Federal contractor grant within the last three years.---RFP: 70Z04424RESIAB01---39(c) If the Offeror has indicated \"is\" in paragraph (b) of this provision, enter the following information for all predecessors that held a Federal contract or grant within the last three years (if more than one predecessor, list in reverse chronological order):Predecessor CAGE code:____________ (or mark \"Unknown\").Predecessor legal name: ____________.---(Do not use a \"doing business as\" name).(End of provision)---FAR Provision 52.209-7 Information Regarding Responsibility Matters (Oct 2018) (a) Definitions. As used in this provision— “Administrative proceeding” means a non-judicial process that is adjudicatory in nature in order to make a determination of fault or liability (e.g., Securities and Exchange Commission Administrative Proceedings, Civilian Board of Contract Appeals Proceedings, and Armed Services Board of Contract Appeals Proceedings). This includes administrative proceeding at the Federal and State level but only in connection with performance of a Federal contract or grant. It does not include agency actions such as contract audits, site visits, corrective plans, or inspection of deliverables.", "chunk_id": 51, "page_no": 40}, {"chunk": "“Federal contracts and grants with total value greater than $10,000,000” means—---(1) The total value of all current, active contracts and grants, including all priced options; and(2) The total value of all current, active orders including all priced options under indefinite-delivery, indefinite-quantity, 8(a), or requirements contracts (including task and delivery and multiple-award Schedules).“Principal” means an officer, director, owner, partner, or a person having primary management or supervisory responsibilities within a business entity (e.g., general manager; plant manager; head of a division or business segment; and similar positions).(b) The offeror [_] has [_] does not have current active Federal contracts and grants with total value greater than $10,000,000.(c) If the offeror checked “has” in paragraph (b) of this provision, the offeror represents, by submission of this offer, that the information it has entered in the Federal Awardee Performance and Integrity Information System (FAPIIS) is current, accurate, and complete as of the date of submission of this offer with regard to the following information:(1) Whether the offeror, and/or any of its principals, has or has not, within the last five years, in connection with the award to or performance by the offeror of a Federal contract or grant, been the subject of a proceeding, at the Federal or State level that resulted in any of the following dispositions:", "chunk_id": 52, "page_no": 40}, {"chunk": "(i) In a criminal proceeding, a conviction.---(ii) In a civil proceeding, a finding of fault and liability that results in the payment of a monetary fine, penalty, reimbursement, restitution, or damages of $5,000 or more.(iii) In an administrative proceeding, a finding of fault and liability that results in—(A) The payment of a monetary fine or penalty of $5,000 or more; orRFP: 70Z04424RESIAB01---40(B) The payment of a reimbursement, restitution, or damages in excess of $100,000.(iv) In a criminal, civil, or administrative proceeding, a disposition of the matter by consent or compromise with an acknowledgment of fault by the Contractor if the proceeding could have led to any of the outcomes specified in paragraphs (c)(1)(i), (c)(1)(ii), or (c)(1)(iii) of this provision.(2) If the offeror has been involved in the last five years in any of the occurrences listed in (c)(1) of this provision, whether the offeror has provided the requested information with regard to each occurrence.(d) The offeror shall post the information in paragraphs (c)(1)(i) through (c)(1)(iv) of this provision in FAPIIS as required through maintaining an active registration in the System for Award Management via https://www.sam.gov (see 52.204-7).(End of provision)---FAR Provision 52.233-2, Service of Protest (Sep 2006) (a) Protests, as defined in section 33.101 of the Federal Acquisition Regulation, that are filed directly with an agency, and copies of any protests that are filed with the Government Accountability Office (GAO), shall be served on the Contracting Officer (addressed as follows) by obtaining written and dated acknowledgment of receipt from: U.S. Coast Guard C5ISC Attn: Protest- Contracting Officer Jessica Coltz CG-91432 4000 Coast Guard Blvd., Annex 4 Portsmouth, VA 23703-2199 Cc via Email: Jessica.L.Coltz@uscg.mil and Eric.R.St.Pierre@uscg.mil.(b) The copy of any protest shall be received in the office designated above within one day of filing a protest with the GAO.", "chunk_id": 53, "page_no": 41}, {"chunk": "(End of provision)---FAR Provision 52.212-3, Offeror Representations and Certifications – Commercial Products and Commercial Services (Dec 2022), Alternate 1 (OCT 2014)The Offeror shall complete only paragraph (b) of this provision if the Offeror has completed the annualrepresentations and certification electronically in the System for Award Management (SAM) accessed through https://www.sam.gov. If the Offeror has not completed the annual representations and certifications electronically, the Offeror shall complete only paragraphs (c) through (v) of this provision.(a) Definitions. As used in this provision—\"Covered telecommunications equipment or services\" has the meaning provided in the clause 52.204-25, Prohibition on Contracting for Certain Telecommunications and Video Surveillance Services or Equipment.Economically disadvantaged women-owned small business (EDWOSB) concern means a small businessconcern that is at least 51 percent directly and unconditionally owned by, and the management and daily business operations of which are controlled by, one or more women who are citizens of the United States and who are economically disadvantaged in accordance with 13 CFR part 127, and the concern is certified by SBA or an approved third-party certifier in accordance with 13 CFR 127.300. It automatically qualifies as a women-owned small business eligible under the WOSB Program.Forced or indentured child labor means all work or service—RFP: 70Z04424RESIAB01---41(1) Exacted from any person under the age of 18 under the menace of any penalty for itsnonperformance and for which the worker does not offer himself voluntarily; or(2) Performed by any person under the age of 18 pursuant to a contract the enforcement of which canbe accomplished by process or penalties.Highest-level owner means the entity that owns or controls an immediate owner of the offeror, or thatowns or controls one or more entities that control an immediate owner of the offeror. No entity owns or exercises control of the highest level owner.Immediate owner means an entity, other than the offeror, that has direct control of the offeror. Indicatorsof control include, but are not limited to, one or more of the following: ownership or interlocking management, identity of interests among family members, shared facilities and equipment, and the common use of employees.Inverted domestic corporation, means a foreign incorporated entity that meets the definition ofan inverted domestic corporation under 6 U.S.C. 395(b), applied in accordance with the rules and definitions of 6 U.S.C. 395(c).Manufactured end product means any end product in product and service codes (PSCs) 1000-9999,", "chunk_id": 54, "page_no": 42}, {"chunk": "except—---(1) PSC 5510, Lumber and Related Basic Wood Materials;---(2) Product or Service Group (PSG) 87, Agricultural Supplies;---(3) PSG 88, Live Animals;---(4) PSG 89, Subsistence;---(5) PSC 9410, Crude Grades of Plant Materials;---(6) PSC 9430, Miscellaneous Crude Animal Products, Inedible;---(7) PSC 9440, Miscellaneous Crude Agricultural and Forestry Products;---(8) PSC 9610, Ores;(9) PSC 9620, Minerals, Natural and Synthetic; and---(10) PSC 9630, Additive Metal Materials.---Place of manufacture means the place where an end product is assembled out of components, orotherwise made or processed from raw materials into the finished product that is to be provided to the Government. If a product is disassembled and reassembled, the place of reassembly is not the place of manufacture.Predecessor means an entity that is replaced by a successor and includes any predecessors ofthe predecessor.---Reasonable inquiry has the meaning provided in the clause 52.204-25, Prohibition on Contracting forCertain Telecommunications and Video Surveillance Services or Equipment.---Restricted business operations means business operations in Sudan that include power productionactivities, mineral extraction activities, oil-related activities, or the production of military equipment, as those terms are defined in the Sudan Accountability and Divestment Act of 2007 (Pub. L. 110-174). RestrictedRFP: 70Z04424RESIAB01---42business operations do not include business operations that the person (as that term is defined in Section 2 of the Sudan Accountability and Divestment Act of 2007) conducting the business can demonstrate—(1) Are conducted under contract directly and exclusively with the regional government of southern", "chunk_id": 55, "page_no": 43}, {"chunk": "Sudan;---(2) Are conducted pursuant to specific authorization from the Office of Foreign Assets Control in theDepartment of the Treasury, or are expressly exempted under Federal law from the requirement to be conducted under such authorization;(3) Consist of providing goods or services to marginalized populations of Sudan;(4) Consist of providing goods or services to an internationally recognized peacekeeping force orhumanitarian organization;---(5) Consist of providing goods or services that are used only to promote health or education; or(6) Have been voluntarily suspended.\"Sensitive technology\"—Sensitive technology—---(1) Means hardware, software, telecommunications equipment, or any other technology that is to beused specifically—(i) To restrict the free flow of unbiased information in Iran; or(ii) To disrupt, monitor, or otherwise restrict speech of the people of Iran; and(2) Does not include information or informational materials the export of which the President doesnot have the authority to regulate or prohibit pursuant to section 203(b)(3)of the International Emergency Economic Powers Act (50 U.S.C. 1702(b)(3)).Service-disabled veteran-owned small business concern—---(1) Means a small business concern—(i) Not less than 51 percent of which is owned by one or more service-disabled veterans or, in the case of any publicly owned business, not less than 51 percent of the stock of which is owned by one or more service-disabled veterans; and(ii) The management and daily business operations of which are controlled by one or moreservice-disabled veteransor, in the case of a service-disabled veteran with permanent and severe disability, the spouse or permanent caregiver of such veteran.(2) Service-disabled veteran means a veteran, as defined in 38 U.S.C. 101(2), with a disability that isservice connected, as defined in 38 U.S.C. 101(16).", "chunk_id": 56, "page_no": 43}, {"chunk": "Small business concern—---(1) Means a concern, including its affiliates, that is independently owned and operated, not dominantin its field of operation, and qualified as a small business under the criteria in 13 CFR part 121 and size standards in this solicitation.(2) Affiliates, as used in this definition, means business concerns, one of whom directly or indirectly controls or has the power to control the others, or a third party or parties control or have the power to control the others. In determining whether affiliation exists, consideration is given to all appropriate factorsRFP: 70Z04424RESIAB01---43including common ownership, common management, and contractual relationships. SBA determines affiliation based on the factors set forth at 13 CFR 121.103.Small disadvantaged business concern, consistent with13 CFR 124.1002, means a small businessconcern under the size standard applicable to the acquisition, that—---(1) Is at least 51 percent unconditionally and directly owned (as defined at 13 CFR 124.105) by—(i) One or more socially disadvantaged (as defined at13 CFR 124.103) and economically disadvantaged (as defined at 13 CFR 124.104) individuals who are citizens of the United States; and(ii) Each individual claiming economic disadvantage has a net worth not exceeding $750,000after taking into account the applicable exclusions set forth at 13 CFR124.104(c)(2); and(2) The management and daily business operations of which are controlled (as defined at 13.CFR124.106) by individuals, who meet the criteria in paragraphs (1)(i) and (ii) of this definition.Subsidiary means an entity in which more than 50 percent of the entity is owned—", "chunk_id": 57, "page_no": 44}, {"chunk": "(1) Directly by a parent corporation; or---(2) Through another subsidiary of a parent corporation---Successor means an entity that has replaced a predecessor by acquiring the assets and carrying out theaffairs of the predecessor under a new name (often through acquisition or merger). The term \"successor\" does not include new offices/divisions of the same company or a company that only changes its name. The extent of the responsibility of the successor for the liabilities of the predecessor may vary, depending on State law and specific circumstances.Veteran-owned small business concern means a small business concern—(1) Not less than 51 percent of which is owned by one or more veterans (as defined at 38 U.S.C.101(2)) or, in the case of any publicly owned business, not less than 51 percent of the stock of which is owned by one or more veterans; and(2) The management and daily business operations of which are controlled by one or more veterans.Women-owned business concern means a concern which is at least 51 percent owned by one or more women; or in the case of any publicly owned business, at least 51 percent of its stock is owned by one or more women; and whose management and daily business operations are controlled by one or more womenWomen-owned small business concern means a small business concern—(1) That is at least 51 percent owned by one or more women; or, in the case of any publicly ownedbusiness, at least51 percent of the stock of which is owned by one or more women; and(2) Whose management and daily business operations are controlled by one or more women.", "chunk_id": 58, "page_no": 44}, {"chunk": "Women-owned small business (WOSB) concern eligible under the WOSB Program (in accordance---with 13 CFR part 127), means a small business concern that is at least 51 percent directly and unconditionally owned by, and the management and daily business operations of which are controlled by, one or more women who are citizens of the United States, and the concern is certified by SBA or an approved third-party certifier in accordance with 13 CFR 127.300.(b)RFP: 70Z04424RESIAB01---44(1) Annual Representations and Certifications. Any changes provided by the Offeror in paragraph(b)(2) of this provision do not automatically change the representations and certifications in SAM.(2) The offeror has completed the annual representations and certifications electronically in SAMaccessed through http://www.sam.gov. After reviewing SAM information, the Offeror verifies by submission of this offer that the representations and certifications currently posted electronically at FAR 52.212- 3, Offeror Representations and Certifications-Commercial Products and Commercial Services, have been entered or updated in the last 12 months, are current, accurate, complete, and applicable to this solicitation (including the business size standard(s) applicable to the NAICS code(s) referenced for this solicitation), at the time this offer is submitted and are incorporated in this offer by reference (see FAR 4.1201), except for paragraphs __.[Offeror to identify the applicable paragraphs at (c) through (v) of this provision that the offeror hascompleted for the purposes of this solicitation only, if any.These amended representation(s) and/or certification(s) are also incorporated in this offer and are", "chunk_id": 59, "page_no": 45}, {"chunk": "current, accurate, and complete as of the date of this offer.---Any changes provided by the offeror are applicable to this solicitation only, and do not result in anupdate to the representations and certifications posted electronically on SAM.](c) Offerors must complete the following representations when the resulting contract is for supplies to bedelivered or services to be performed in the United States or its outlying areas, or when the contracting officer has applied part 19 in accordance with 19.000(b)(1)(ii). Check all that apply.(1) Small business concern. The offeror represents as part of its offer that—(i) It □ is, □ is not a small business concern; or(ii) It □ is, □ is not a small business joint venture that complies with the requirements of 13 CFR121.103(h) and 13 CFR 125.8(a) and (b). [ The offeror shall enter the name and unique entity identifier of each party to the joint venture: ____________.](2) Veteran-owned small business concern. [Complete only if the offeror represented itself as a smallbusiness concern in paragraph (c)(1) of this provision.] The offeror represents as part of its offer that it □ is, □ is not a veteran-owned small business concern.(3) Service-disabled veteran-owned small business concern. [ Complete only ifthe offeror represented itself as a veteran-owned small business concern in paragraph (c)(2) of this provision.] The offeror represents as part of its offer that—(i) It □ is, □ is not a service-disabled veteran-owned small business concern; or(ii)It □ is, □ is not a joint venture that complies with the requirements of 13 CFR125.18(b)(1) and (2). [The offeror shall enter the name and unique entity identifier of each party to the joint venture: ____________.] Each service-disabled veteran-owned small business concern participating in the joint venture shall provide representation of its service-disabled veteran-owned small business concern status.(4) Small disadvantaged business concern. [Complete only if the offeror represented itself as a smallbusiness concern in paragraph (c)(1) of this provision.] The offeror represents, that it □ is, □ is not a small disadvantaged business concern as defined in 13 CFR 124.1002.(5) Women-owned small business concern. [Complete only if the offeror represented itself as a small business concern in paragraph (c)(1) of this provision.] The offeror represents that it □ is, □ is not a women- owned small business concern.", "chunk_id": 60, "page_no": 45}, {"chunk": "RFP: 70Z04424RESIAB01---45(6) WOSB joint venture eligible under the WOSB Program. The offeror represents that it □ is, □ isnot a joint venture that complies with the requirements of 13 CFR 127.506(a) through (c). [ The offeror shall enter the name and unique entity identifier of each party to the joint venture: ____________.](7) Economically disadvantaged women-owned small business (EDWOSB) jointventure. The offeror represents that it □ is, □ is not a joint venture that complies with the requirements of 13 CFR 127.506(a) through (c). [ The offeror shall enter the name and unique entity identifier of each party to the joint venture: ____________.](8) Women-owned business concern (other than small business concern). [Complete only if the offeror is a women-owned business concern and did not represent itself as a small business concern in paragraph (c)(1) of this provision.] The offeror represents that it □ is a women-owned business concern.(9) Tie bid priority for labor surplus area concerns. If this is an invitation for bid, small business offerors may identify the labor surplus areas in which costs to be incurred on account of manufacturing or production (by offeror or first-tier subcontractors) amount to more than 50 percent of the contract price:____________(10) HUBZone small business concern. [Complete only if the offeror represented itself as a smallbusiness concern in paragraph (c)(1) of this provision.] The offeror represents, as part of its offer, that–(i) It □ is, □ is not a HUBZone small business concern listed, on the date of this representation,as having been certified by SBA as a HUBZone small business concern in the Dynamic Small Business Search and SAM, and will attempt to maintain an employment rate of HUBZone residents of 35 percent of its employees during performance of a HUBZone contract (see 13 CFR 126.200(e)(1)); and(ii) It □ is, □ is not a HUBZone joint venture that complies with the requirements of 13 CFR 126.616(a) through (c). [ The offeror shall enter the name and unique entity identifier of each party to the joint venture: ______.] Each HUBZone small business concern participating in the HUBZone joint venture shall provide representation of its HUBZone status.(11) (Complete if the offeror has represented itself as disadvantaged in paragraph (c)(4) of this", "chunk_id": 61, "page_no": 46}, {"chunk": "provision.)---□ Black American.---□ Hispanic American.---□ Native American (American Indians, Eskimos, Aleuts, or Native Hawaiians).---□ Asian-Pacific American (persons with origins from Burma, Thailand, Malaysia, Indonesia,Singapore, Brunei, Japan, China, Taiwan, Laos, Cambodia (Kampuchea), Vietnam, Korea, The Philippines, Republic of Palau, Republic of the Marshall Islands, Federated States of Micronesia, the Commonwealth of the Northern Mariana Islands, Guam, Samoa, Macao, Hong Kong, Fiji, Tonga, Kiribati, Tuvalu, or Nauru).□ Subcontinent Asian (Asian-Indian) American (persons with origins from India, Pakistan,Bangladesh, Sri Lanka, Bhutan, the Maldives Islands, or Nepal).---□ Individual/concern, other than one of the preceding.---(d) Representations required to implement provisions of Executive Order11246-(1) Previous contracts and compliance. The offeror represents that-RFP: 70Z04424RESIAB01---46(i) It □ has, □ has not participated in a previous contract or subcontract subject to the EqualOpportunity clause of this solicitation; and---(ii) It □ has, □ has not filed all required compliance reports.(2) Affirmative Action Compliance. The offeror represents that-(i) It □ has developed and has on file, □ has not developed and does not have on file, at eachestablishment, affirmative action programs required by rules and regulations of the Secretary of Labor (41 CFR parts 60-1 and 60-2), or(ii) It □ has not previously had contracts subject to the written affirmative action programs", "chunk_id": 62, "page_no": 47}, {"chunk": "requirement of the rules and regulations of the Secretary of Labor.---(e) Certification Regarding Payments to Influence Federal Transactions---(31 http://uscode.house.gov/ U.S.C. 1352). (Applies only if the contract is expected to exceed $150,000.) By submission of its offer, the offeror certifies to the best of its knowledge and belief that no Federal appropriated funds have been paid or will be paid to any person for influencing or attempting to influence an officer or employee of any agency, a Member of Congress, an officer or employee of Congress or an employee of a Member of Congress on his or her behalf in connection with the award of any resultant contract. If any registrants under the Lobbying Disclosure Act of 1995 have made a lobbying contact on behalf of the offeror with respect to this contract, the offeror shall complete and submit, with its offer, OMB Standard Form LLL, Disclosure of Lobbying Activities, to provide the name of the registrants. The offeror need not report regularly employed officers or employees of the offeror to whom payments of reasonable compensation were made.(f) Buy American Certificate. (Applies only if the clause at Federal Acquisition Regulation(FAR) 52.225-1, Buy American-Supplies, is included in this solicitation.)(1)(i) The Offeror certifies that each end product and that each domestic end product listed inparagraph (f)(3) of this provision contains a critical component, except those listed in paragraph (f)(2) of this provision, is a domestic end product.(ii) The Offeror shall list as foreign end products those end products manufactured in the United States that do not qualify as domestic end products. For those foreign end products that do not consist wholly or predominantly of iron or steel or a combination of both, the Offeror shall also indicate whether these foreign end products exceed 55 percent domestic content, except for those that are COTS items. If the percentage of the domestic content is unknown, select “no”.(iii) The Offeror shall separately list the line item numbers of domestic end products that containa critical component (see FAR 25.105).(iv) The terms “commercially available off-the-shelf (COTS) item,” “critical component,”“domestic end product,” \"end product,\" \"foreign end product,\" and \"United States\" are defined in the clause of this solicitation entitled \"Buy American-Supplies.\"", "chunk_id": 63, "page_no": 47}, {"chunk": "(2) Foreign End Products:---RFP: 70Z04424RESIAB01---47Exceeds 55% Domestic Content (yes/no)---Line Item No.---Country of Origin---[List as necessary]---(3) Domestic end products containing a critical component:Line Item No. ___---[List as necessary]---(4) The Government will evaluate offers in accordance with the policies and procedures ofFAR part 25.---(g)(1) Buy American-Free Trade Agreements-Israeli Trade Act Certificate. (Applies only if the clause at FAR 52.225-3, Buy American-Free Trade Agreements-Israeli Trade Act, is included in this solicitation.)(i)(A) The Offeror certifies that each end product, except those listed in paragraph (g)(1)(ii) or(iii) of this provision, is a domestic end product and that each domestic end product listed in paragraph (g)(1)(iv) of this provision contains a critical component.(B) The terms \"Bahrainian, Moroccan, Omani, Panamanian, or Peruvian end product,\"---\"commercially available off-the-shelf (COTS) item,\" \"critical component,\" \"domestic end product,\" \"end product,\" \"foreign end product,\" \"Free Trade Agreement country,\" \"Free Trade Agreement country end product,\" \"Israeli end product,\" and \"United States\" are defined in the clause of this solicitation entitled \"Buy American-Free Trade Agreements-Israeli Trade Act.\"(ii) The Offeror certifies that the following supplies are Free Trade Agreement country endproducts (other than Bahrainian, Moroccan, Omani, Panamanian, or Peruvian end products) or Israeli end products as defined in the clause of this solicitation entitled \"Buy American-Free Trade Agreements-Israeli Trade Act.\"Free Trade Agreement Country End Products (Other than Bahrainian, Moroccan, Omani,", "chunk_id": 64, "page_no": 48}, {"chunk": "Panamanian, or Peruvian End Products) or Israeli End Products:---Line Item No.---Country of Origin---RFP: 70Z04424RESIAB01---48Line Item No.---Country of Origin---[List as necessary]---(iii) The Offeror shall list those supplies that are foreign end products (other than those listed inparagraph (g)(1)(ii) of this provision) as defined in the clause of this solicitation entitled \"Buy American- Free Trade Agreements-Israeli Trade Act.\" The Offeror shall list as other foreign end products those end products manufactured in the United States that do not qualify as domestic end products. For those foreign end products that do not consist wholly or predominantly of iron or steel or a combination of both, the Offeror shall also indicate whether these foreign end products exceed 55 percent domestic content, except for those that are COTS items. If the percentage of the domestic content is unknown, select “no”.Other Foreign End Products:---Exceeds 55% domestic content (yes/no)---Line Item No.---Country of Origin---[List as necessary]---(iv) The Offeror shall list the line item numbers of domestic end products that contain acritical component (see FAR 25.105).Line Item No. ___---[List as necessary]---(v) The Government will evaluate offers in accordance with the policies and procedures ofFAR part 25.---(2) Buy American-Free Trade Agreements-Israeli Trade Act Certificate, Alternate II. If Alternate II to the clause at FAR 52.225-3 is included in this solicitation, substitute the following paragraph (g)(1)(ii) for paragraph (g)(1)(ii) of the basic provision:(g)(1)(ii) The offeror certifies that the following supplies are Israeli end products as defined in theclause of this solicitation entitled “Buy American—Free Trade Agreements—Israeli Trade Act”:", "chunk_id": 65, "page_no": 49}, {"chunk": "Israeli End Products:---RFP: 70Z04424RESIAB01---49Line Item No.---[List as necessary]---(3) Buy American-Free Trade Agreements-Israeli Trade Act Certificate, Alternate III. If Alternate IIIto the clause at 52.225-3 is included in this solicitation, substitute the following paragraph (g)(1)(ii) for paragraph (g)(1)(ii) of the basic provision:(g)(1)(ii) The offeror certifies that the following supplies are Free Trade Agreement country endproducts (other than Bahrainian, Korean, Moroccan, Omani, Panamanian, or Peruvian end products) or Israeli end products as defined in the clause of this solicitation entitled \"Buy American-Free Trade Agreements-Israeli Trade Act\":Free Trade Agreement Country End Products (Other than Bahrainian, Korean, Moroccan, Omani,Panamanian, or Peruvian End Products) or Israeli End Products:---Line Item No.---Country of Origin---[List as necessary]---(4) Trade Agreements Certificate. (Applies only if the clause at FAR 52.225-5, Trade Agreements, isincluded in this solicitation.)(i) The offeror certifies that each end product, except those listed in paragraph (g)(5)(ii) of thisprovision, is a U.S.-made or designated country end product, as defined in the clause of this solicitation entitled \"Trade Agreements.\"(ii) The offeror shall list as other end products those end products that are not U.S.-made ordesignated country end products.Other End Products:---RFP: 70Z04424RESIAB01---50Line Item No.---Country of Origin---[List as necessary]---(iii) The Government will evaluate offers in accordance with the policies and procedures ofFAR part 25. For line items covered by the WTO GPA, the Government will evaluate offers of U.S.-made or designated country end products without regard to the restrictions of the Buy American statute. The Government will consider for award only offers of U.S.-made or designated country end products unless the Contracting Officer determines that there are no offers for such products or that the offers for such products are insufficient to fulfill the requirements of the solicitation.(h) Certification Regarding Responsibility Matters (Executive Order 12689). (Applies only if thecontract value is expected to exceed the simplified acquisition threshold.) The offeror certifies, to the best of its knowledge and belief, that the offeror and/or any of its principals–(1) □ Are, □ are not presently debarred, suspended, proposed for debarment, ordeclared ineligible for the award of contracts by any Federal agency;(2) □ Have, □ have not, within a three-year period preceding this offer, been convicted of or had acivil judgment rendered against them for: commission of fraud or a criminal offense in connection with obtaining, attempting to obtain, or performing a Federal, state or local government contract or subcontract; violation of Federal or state antitrust statutes relating to the submission of offers; or commission of embezzlement, theft, forgery, bribery, falsification or destruction of records, making false statements, tax evasion, violating Federal criminal tax laws, or receiving stolen property;(3) □ Are, □ are not presently indicted for, or otherwise criminally or civilly charged by a Government entity with, commission of any of these offenses enumerated in paragraph (h)(2) of this clause; and(4) □ Have, □ have not, within a three-year period preceding this offer, been notified of anydelinquent Federal taxes in an amount that exceeds the threshold at 9.104-5(a)(2) for which the liability remains unsatisfied.(i) Taxes are considered delinquent if both of the following criteria apply:(A) The tax liability is finally determined. The liability is finally determined if it has beenassessed. A liability is not finally determined if there is a pending administrative or judicial challenge. In the case of a judicial challenge to the liability, the liability is not finally determined until all judicial appeal rights have been exhausted.(B) The taxpayer is delinquent in making payment. A taxpayer is delinquent if the taxpayerhas failed to pay the tax liability when full payment was due and required. A taxpayer is not delinquent in cases where enforced collection action is precluded.", "chunk_id": 66, "page_no": 51}, {"chunk": "(ii) Examples.---RFP: 70Z04424RESIAB01---51(A) The taxpayer has received a statutory notice of deficiency, under I.R.C. §6212, whichentitles the taxpayer to seek Tax Court review of a proposed tax deficiency. This is not a delinquent tax because it is not a final tax liability. Should the taxpayer seek Tax Court review, this will not be a final tax liability until the taxpayer has exercised all judicial appeal rights.(B) The IRS has filed a notice of Federal tax lien with respect to an assessed tax liability, andthe taxpayer has been issued a notice under I.R.C. §6320 entitling the taxpayer to request a hearing with the IRS Office of Appeals contesting the lien filing, and to further appeal to the Tax Court if the IRS determines to sustain the lien filing. In the course of the hearing, the taxpayer is entitled to contest the underlying tax liability because the taxpayer has had no prior opportunity to contest the liability. This is not a delinquent tax because it is not a final tax liability. Should the taxpayer seek tax court review, this will not be a final tax liability until the taxpayer has exercised all judicial appeal rights.(C) The taxpayer has entered into an installment agreement pursuant to I.R.C. §6159. Thetaxpayer is making timely payments and is in full compliance with the agreement terms. The taxpayer is not delinquent because the taxpayer is not currently required to make full payment.(D) The taxpayer has filed for bankruptcy protection. The taxpayer is not delinquent becauseenforced collection action is stayed under 11 U.S.C. §362 (the Bankruptcy Code).(i) Certification Regarding Knowledge of Child Labor for Listed End Products (Executive Order 13126).[The Contracting Officer must list in paragraph (i)(1) any end products being acquired under this solicitation that are included in the List of Products Requiring Contractor Certification as to Forced or Indentured Child Labor, unless excluded at 22.1503(b).](1) Listed end products.", "chunk_id": 67, "page_no": 52}, {"chunk": "Listed End Product---Listed Country of Origin---(2) Certification. [If the Contracting Officer has identified end products and countries of origin inparagraph (i)(1) of this provision, then the offeror must certify to either (i)(2)(i) or (i)(2)(ii) by checking the appropriate block.](i) The offeror will not supply any end product listed in paragraph (i)(1) of this provision thatwas mined, produced, or manufactured in the corresponding country as listed for that product.(ii) The offeror may supply an end product listed in paragraph (i)(1) of this provision that wasmined, produced, or manufactured in the corresponding country as listed for that product. The offeror certifies that it has made a good faith effort to determine whether forced or indentured child labor was used to mine, produce, or manufacture any such end product furnished under this contract. On the basis of those efforts, the offeror certifies that it is not aware of any such use of child labor.(j) Place of manufacture. (Does not apply unless the solicitation is predominantly forthe acquisition of manufactured end products.) For statistical purposes only, the offeror shall indicate whether the place of manufacture of the end products it expects to provide in response to this solicitation is predominantly-RFP: 70Z04424RESIAB01---52(1) □ In the United States (Check this box if the total anticipated price of offered end products manufactured in the United States exceeds the total anticipated price of offered end products manufactured outside the United States); or", "chunk_id": 68, "page_no": 53}, {"chunk": "(2) □ Outside the United States.---(k) Certificates regarding exemptions from the application of the Service Contract LaborStandards (Certification by the offeror as to its compliance with respect to the contract also constitutes its certification as to compliance by its subcontractor if it subcontracts out the exempt services.) [The contracting officer is to check a box to indicate if paragraph (k)(1) or (k)(2) applies.](1) Maintenance, calibration, or repair of certain equipment as described in FAR 22.1003-4(c)(1).The offeror □ does □ does not certify that–(i) The items of equipment to be serviced under this contract are used regularly for other thanGovernmental purposes and are sold or traded by the offeror (or subcontractor in the case of an exempt subcontract) in substantial quantities to the general public in the course of normal business operations;(ii) The services will be furnished at prices which are, or are based on, established catalog or market prices (see FAR 22.1003-4(c)(2)(ii)) for the maintenance, calibration, or repair of such equipment; and(iii) The compensation (wage and fringe benefits) plan for all service employees performingwork under the contract will be the same as that used for these employees and equivalent employees servicing the same equipment of commercial customers.(2) Certain services as described in FAR 22.1003-4(d)(1). The offeror □ does □ does not certify that-(i) The services under the contract are offered and sold regularly to non-Governmentalcustomers, and are provided by the offeror (or subcontractor in the case of an exempt subcontract) to the general public in substantial quantities in the course of normal business operations;(ii) The contract services will be furnished at prices that are, or are based on, established catalogor market prices (see FAR 22.1003-4(d)(2)(iii));(iii) Each service employee who will perform the services under the contract will spend only asmall portion of his or her time (a monthly average of less than 20 percent of the available hours on an annualized basis, or less than 20 percent of available hours during the contract period if the contract period is less than a month) servicing the Government contract; and(iv) The compensation (wage and fringe benefits) plan for all service employees performing work under the contract is the same as that used for these employees and equivalent employees servicing commercial customers.", "chunk_id": 69, "page_no": 53}, {"chunk": "(3) If paragraph (k)(1) or (k)(2) of this clause applies–---(i) If the offeror does not certify to the conditions in paragraph (k)(1) or (k)(2) andthe Contracting Officer did not attach a Service Contract Labor Standards wage determination to the solicitation, the offeror shall notify the Contracting Officer as soon as possible; and(ii) The Contracting Officer may not make an award to the offeror if the offeror fails to execute the certification in paragraph (k)(1) or (k)(2) of this clause or to contact the Contracting Officer as required in paragraph (k)(3)(i) of this clause.(l) Taxpayer Identification Number (TIN) ( 26 U.S.C. 6109, 31 U.S.C. 7701). (Not applicable ifthe offeror is required to provide this information to the SAM to be eligible for award.)RFP: 70Z04424RESIAB01---53(1) All offerors must submit the information required in paragraphs (l)(3) through (l)(5) of thisprovision to comply with debt collection requirements of 31 U.S.C. 7701(c) and 3325(d), reporting requirements of 26 U.S.C. 6041, 6041A, and 6050M, and implementing regulations issued by the Internal Revenue Service (IRS).(2) The TIN may be used by the Government to collect and report on any delinquent amounts arisingout of the offeror’s relationship with the Government ( 31 U.S.C. 7701(c)(3)). If the resulting contract is subject to the payment reporting requirements described in FAR 4.904, the TIN provided hereunder may be matched with IRS records to verify the accuracy of the offeror’s TIN.", "chunk_id": 70, "page_no": 54}, {"chunk": "(3) Taxpayer Identification Number (TIN).---TIN: ________________________________.TIN has been applied for.TIN is not required because:Offeror is a nonresident alien, foreign corporation, or foreign partnership that does not haveincome effectively connected with the conduct of a trade or business in the United States and does not have an office or place of business or a fiscal paying agent in the United States;Offeror is an agency or instrumentality of a foreign government;Offeror is an agency or instrumentality of the Federal Government.(4) Type of organization.---Sole proprietorship;---Partnership;---Corporate entity (not tax-exempt);---Corporate entity (tax-exempt);---Government entity (Federal, State, or local);---Foreign government;---International organization per 26 CFR1.6049-4;---Other ________________________________.(5) Common parent.---Offeror is not owned or controlled by a common parent;Name and TIN of common parent:---Name ________________________________.TIN _________________________________.(m) Restricted business operations in Sudan. By submission of its offer, the offeror certifies thatthe offeror does not conduct any restricted business operations in Sudan.(n) Prohibition on Contracting with Inverted Domestic Corporations.---RFP: 70Z04424RESIAB01---54(1) Government agencies are not permitted to use appropriated (or otherwise made available) fundsfor contracts with either an inverted domestic corporation, or a subsidiary of an inverted domestic corporation, unless the exception at 9.108-2(b) applies or the requirement is waived in accordance with the procedures at 9.108-4.(2) Representation. The Offeror represents that–---(i) It □ is, □ is not an inverted domestic corporation; and(ii) It □ is, □ is not a subsidiary of an inverted domestic corporation.(o) Prohibition on contracting with entities engaging in certain activities or transactions relating to Iran.(1) The offeror shall e-mail questions concerning sensitive technology to the Department of State", "chunk_id": 71, "page_no": 55}, {"chunk": "at CISADA106@state.gov.---(2) Representation and Certifications. Unless a waiver is granted or an exception applies as providedin paragraph (o)(3) of this provision, by submission of its offer, the offeror-(i) Represents, to the best of its knowledge and belief, that the offeror does not exportany sensitive technology to the government of Iran or any entities or individuals owned or controlled by, or acting on behalf or at the direction of, the government of Iran;(ii) Certifies that the offeror, or any person owned or controlled by the offeror, does not engagein any activities for which sanctions may be imposed under section 5 of the Iran Sanctions Act; and(iii) Certifies that the offeror, and any person owned or controlled by the offeror, does notknowingly engage in any transaction that exceeds the threshold at FAR 25.703-2(a)(2) with Iran’s Revolutionary Guard Corps or any of its officials, agents, or affiliates, the property and interests in property of which are blocked pursuant to the International Emergency Economic Powers Act (et seq.) (see OFAC’s Specially Designated Nationals and Blocked Persons List at https://www.treasury.gov/resource- center/sanctions/SDN-List/Pages/default.aspx).(3) The representation and certification requirements of paragraph (o)(2) of this provision do notapply if----(i) This solicitation includes a trade agreements certification (e.g., 52.212-3(g) or a comparable", "chunk_id": 72, "page_no": 55}, {"chunk": "agency provision); and---(ii) The offeror has certified that all the offered products to be supplied are designatedcountry end products.---(p) Ownership or Control of Offeror. (Applies in all solicitations when there is a requirement to beregistered in SAM or a requirement to have a unique entity identifier in the solicitation).(1) The Offeror represents that it □ has or □ does not have an immediate owner. If the Offeror hasmore than one immediate owner (such as a joint venture), then the Offeror shall respond to paragraph (2) and if applicable, paragraph (3) of this provision for each participant in the joint venture.(2) If the Offeror indicates \"has\" in paragraph (p)(1) of this provision, enter the followinginformation:---Immediate owner CAGE code: ____________________.---RFP: 70Z04424RESIAB01---55Immediate owner legal name: _____________________.---(Do not use a \"doing business as\" name)Is the immediate owner owned or controlled by another entity: □ Yes or □ No.(3) If the Offeror indicates \"yes\" in paragraph (p)(2) of this provision, indicating that the immediateowner is owned or controlled by another entity, then enter the following information:Highest-level owner CAGE code: __________________.---Highest-level owner legal name: ___________________.---(Do not use a \"doing business as\" name)(q) Representation by Corporations Regarding Delinquent Tax Liability or a Felony Conviction underany Federal Law.---(1) As required by sections 744 and 745 of Division E of the Consolidated and Further ContinuingAppropriations Act, 2015 (Pub. L. 113-235), and similar provisions, if contained in subsequent appropriations acts, The Government will not enter into a contract with any corporation that–(i) Has any unpaid Federal tax liability that has been assessed, for which all judicial andadministrative remedies have been exhausted or have lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability, where the awarding agency is aware of the unpaid tax liability, unless an agency has considered suspension or debarment of the corporation and made a determination that suspension or debarment is not necessary to protect the interests of the Government; or(ii) Was convicted of a felony criminal violation under any Federal law within the preceding 24months, where the awarding agency is aware of the conviction, unless an agency has considered suspension or debarment of the corporation and made a determination that this action is not necessary to protect the interests of the Government.", "chunk_id": 73, "page_no": 56}, {"chunk": "(2) The Offeror represents that–---(i) It is □ is not □ a corporation that has any unpaid Federal tax liability that has been assessed, for which all judicial and administrative remedies have been exhausted or have lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability; and(ii) It is □ is not □ a corporation that was convicted of a felony criminal violation under a Federallaw within the preceding 24 months.(r) Predecessor of Offeror. (Applies in all solicitations that include the provision at 52.204-16,Commercial and Government Entity Code Reporting.)---(1) The Offeror represents that it □ is or □ is not a successor to a predecessor that held a Federalcontract or grant within the last three years.---(2) If the Offeror has indicated \"is\" in paragraph (r)(1) of this provision, enter the following information for all predecessors that held a Federal contract or grant within the last three years (if more than one predecessor, list in reverse chronological order):Predecessor CAGE code: (or mark \"Unknown\").Predecessor legal name: ____.---RFP: 70Z04424RESIAB01---56(Do not use a \"doing business as\" name).(s) [Reserved].(t) Public Disclosure of Greenhouse Gas Emissions and Reduction Goals. Applies in all solicitations thatrequire offerors to register in SAM ( 12.301(d)(1)).(1) This representation shall be completed if the Offeror received $7.5 million or more in contract awards in the prior Federal fiscal year. The representation is optional if the Offeror received less than $7.5 million in Federal contract awards in the prior Federal fiscal year.(2) Representation. [Offeror to check applicable block(s) in paragraph (t)(2)(i) and (ii)].(i) The Offeror (itself or through its immediate owner or highest-level owner) □ does, □ does not publicly disclose greenhouse gas emissions, i.e., makes available on a publicly accessible website the results of a greenhouse gas inventory, performed in accordance with an accounting standard with publicly available and consistently applied criteria, such as the Greenhouse Gas Protocol Corporate Standard.(ii) The Offeror (itself or through its immediate owner or highest-level owner) □ does, □ doesnot publicly disclose a quantitative greenhouse gas emissions reduction goal, i.e., make available on a publicly accessible website a target to reduce absolute emissions or emissions intensity by a specific quantity or percentage.(iii) A publicly accessible website includes the Offeror's own website or a recognized, third-partygreenhouse gas emissions reporting program.(3) If the Offeror checked \"does\" in paragraphs (t)(2)(i) or (t)(2)(ii) of this provision, respectively,the Offeror shall provide the publicly accessible website(s) where greenhouse gas emissions and/or reduction goals are reported:____________.(u)(1) In accordance with section 743 of Division E, Title VII, of the Consolidated and Further Continuing Appropriations Act, 2015 (Pub. L. 113-235) and its successor provisions in subsequent appropriations acts (and as extended in continuing resolutions), Government agencies are not permitted to use appropriated (or otherwise made available) funds for contracts with an entity that requires employees or subcontractors of such entity seeking to report waste, fraud, or abuse to sign internal confidentiality agreements or statements prohibiting or otherwise restricting such employees or subcontractors from lawfully reporting such waste, fraud, or abuse to a designated investigative or law enforcement representative of a Federal department or agency authorized to receive such information.(2) The prohibition in paragraph (u)(1) of this provision does not contravene requirements applicableto Standard Form 312 (Classified Information Nondisclosure Agreement), Form 4414 (Sensitive Compartmented Information Nondisclosure Agreement), or any other form issued by a Federal department or agency governing the nondisclosure of classified information.(3) Representation. By submission of its offer, the Offeror represents that it will not require itsemployees or subcontractors to sign or comply with internal confidentiality agreements or statements prohibiting or otherwise restricting such employees or subcontractors from lawfully reporting waste, fraud, or abuse related to the performance of a Government contract to a designated investigative or law enforcement representative of a Federal department or agency authorized to receive such information (e.g., agency Office of the Inspector General).(v) Covered Telecommunications Equipment or Services-Representation. Section 889(a)(1)(A) and", "chunk_id": 74, "page_no": 57}, {"chunk": "section 889 (a)(1)(B) of Public Law 115-232.---RFP: 70Z04424RESIAB01---57(1) The Offeror shall review the list of excluded parties in the System for Award Management(SAM) ( https://www.sam.gov) for entities excluded from receiving federal awards for \"covered telecommunications equipment or services\".(2) The Offeror represents that–---(i) It □ does, □ does not provide covered telecommunications equipment or services as a part of its offered products or services to the Government in the performance of any contract, subcontract, or other contractual instrument.(ii) After conducting a reasonable inquiry for purposes of this representation, that it □ does, □ does not use covered telecommunications equipment or services, or any equipment, system, or service that uses covered telecommunications equipment or services.(End of Provision)---RFP: 70Z04424RESIAB01---58", "chunk_id": 75, "page_no": 58}]