[{"child_chunk": "Federal Trade Commission---Request for Proposal Website Satisfaction Surveys---Request for Proposal Website Satisfaction Surveys---Table of Contents---1.0 Introduction ........................................................................................................................ 4 1.1 Background ...................................................................................................................... 41.2 Scope of Work ................................................................................................................. 42.0 Contract Period and Support Availability ............................................................... 4 2.1 Period of Performance ................................................................................................. 42.2 .............................................................................................................................................. 43.0 Type of Contract ............................................................................................................... 4 4.0 Instructions for Submission ......................................................................................... 5 4.1 Questions from Offerors ............................................................................................. 54.2 General Criteria ............................................................................................................ 54.2.1 Phase 1 Oral Evaluation (Factor One) ............................................................. 54.2.2 Demonstration of System: Submission Due Date .................................... 64.2.3 Phase 1: Oral Evaluation Rubric ....................................................................... 64.3 – Phase 2: Technical Proposal Evaluation .......................................................... 74.3.1 Proposal Submission ........................................................................................... 74.3.2 Submission Format .............................................................................................. 74.4 Submission Content ................................................................................................... 84.4.1 Volume One: Technical Approach (Factor 2) ............................................. 84.4.2 Executive Summary (Count towards the 15-page Volume I page limit) ..................................................................................................................................... 84.4.3 Technical Approach (15-page limit) ............................................................ 84.5 Technical Evaluation Criteria .................................................................................. 94.6 Assessment Level ........................................................................................................ 9", "chunk_id": 1}, {"child_chunk": "4.7 Volume Two: Past Performance (10-page limit) (Factor 3) ....................... 10---4.8 Volume Three: Price Proposal (Factor 4) .......................................................... 115.0 Basis for Award ............................................................................................................... 12 5.1 Best Value ...................................................................................................................... 125.2. Price ................................................................................................................................ 13Page 2 of 16---Request for Proposal Website Satisfaction Surveys---5.3 Overall Submission Ratings ................................................................................... 135.4 Order of Importance of Evaluation Factors ...................................................... 146.0 Clauses .............................................................................................................................. 15 6.1 Federal Acquisition Regulation Clauses ............................................................ 156.2 Federal Trade Commission Clauses ................................................................... 167.0 Attachments .................................................................................................................... 16", "chunk_id": 2}, {"child_chunk": "Page 3 of 16---Request for Proposal Website Satisfaction Surveys---1.0 Introduction---1.1 Background---The Federal Trade Commission is the nation's consumer protection agency. We stop unfair, deceptive, and fraudulent business practices by collecting consumer reports and conducting investigations, suing companies and people that break the law, developing rules to maintain a fair marketplace, and educating consumers and businesses about their rights andresponsibilities. As described in the FTC Strategic Plan, one of the agency's objectives is to inform consumers about their rights and give businesses guidance about their duties and how to comply with the law. A key performance measure for that objective is the rate of consumer satisfaction with FTC consumer education and transactional websites. We compare our customer satisfaction against other federal government websites and report those customer satisfaction scores as required by the Government Performance and Results Act (GPRA).", "chunk_id": 3}, {"child_chunk": "1.2 Scope of Work---The Contractor shall provide all necessary management, personnel, support, supplies, materials, and equipment to conduct website satisfaction surveys in accordance with the requirements outlined in the Performance Work Statement (PWS) attached as Attachment 1.2.0 Contract Period and Support Availability---", "chunk_id": 4}, {"child_chunk": "2.1 Period of Performance---The contract will have a base year with four option years. The performance periods are as follows:Base Year Option Year 1 Option Year 2 Option Year 3---September 19, 2023, September 18, 2024 September 19, 2024, September 18, 2025 September 19, 2025, September 18, 2026 September 19, 2026, September 18, 2027", "chunk_id": 5}, {"child_chunk": "Option Year 4---September 19, 2027, September 18, 2028---2.2 SUPPORT AVAILABILITY---The Contractor must provide customer support services on a 24/7/365 basis to address any technical or functional issues that arise with the system. This includes weekends, holidays, andnon-business hours.---3.0 Type of Contract---The FTC anticipates awarding a firm-fixed-price contract.", "chunk_id": 6}, {"child_chunk": "Page 4 of 16---Request for Proposal Website Satisfaction Surveys---4.0 Instructions for Submission---4.1 Questions from Offerors Any questions regarding this RFP shall be submitted via email to Kenneth Gipson at kgipson@ftc.gov with the subject line \"Website Satisfaction Surveys- Questions\" no later than Thursday, July 26th, 2023, at 12:00 PM (ET). The Government will provide responses to all potential offerors in a manner that only identifies the source if a response applies to", "chunk_id": 7}, {"child_chunk": "some.---The Government reserves the right not to provide an answer for any requests or questions received after the date stated above. If, however, the Government determines that a late request raises an issue of significant importance, the Government will respond.All government responses will be provided electronically and, depending upon the nature, via an amendment to the solicitation.", "chunk_id": 8}, {"child_chunk": "4.2 General Criteria---The evaluation will be based on the following criteria:1. Demonstration of System during Phase 1 - Oral Evaluation 2. Technical & Price Evaluation during Phase 2 - Technical Evaluation4.2.1 Phase 1 Oral Evaluation (Factor One) In Phase 1, offerors are required to propose a virtual or in-person demonstration of their proposed system. The Federal Trade Commission (FTC) will evaluate the extent to which the demonstration illustrates how the system meets the requirements described in Section 2 with a particular emphasis on requirements 2.2.1, 2.2.2, 2.3.1, and 2.3.2, with specific emphasis on the requirements listed in the Performance Work Statement (PWS).The FTC will use the following rating system for the demonstration:", "chunk_id": 9}, {"child_chunk": "Rating for Demonstration of System:---Pass: The demonstration adequatelyillustrates how the system meets therequirements.---Fail: The demonstration does not adequately illustrate how the system meets the requirements.The FTC will assess each Offeror's demonstration based on the above criteria and assign a rating accordingly.", "chunk_id": 10}, {"child_chunk": "Page 5 of 16---Request for Proposal Website Satisfaction Surveys---Passing Phase 1 and receiving a Pass rating for the demonstration of the system is a prerequisite for offerors to proceed to Phase 2 - Technical Proposal Evaluation. The FTC will notify successful offerors of Phase 1 to submit Phase 2 – Technical Proposal Evaluation.4.2.2 Demonstration of System: Submission Due Date Offerors interested in participating in the solicitation process must submit their interest to perform a system demonstration during the week of August 14 th through August 18th. Please email your demonstration interest to prubio@ftc.gov no later than Wednesday, August 2nd, 2023, 12:00 PM (ET). The email should include the subject line “Website Satisfaction Surveys – Demonstration Interest.” Note: Only offerors who pass the system demonstration will proceed to submit their technical and price proposals as part of the solicitation process.", "chunk_id": 11}, {"child_chunk": "4.2.3 Phase 1: Oral Evaluation Rubric\t Criteria:---(1) Alignment with Requirements:---Pass: The demonstration effectively illustrates how the proposed system meets the requirements outlined in Section 2 of the RFP, emphasizing the requirements listed in the Performance Work Statement (PWS). Fail: The demonstration does not adequately illustrate how the proposed system meets the requirements outlined in Section 2 of the RFP, with a particular emphasis on the requirements listed in the PWS.", "chunk_id": 12}, {"child_chunk": "(2) Functionality and Features:---Pass: The demonstration showcases the functionality and features of the proposed system clearly and comprehensively, highlighting how they align with the project objectives and requirements. Fail: The demonstration does not adequately showcase the functionality and features of the proposed system or fails to demonstrate how they align with the project objectives and requirements.", "chunk_id": 13}, {"child_chunk": "(3) User Experience and Interface:---Pass: The demonstration presents a user-friendly interface and demonstrates an intuitive user experience, showcasing the system’s ease of use and navigability. Fail: The demonstration lacks a user-friendly interface or fails to provide asatisfactory user experience, indicating potential usability issues.", "chunk_id": 14}, {"child_chunk": "(4) Responsiveness and Adaptability:---Pass: The demonstration showcases the system’s responsiveness and adaptability inquiries and concernsto potential changes or modifications, addressing effectively.Page 6 of 16---Request for Proposal Website Satisfaction Surveys---Fail: The demonstration lacks responsiveness or fails to demonstrate the system’s adaptability to potential changes or modifications.Note: The evaluation panel will assign scores based on their assessment of each criterion using the Pass/Fail rating system. A Pass rating indicates that the demonstration adequately illustrated how the system meets the requirements, while a Fail rating indicates that the demonstration did not adequately illustrate how the system meets the requirements. The Offeror MUST receive a pass score for all four criteria.Please ensure that your demonstration addresses each criterion and provides clear and compelling evidence of how your proposed system aligns with the RFP requirements.", "chunk_id": 15}, {"child_chunk": "4.3 – Phase 2: Technical Proposal Evaluation---Following the oral evaluation in Phase 1, offerors who receive a Pass rating for all four criteria of their system will proceed to Phase 2. In Phase 2, the evaluation panel will further assess the technical aspects of the offerors' technical proposal. The evaluation will consider factors such as the technical approach, past performance, and other relevant aspects outlined in the RFP. The evaluation panel will use a predetermined scoring rubric to assign numerical ratings for each criterion.Overall Evaluation and Selection: The final evaluation results will be based on a combination of the ratings from Phase 1 - Oral Evaluation (demonstration) and Phase 2 - Technical Evaluation (written proposal). The Offeror", "chunk_id": 16}, {"child_chunk": "combination of the ratings from Phase 1 - Oral Evaluation (demonstration) and Phase 2 - Technical Evaluation (written proposal). The Offeror with the highest combined score will be selected for the project.4.3.1 Proposal Submission If the Offeror has passed the system demonstration, the Offeror will then submit a Technical, Past Performance, and Price Proposal to the FTC. All submissions shall be submitted via email to Kenneth Gipson at kgipson@ftc.gov no later than Thursday DATE, 2021, 12:00 PM (ET). The email shall include the subject line \"Website Satisfaction Surveys– Proposal Submission.\" If submissions require multiple emails, please indicate the count and a total number of emails in the", "chunk_id": 16}, {"child_chunk": "the subject line \"Website Satisfaction Surveys– Proposal Submission.\" If submissions require multiple emails, please indicate the count and a total number of emails in the subject line (i.e., Website Satisfaction Surveys – Proposal Submission, Email 1 of 3). Proposals submitted in response to this solicitation shall be submitted in electronic form, which is", "chunk_id": 16}, {"child_chunk": "readable using MS Office 2016 or Adobe Acrobat 2017.---4.3.2 Submission Format---All submissions shall include a Cover Page to include the following: • Solicitation; • Name of Offeror with at least two points of contact to include email addresses and phonenumbers;---The business mailing address of the Offeror; • UEI • Cage Code;", "chunk_id": 17}, {"child_chunk": "Page 7 of 16---Request for Proposal Website Satisfaction Surveys---Tax Identification Number (TIN); • Business Size and Socioeconomic Representation; • Proof of FedRamp Certification • A list of all material(s) that are included as part of the Offeror's submission (i.e., Volume 1,", "chunk_id": 18}, {"child_chunk": "Volume 2, resumes, pricing, and certifications).---The Offeror shall submit two separate volumes, (1) Technical; (2) Past Performance; and (3) Cost/Price. Each volume should be attached as a separate file when submitting offers viaemail. The electronic submission must be compatible with Microsoft Office 2016 or an Adobe Acrobat file; pricing tables should be submitted as an Excel document. All electronic files should be searchable. The Offeror's submission shall be formatted as follows: • Text – a minimum of 12-point font and single-spaced • Margins – a minimum of one inch all around • Page number – noted at the bottom of the page and numbered consecutively • Page count –", "chunk_id": 19}, {"child_chunk": "o Volume 1:---§ Not to exceed 15 pages § The cover letter will not be included in the 15 pages.Volume 2: Past experience not to exceed ten pages • Volume 3: Price Proposal not to exceed ten pagesThe transmittal letter, table of contents, title pages, past performance questionnaires, certificates, resumes, and pricing tables are not included in the page count.", "chunk_id": 20}, {"child_chunk": "4.4 Submission Content---4.4.1 Volume One: Technical Approach (Factor 2)---Volume one includes: 1. 2.Executive Summary Technical Approach---4.4.2 Executive Summary (Count towards the 15-page Volume I page limit)---In the Executive Summary, the Offeror should summarize its grasp of the unique requirements and opportunities of this solicitation. The FTC will use the Executive Summary as context for the overall submission.", "chunk_id": 21}, {"child_chunk": "4.4.3 Technical Approach (15-page limit)---The FTC will evaluate the technical approach based on the following considerations:Page 8 of 16---Request for Proposal Website Satisfaction Surveys---1) The effectiveness with which the Offeror's technical submission outlines in detail theOfferor's methodology in achieving the Performance Work Statement (PWS) goals.2) The effectiveness with which the Offeror's technical submission addresses how it will enhance quality and services and spur innovation in achieving the goals of the PWS. 3) The degree to which the technical submission demonstrates an effective and efficient method of fully managing and executing the complete and specific requirements of the award.4) The extent to which the Offeror demonstrates that its technical approach is flexible andadaptable to changes in FTC priorities, changes in technology, and changes in marketplace conditions.", "chunk_id": 22}, {"child_chunk": "4.5 Technical Evaluation Criteria---The FTC will evaluate whether the proposal submittal demonstrates the Offeror’s understanding of the scope of the RFP and its technical capability to perform the requirements listed in Section 2 of the PWS.The FTC will evaluate and assess the strengths and weaknesses of the technical approach and will apply adjectival ratings as described in the table below.", "chunk_id": 23}, {"child_chunk": "Adjectival Ratings: Technical Volume---Exceptional---Has a high probability of success • Contains no weaknesses or deficiencies • Greatly exceeds all minimum requirements • Displays a high understanding of all requirements • • Displays a high ability to complete all requirementsFinds efficiencies and suggests innovations", "chunk_id": 24}, {"child_chunk": "Good---Has an above-average probability of success • Contains no significant weaknesses, and only minor, correctable weaknesses exist • • Displays an above-average understanding of all requirements • • Displays above-average ability to complete all requirementsExceeds all the minimum requirements---Finds efficiencies---Acceptable---Has an average probability of success • • Meets all the minimum requirements • Displays an understanding of all requirements • Displays average ability to complete all required workIt contains no significant weaknesses, and any deficiencies can be readily corrected.", "chunk_id": 25}, {"child_chunk": "4.6 Assessment Level---Page 9 of 16---Request for Proposal Website Satisfaction Surveys---The FTC will evaluate and assess the technical information using the definitions in the table below.Assessments: Technical Approach---Strength---An aspect of the proposal that increases the likelihood of successful performanceWeakness---A flaw in the proposal that increases the risk of unsuccessful performance", "chunk_id": 26}, {"child_chunk": "Deficiency---A failure of the proposal to meet an FTC requirement or a combination ofweaknesses performance to an unacceptable level---in the proposal that---increases the risk of unsuccessfulUncertainty An aspect of the proposal that is unclear to the FTC4.7 Volume Two: Past Performance (10-page limit) (Factor 3)---The Past Performance volume should provide information and references that demonstrate the Offeror's relevant experience and performance on previous contracts of similar size, scope, and complexity to the requirements outlined in the Performance Work Statement (PWS). The evaluation of Past Performance will assess the Offeror's ability to perform the activities specified in the RFP successfully. The Offeror shall submit at least one past performance reference that aligns with", "chunk_id": 27}, {"child_chunk": "Offeror's ability to perform the activities specified in the RFP successfully. The Offeror shall submit at least one past performance reference that aligns with the requirements of this RFP. The references should be from contracts where the Offeror served as the prime Contractor. Each reference should include the contract title, the agency or organization, a brief description of the work performed, the contract value, the period of performance, and a point of contact with their email address and phone number.Evaluation of Past Performance will consider the following factors:1.2.3.4.Relevance: The extent to which the past performance reference aligns with the size, scope, and complexity of the requirements specified in the PWS. Quality of Performance: The", "chunk_id": 27}, {"child_chunk": "to which the past performance reference aligns with the size, scope, and complexity of the requirements specified in the PWS. Quality of Performance: The Offeror's demonstrated ability to perform the contract requirements with a high level of quality, meeting or exceeding expectations. Timeliness: The Offeror's ability to complete the work within the specified schedule or agreed-upon delivery dates. Customer Satisfaction: The level of satisfaction expressed by the customers orclients of the Offeror's past performance. This may include feedback on communication, responsiveness, problem-solving, and overall satisfaction with the5.services provided. Performance Issues: Any history of performance issues, such as significantdeficiencies, delays, disputes, or terminations, will be considered.The FTC will assign adjectival", "chunk_id": 27}, {"child_chunk": "Any history of performance issues, such as significantdeficiencies, delays, disputes, or terminations, will be considered.The FTC will assign adjectival ratings based on the evaluation of Past Performance, as follows: Exceptional: The Offeror's past performance record indicates an extremely strongexpectation of successful performance, with no or minor deficiencies and high customer satisfaction.", "chunk_id": 27}, {"child_chunk": "Page 10 of 16---Request for Proposal Website Satisfaction Surveys---Good: The Offeror's past performance record indicates a strong expectation of successful performance, meeting or exceeding requirements with only minor, correctable deficiencies. Acceptable: The Offeror's past performance record indicates an expectation of successful performance, meeting the requirements without significant deficiencies. Neutral: The Offeror lacks a relevant past performance history, or the necessary information is not available, resulting in no clear expectation of successful or unsuccessful performance.Marginal: The Offeror's past performance record raises concerns about the ability to achieve successful performance, with deficiencies or weaknesses that may require increased government management and oversight.The Government may contact the Offeror's references and seek additional sources to gather information on the Offeror's past performance. The Offeror's failure to provide the minimum required number of references may result in a \"neutral\" rating for Past Performance.Please note that the evaluation of Past Performance will be an integral part of the overall evaluation and selection process, with its weight in the final determination of the best value for the FTC.", "chunk_id": 28}, {"child_chunk": "4.8 Volume Three: Price Proposal (Factor 4)---The Price Proposal volume should include the Offeror's pricing for the 12-month base period and four 12-month option periods. In this open market solicitation, offerors are encouraged to propose competitive labor rates and consider providing substantial labor rates and/or volume discounts to enhance their value proposition.The Government will evaluate the Offeror's price proposal for fairness and reasonableness. The price evaluation may utilize various methodologies, including but not limited to the procedures outlined in FAR 15.404, which governs the evaluation of proposals for negotiated acquisitions.For award purposes, the FTC will assess proposals by adding the total price of all options to the total price of the base period requirement. It's", "chunk_id": 29}, {"child_chunk": "acquisitions.For award purposes, the FTC will assess proposals by adding the total price of all options to the total price of the base period requirement. It's important to note that evaluating options doesnot obligate the FTC to exercise them. However, the FTC reserves the right to reject a proposal as non-responsive if it is deemed materially unbalanced in terms of cost between the baseyear and option years. An unbalanced proposal occurs when the costs for certain work are significantly lower or higher than market value, leading to potential cost-realism concerns.Offerors must submit pricing, including all optional Contract Line Item Numbers (CLINs), usingthe CLIN structure outlined in Attachment 2, Pricing Schedule. Completing all relevant tabs and sections in the provided pricing", "chunk_id": 29}, {"child_chunk": "(CLINs), usingthe CLIN structure outlined in Attachment 2, Pricing Schedule. Completing all relevant tabs and sections in the provided pricing template is essential. To assess the reasonableness of theproposed prices, the Offeror should include labor categories, rates, labor hour mix (e.g.,", "chunk_id": 29}, {"child_chunk": "Page 11 of 16---Request for Proposal Website Satisfaction Surveys---supervisors, other staff), and any overhead costs used to calculate the total price in the Price volume of their submission.The FTC will thoroughly review and evaluate the price proposals to determine the best value for the agency. The evaluation will consider factors such as competitiveness, reasonableness, and alignment with the requirements outlined in the RFP.Please note that the evaluation of the Price Proposal will be a significant factor in the overallassessment and selection process, alongside other evaluation criteria specified in the RFP.", "chunk_id": 30}, {"child_chunk": "5.0 Basis for Award---5.1 Best Value---Award of the order shall be made to the responsible Offeror whose quotation, in conforming to this RFP solicitation, provides the FTC the \"best value\" based on the following evaluation factors, in order of importance:1. Oral Evaluation 2. Technical Approach 3. Past Performance 4. PriceIn determining the overall best value, the FTC places the highest importance on Factor 1 - Oral Evaluation. The oral evaluation will assess the extent to which the Offeror's system demonstration adequately illustrates how the proposed system meets the requirements outlined in the RFP, particularly emphasizing the requirements listed in the Performance Work Statement (PWS).Factor 2 - Technical Approach will be evaluated to assess the effectiveness and comprehensiveness of the Offeror's proposed methodology in achieving the goals of the PWS. The evaluation will consider factors such as the Offeror's understanding of the requirements, the ability to enhance quality and services, and the flexibility to adapt to changes in FTC", "chunk_id": 31}, {"child_chunk": "priorities and technology.---Factor 3 - Past Performance will be evaluated to assess the Offeror's relevant past experience and performance on similar contracts. The evaluation will consider factors such as the qualityof performance, timeliness, customer satisfaction, and the extent to which the Offeror's past experience aligns with the requirements of the PWS.Factor 4 - Price will also be evaluated to ensure fairness and reasonableness. The FTC willreview the pricing proposed by each Offeror, considering factors such as competitiveness, reasonableness, and alignment with the requirements outlined in the solicitation.", "chunk_id": 32}, {"child_chunk": "Page 12 of 16---Request for Proposal Website Satisfaction Surveys---In the evaluation of the overall best value, the FTC may consider a trade-off between the factors, meaning that the quotation with the highest-rated oral evaluation and technical approach may take precedence over lower-priced options. However, the price must still be deemed fair and reasonable.The FTC will review each Offeror's representation and certification information to ensure compliance with applicable regulations and verify that offerors are not listed on the excluded", "chunk_id": 33}, {"child_chunk": "parties list, as required by FAR Clause 52.209-7, Information Regarding Responsibility Matters.---The FTC intends to evaluate quotations and make the award without further pricing reductions or discounts. However, the FTC reserves the right to conduct discussions or request further pricing reductions or discounts if deemed necessary by the Contracting Officer, pursuant to FAR Clause 52.215-1, Instructions to Offerors - Competitive Acquisition.Proposals that are unrealistic in terms of technical approach or unrealistically low or high in price may be deemed reflective of an inherent lack of technical competency or indicative of a failure to comprehend the complexity of the requirements and may be eliminated from further consideration.The evaluation of these factors ensures a comprehensive assessment of each Offeror's oral evaluation, technical approach, past performance, and pricing, leading to the selection of the Offeror that provides the best overall value to the FTC.", "chunk_id": 34}, {"child_chunk": "5.2. Price---The FTC will evaluate the Offeror's pricing to determine if it is fair and reasonable. The price must reflect a clear understanding of the requirements.Evaluation of Options Pricing: The FTC will evaluate price proposals by adding the total price of all options to the total price of the base period requirement. This evaluation will include the potential use of the FAR clause 52.217-8 Option to Extend Services. Evaluation of options will not obligate the FTC to exercise the options. The FTC may reject a proposal as non-responsive if itis materially unbalanced as to cost for the base year requirement in relation to the option years. If quoted prices appear unrealistic, the FTC may infer a lack of understanding of therequirements, increased risk of performance, or a lack of credibility on the part of the Offeror.5.3 Overall Submission Ratings Submissions will be assigned an overall rating based on their cumulative factor ratings. Ratingsfor evaluation of the overall submission are as follows:", "chunk_id": 35}, {"child_chunk": "Page 13 of 16---Request for Proposal Website Satisfaction Surveys---Rating---Definition---Exceptional---The submission demonstrates the Offeror's complete understanding of all of the requirements and proposals for innovative approaches or solutions that will significantly exceed FTC's requirements using standard industry practices, technologies, methodologies, and processes. Submissions evaluated with exceptional ratings possess several significant strengths, no deficiencies or significant weaknesses, and the performance is considered to have virtually no risk of disruption of cost, schedule, or performance. There may be correctable weaknesses. The Offeror's technical submission, when implemented, is expected to result in the superior achievement of the Government's objectives with minimal risk.", "chunk_id": 36}, {"child_chunk": "Good---The Offeror's quoted approach exceeds the minimum requirements in the solicitation in a way that benefits the Government. There are strengths and no deficiencies or significant weaknesses. There may be correctable weaknesses, and performance is considered a low risk of disruption of cost, schedule, or performance.", "chunk_id": 37}, {"child_chunk": "Acceptable---The Offeror's quoted approach meets the minimum requirements in the solicitation. There are a few strengths and no deficiencies, there may be correctable weaknesses or significant weaknesses, and performance is considered the average risk of disruption of cost, schedule, or performance.", "chunk_id": 38}, {"child_chunk": "Unsatisfactory---The Offeror's quoted approach does not meet the requirements in the solicitation. There are few or no strengths, and there may be deficiencies and/or uncorrectable significant weaknesses. Performance is considered to have a high risk of cost, schedule, or performance disruption. An unsatisfactory submission is one in which an unacceptable risk of performance failure exists.5.4 Order of Importance of Evaluation Factors Evaluation factors in order of descending importance are:", "chunk_id": 39}, {"child_chunk": "Ranking---Phase 1: Oral Evaluation---1Demonstration of System---Phase 2: Technical and Price Evaluation---2Technical Proposal---3Past Experience---4Price Proposal---Factor One Oral Evaluation is more important than Evaluation Factor Two (Technical---Approach). Evaluation Factor Two (Technical Approach) is more important than Evaluation Factor Three (Past Experience). Evaluation Factor Three (Past Experience) is more important", "chunk_id": 40}, {"child_chunk": "Page 14 of 16---Request for Proposal Website Satisfaction Surveys---than Evaluation Factor Four (Price). The combination of Evaluation Factor Two (Technical Approach) and Evaluation Factor Three (Past Experience) is more important than Evaluation Factor Four (Price).6.0 Clauses---6.1 Federal Acquisition Regulation Clauses---52.252-2 Clauses Incorporated by Reference---This contract incorporates one or more clauses by reference, with the same force and effect as if they were given in the full text. Upon request, the Contracting Officer will make their full text available. Also, the full text of a clause may be accessed electronically at this website:", "chunk_id": 41}, {"child_chunk": "https://www.acquisition.gov/browse/index/far---Article Number---Reference Text---52.202-1Definitions---52.203-5Covenant Against Contingent Fees---52.203-6Restrictions on Subcontractor Sales to the Government---52.203-7Anti-Kickback Procedure---52.203-13Contractor Code of Business Ethics and Conduct---52.203-16Preventing Personal Conflicts of Interest---52.203-17Contractor Employee Whistleblower Rights and Requirement To Inform Employees of Whistleblower Rights---52.204-2Security Requirements---52.204-3Taxpayer Identification---52.204-6Unique Entity Identifier---52.204-13System for Award Management Maintenance---52.204-19", "chunk_id": 42}, {"child_chunk": "Incorporation by Reference or Representation and Certifications---52.212-1Instructions to Offerors-Commercial Items---52.212-3Offeror Representations and Certifications-Commercial Items---52.215-1Contract Award---52.217-5Evaluation of Options---52.222-50 Combating Trafficking in Persons---52.223-18Encouraging Contractor Policies to Ban Text Messaging While Driving---52.224-1Privacy Act Notification---52.225-2Privacy Act---52.225-13Restrictions on Certain Foreign Purchases---52.232-39The unenforceability of Unauthorized Obligations---52.233.3Protest After Award---", "chunk_id": 43}, {"child_chunk": "Page 15 of 16---Request for Proposal Website Satisfaction Surveys---Article Number---Reference Text---52.237-3Continuity of Services---52.239-1Privacy or Security Safeguards---52.243-1Changes - Fixed-Price---52.243-3Changes – Time-and-material or Labor Hours---52.245-1Government Property---52.245-9Use and Charges---6.2 Federal Trade Commission Clauses Please see Attachment 9.4, Federal Trade Commission Clauses, for the full text of FTC-specific clauses applicable to this requirement.", "chunk_id": 44}, {"child_chunk": "Article Number---Reference Text---1152.201-90Contracting Officer’s Representative (COR)---1152.203-90FTC Non-Disclosure---1152.203-91Organizational and Individual Conflicts of Interest---1152.204-90 Contractor Personnel Security Requirements---1152.211-90FTC Observance of Legal Holidays - Facility Closures---1152.224-90Special Protections for Sensitive Information – Experts and Consultants---1152.224-91Safeguarding Sensitive Personally Identifiable Information & Sensitive Health Information---1152.232-91Electronic Invoicing and Payment Requirements---1152.232-92", "chunk_id": 45}, {"child_chunk": "Limitation of Funds---1152.242-91Inspection and Acceptance---7.0 Attachments---Attachment 1 – Performance Work Statement Attachment 2 – Pricing Schedule Attachment 3 – FTC Specific ClausesPage 16 of 16---", "chunk_id": 46}]