[{"child_chunk": "Request for Proposal (RFP) City of Olympia | Capital of Washington State---Information Technology Service Management (ITSM) Solution---Request for Proposal (RFP)---PURPOSE---The purpose of this request for proposal (RFP) is for the City of Olympia (City) to solicit proposals from qualified respondents to obtain a SaaS based IT Service Management (ITSM) solution.The City of Olympia is committed to being an inclusive, affirming, and equitable place for our community members and staff to live, play, and work. We adhere to the non-discriminatory treatment of all persons in employment and the delivery of services and resources. We strongly encourage proposals from minorities, women, and disadvantaged business enterprises.The deadline for submission of proposals is 11/10/2023 at 5:00 p.m. Pacific Time. Earlier responses are welcome. Only electronic proposals will be accepted.", "chunk_id": 1}, {"child_chunk": "BACKGROUND---The City of Olympia’s Information Services staff provide enterprise technology services to the City of Olympia personnel in 9 functional departments located in various physical sites. The Information Services Department currently operates an on-premises IT Service Management (ITSM) product Cherwell, that consists of 24 Agents. The Information Services staff currently support approximately 900 users and receive requests for assistance via phone, email, and self- service via our current ITSM solution. The City of Olympia’s Information Services Department plans to acquire a new ITSM solution, implementation services, and maintenance services.", "chunk_id": 2}, {"child_chunk": "OBJECTIVES---The objectives of this RFP are to:1. Acquire an ITSM solution that meets the City’s requirements as detailed in SolutionFunctionality Attachment “B”.---2. Obtain planning, configuration, implementation, and production deployment---professional services.---3. Obtain system administration training for Information Services support staff. 4. Establish a maintenance and technical support program for the ITSM suite. 5. Improve IT service support and delivery to the City of Olympia users. 6. Improve workflow and collaboration across Information Services teams. 7. Implement advanced self-service portal, including self-help bot and knowledge", "chunk_id": 3}, {"child_chunk": "management.---8. Improve traceability of service requests, incidents, and problems from initiation to---resolution.---DELIVERABLES---The following deliverables are within scope of this RFP:1. Provide a SAAS environment prepared and provisioned with ITSM software. 2. Provide a System Architecture Diagram. 3. Perform Project Initiation and Project Management tasks, including providing an", "chunk_id": 4}, {"child_chunk": "implementation plan and project schedule.---4. Provide a Training Plan and perform training that incorporates training for end users and system administrators. The training plan must incorporate the “train the trainer” model. System administration training must include module process configuration. 5. Provide a Test Plan and collaboratively assist the testing effort that incorporatesfunctional software testing, stress testing, and user acceptance testing. 6. Provide Professional Services for workflow analysis, and process and moduleconfiguration to enable usage of the tool to meet business process requirements.", "chunk_id": 5}, {"child_chunk": "7. Provide user and technical documentation.---QUESTIONS---For questions about this RFP, please contact the RFP Coordinator via email at jadams@ci.olympia.wa.us. The email subject line should contain the verbiage “Questions regarding the ITSM Solution RFP”. Questions via telephone will not be accepted. All questions to this proposal must be sent to the RFP Coordinator via email by 10/2/2023 at 5:00 p.m. Pacific Time (PDT). Questions received after this date may not be answered.All questions will be answered via an addendum posted on the City of Olympia website.To Make Public Records Request: To obtain records related to this RFP via a public records request, please visit our Public Records webpage. Public records fees apply.", "chunk_id": 6}, {"child_chunk": "SCHEDULE---The following schedule is to inform respondents of the estimated timetable of the proposal preparation, evaluation, and award. Please note the following dates when preparing your proposal. The City reserves the right to modify this schedule at its discretion; deadlines for questions and proposal submissions will never shorten.", "chunk_id": 7}, {"child_chunk": "SCHEDULE DATES---DATE---Issuance of Request for Proposal (RFP)---9/15/2023Deadline for questions from Proposers---10/2/2023Issuance of responses to questions with Question & Answer addendum from City---10/23/2023Proposal responses due---11/10/2023Finalist(s) selected and notified (Tentative)12/8/2023Finalist(s) Interviews/Demo (Tentative)---January 2024---Selection Notification (Tentative)---February 2024---PROPOSAL REQUIREMENTS---The proposal must include the following:1. Name of firm, including legal name and dba. 2. Contact information for key staff, including full names, titles, mailing addresses, email", "chunk_id": 8}, {"child_chunk": "addresses, and phone numbers.---3. Relevant experience, including examples of work on similar projects. 4. Provide Solution Implementation Approach & Support model.a. State approach to meeting objectives, accomplishing tasks, and providingdeliverables within the Scope of Work---b. Provide a Training Plan and perform training that incorporates training for end", "chunk_id": 9}, {"child_chunk": "users and system administrators.---c. Provide support model during project implementation and post implementation. d. Anticipated timeline for project completion5. References:---a. Include three client references.---6. A detailed price proposal that includes a breakdown of all costs that may be incurred by the City. Include initial implementation and ongoing costs, including your licensing models and/or pricing structures for your solution.Please note that any additional charges not included in the proposal may not be accepted on future invoices, unless the charges are the result of changes requested by the City and approved before said charges are incurred.7. Complete Solution Functionality, Attachment “B”. (Must use Microsoft Excel .xls or .xlsx", "chunk_id": 10}, {"child_chunk": "format).---8. The following forms (attached as Exhibit “A” to this RFP). These forms can bedownloaded as a single fillable PDF.a. Demographic Information Form b. Compliance with Nondiscrimination Requirement Form c. Equal Benefits Compliance Form d. Proposal Signature SheetPROPOSAL EVALUATION---The scoring for the proposal requirements is as follows:Solution Functionality: Complete Solution Functionality - Attachment “B” Vendor Qualifications and References Solution Implementation Approach & Support model Quality of the proposal – Overall quality of the proposal Cost: Initial and ongoing", "chunk_id": 11}, {"child_chunk": "Total possible score---30 10 25 10 25 100PROPOSAL SUBMISSION---Proposals shall be submitted to the City by email to Jeremy Adams, RFP Coordinator, at jadams@ci.olympia.wa.us. Only emailed submissions will be accepted.The deadline for submission of proposal is 11/10/2023. The timestamp of the City of Olympia email system will be considered the official time of submittal. Proposals submitted after this deadline will not be accepted. Any errors discovered after RFP submission deadline must remain and cannot be adjusted.", "chunk_id": 12}, {"child_chunk": "CONTRACT---The City anticipates awarding one (1) contract to the successful respondent.The City of Olympia’s Professional Service Agreement will be the contract document for these services. It is expected that firms are familiar with and willing to agree to the terms of the agreement when submitting a proposal. The executed agreement shall reflect the specifications stated in this RFP, the proposal of the chosen respondent, and the agreed upon pricing andscope of work between the City and the selected firm. The City will not sign any company’s service agreement, contract or any other form of agreement. The City does reserve the right to extract certain language from a company’s agreement and incorporate it into the City contract, if agreed upon by both parties. The Agreement may be amended upon the mutual written agreement of the City and the respondent.These contracts are subject to certification of equal benefits provided to all employees. All respondents are advised that Statement of Compliance with Nondiscrimination Requirement Form (attached Exhibit “A” RFP forms), and when applicable, the Equal Benefits Compliance Declaration Form (attached Exhibit “A” RFP forms) will be used on this project.", "chunk_id": 13}, {"child_chunk": "PAYMENT FOR SERVICES---Payment for services will be made in accordance with the fee schedule/milestone payment schedule agreed upon in the contract and a voucher or invoice is submitted in the form specified in the contract, and the same is approved by the appropriate City representative. Payment shall be made on a monthly basis, within thirty (30) days after receipt of such voucher or invoice.", "chunk_id": 14}, {"child_chunk": "INSURANCE---The selected firm must procure and maintain for the duration of this Agreement insurance that meets or exceeds the following limits:Automobile Liability insurance with a minimum combined single limit for bodily injury andproperty damage of $1,000,000 per accident.---Commercial General Liability insurance shall be written with limits no less than $2,000,000 each", "chunk_id": 15}, {"child_chunk": "occurrence and $2,000,000 general aggregate.---Professional Liability insurance shall be written with limits no less than $1,000,000 per claim and$1,000,000 policy aggregate limit.---Workers’ Compensation coverage as required by the Industrial Insurance laws of the State ofWashington.---The City of Olympia, its officers, officials, employees, and volunteers must be included as addition insureds on the policy.A Certificate of Insurance and corresponding Additional Insured Endorsement form(s) must be provided to and approved by the City before work can begin.The cost of such insurance shall be paid by the Vendor.Please refer to Section 11 the Professional Services Agreement to review the full insurance requirements.", "chunk_id": 16}, {"child_chunk": "TITLE VI---The City of Olympia, in accordance with the provisions of Title VI of the Civil Rights Act of 1964 (78 Stat. 252, 42 U.S.C. §§ 2000d to 2000d-4) and the Regulations, hereby notifies all respondents that it will affirmatively ensure that any contract entered into pursuant to this advertisement, disadvantaged business enterprises will be afforded full and fair opportunity to submit bids in response to this invitation and will not be discriminated against on the grounds of race, color, or national origin in consideration for an award.", "chunk_id": 17}, {"child_chunk": "TERMS AND CONDITIONS---1. All submittals will be reviewed by the City to determine compliance with therequirements and instructions specified in this RFP. The Respondent is specifically notified that failure to comply with any part of this RFP may result in rejection of the submittal as non-responsive. The City reserves the right, in its sole discretion, to waive irregularities deemed immaterial.2. Response to this RFP does not commit the City to pay any costs incurred in thepreparation of the response, demonstrations, or any other activities related to this response. All responses and accompanying documentation become the property of the City and will not be returned.3. It is the sole responsibility of the respondent to assure that they have received the most", "chunk_id": 18}, {"child_chunk": "current RFP and addenda.---4. It shall be the responsibility of each respondent to call to the attention of the City any apparent discrepancy in the RFP or any question of interpretation. Failure to do so constitutes acceptance as written.5. The proposal, as presented, must remain valid for a period of ninety (90) days from", "chunk_id": 19}, {"child_chunk": "proposal due date.---6. The City of Olympia reserves the right to reject all proposals or to request and obtainfrom one or more of the respondents, supplementary information as may be necessary for the City to analyze the proposals pursuant to the selection criteria contained herein. 7. The City reserves the right to waive minor irregularities in any proposal and to negotiate", "chunk_id": 20}, {"child_chunk": "with any proposer.---8. The City reserves the right to revise or amend the RFP prior to the proposal due date bywritten addenda.9. The respondent, by submitting a response to this RFP, waives all right to protest or seekany legal remedies whatsoever regarding any aspect of this RFP.10. The City reserves the right to negotiate with the selected respondent(s) the exact terms", "chunk_id": 21}, {"child_chunk": "and conditions of the contract or agreement.---11. The contract resulting from acceptance of a submittal by the City shall be in a formsupplied by the City and shall reflect the specifications in this RFP.12. The insurance certificate required, as detailed within the Professional ServicesAgreement template, shall be submitted upon notification of award.13. All documents submitted to the City as part of the response to this RFP, including but not limited to proposals and other documents submitted as part of the response, are public record and subject to public disclosure.14. The successful applicant must comply with all Federal, State, and City of Olympiastatutes and codes as may be applicable to the scope of work detailed herein, including all labor", "chunk_id": 22}, {"child_chunk": "all Federal, State, and City of Olympiastatutes and codes as may be applicable to the scope of work detailed herein, including all labor laws.15. The City shall not be responsible for any costs incurred by any respondent in preparing,submitting, or presenting its response to the RFP.16. Washington State Law and Venue: Any resulting contracts, (if any) shall be construedunder the laws of the State of Washington. All claims, actions, proceedings, and lawsuits brought in connection with, arising out of, related to, or seeking enforcement of resulting contracts shall be brought in Thurston County, Washington.17. All selected respondents shall obtain a license to do business in the City of Olympia priorto executing their contract", "chunk_id": 22}, {"child_chunk": "in Thurston County, Washington.17. All selected respondents shall obtain a license to do business in the City of Olympia priorto executing their contract with the City.18. All responses and accompanying documentation become the property of the City andwill not be returned.19. This RFP does not obligate the City to contract for services or products specified herein. 20. The respondent will be required as part of the agreement to certify that no one beingdirectly compensated for their services pursuant to the Agreement has retired from the Washington State Retirement System using the 2008 Early Retirement Factors with restrictions on returning to work.", "chunk_id": 22}, {"child_chunk": "Exhibit “A” RFP FORMS---(Download these forms here)---DEMOGRAPHIC INFORMATION FORM---Where is your business located? Within Olympia’s City Limits  Within Thurston County  Outside of Thurston County  Outside of Washington StateIs your business a disability-owned enterprise? (A business having at least 51% disability- ownership)", "chunk_id": 23}, {"child_chunk": " Yes  No---Is your business a veteran-owned enterprise? (A business having at least 51% veteran ownership) Yes  No---Is your business a LGBTQ+ owned enterprise? (A business having at least 51% LGBTQ+ ownership) Yes  No---Is your business a minority-owned enterprise? (A business having at least 51% minority ownership)", "chunk_id": 24}, {"child_chunk": " Yes  No---Is your business a small business enterprise, defined as follows? Having fifty or fewer employees; or  A gross revenue of less than seven million dollars annually as reported on its federal income tax returnIs your business women-owned? (A business having at least 51% women ownership)", "chunk_id": 25}, {"child_chunk": " Yes  No--- Yes  No---I hereby declare the information provided on this form is true and correct, and that I am legally authorized to bind the Consultant.(Signature)---(Date)---Print Name of Person Signing---COMPLIANCE WITH NONDISCRIMINATION REQUIREMENT FORM---Title Here Century Gothic---The Olympia City Council has made compliance with the City’s Nondiscrimination in Delivery of City Services or Resources ordinance (OMC 1.24) a high priority, whether services are provided by City employees or through contract with other entities. It is important that all contract agencies or vendors and their employees understand and carry out the City’s nondiscrimination policy. Accordingly, each City", "chunk_id": 26}, {"child_chunk": "other entities. It is important that all contract agencies or vendors and their employees understand and carry out the City’s nondiscrimination policy. Accordingly, each City agreement or contract for services contains language that requires an agency or vendor to agree that it shall not unlawfully discriminate against an employee or client based on any legally protected status, which includes but is not limited to: race, creed, religion, color, national origin, age, sex, marital status, veteran status, sexual orientation, gender identity, genetic information, or the presence of any disability. Unlawful discrimination includes transphobic discrimination or harassment, including transgender exclusion policies or practices in health benefits.Listed below are methods to ensure that this policy is communicated to your employees, if", "chunk_id": 26}, {"child_chunk": "discrimination or harassment, including transgender exclusion policies or practices in health benefits.Listed below are methods to ensure that this policy is communicated to your employees, if applicable.Nondiscrimination provisions are posted on printed material with broad distribution (newsletters,", "chunk_id": 26}, {"child_chunk": "brochures, etc.).---Nondiscrimination provisions are posted on applications for service. • Nondiscrimination provisions are posted on the agency’s web site. • Nondiscrimination provisions are included in human resource materials provided to job applicantsand new employees.---Nondiscrimination provisions are shared during meetings.Failure to implement at least two of the measures specified above or to comply with the City of Olympia’s nondiscrimination ordinance constitutes a breach of contract.By signing this statement, I acknowledge compliance with the City of Olympia’s nondiscrimination ordinance by the use of at least two of the measures specified above.", "chunk_id": 27}, {"child_chunk": "(Signature)---(Date)---Print Name of Person Signing---Alternative Section for Sole Proprietor: I am a sole proprietor and have reviewed the statement above. I agree not to discriminate against any client, or any future employees, based on any legally protected status.(Sole Proprietor Signature)---(Date)---RFP Title---", "chunk_id": 28}, {"child_chunk": "Page 9 of 11---EQUAL BENEFITS COMPLIANCE DECLARATION FORM---Title Here Century Gothic---Consultants on City contracts estimated to cost $50,000 or more shall comply with the City of Olympia Municipal Code, Chapter 3.18. This provision requires that if consultants provide benefits, they do so without discrimination based on age, sex, race, creed, color, sexual orientation, national origin, or the presence of any physical, mental or sensory disability, or because of any other status protected from discrimination by law. Consultants must have policies in place prohibiting such discrimination, prior to contracting with the City.I hereby declare that the Consultant listed below complies with the City of Olympia Equal Benefits Ordinance, that the information provided on this form is true and correct, and that I am legally authorized to bind the Consultant.", "chunk_id": 29}, {"child_chunk": "Consultant Name---Signature---Name (please print)Date---Title---RFP Title---Page 10 of 11---PROPOSAL SIGNATURE SHEET---Title Here Century Gothic Solicitation Name ____________________________________________________________________Legal Name __________________________________________________________________________ Business Name_________________________________________________________________________Address______________________________________________________________________________Unified Business Identifier (UBI) No. _______________________________________________ M/W/DBE Certification No. (If Applicable)_______________________________________For questions regarding this proposal, the City RFP manager should contact the following individual:Name __________________________________________________________________Telephone No. _______________________________Email Address ___________________________________________________", "chunk_id": 30}, {"child_chunk": "SIGNATURE OF AUTHORIZED OFFICIAL---The Consultant is hereby advised that by signature of this proposal, they are deemed to have acknowledged all requirements and signed all certificates contained herein.___________________________________________________________ Signature _____________________________________ ____________________________________Name of Person Signing---_________________________________________________________Title Date---____________________________________ Email AddressRFP Title---Page 11 of 11---", "chunk_id": 31}]