[{"child_chunk": "PERFORMANCE WORK STATEMENT ENTERPRISE PROGRAM, PROJECT, INTEGRATION SERVICES (EPPIS)1.0 INTRODUCTION AND BACKGROUND---The IRS Information Technology (IT) Enterprise Program Management Office (EPMO) offers services to manage and provide information technology operations support, provide oversight of program implementations, and ensure compliance. The EPMO is integral to IRS strategic portfolio planning and enterprise portfolio management as it assists in the monitoring and managing of information technology spending and delivery. Serving as the IRS’ systems integrator, the EPMO relies on a common structure and framework for managing programs that includes identifying key roles and responsibilities, identifying metrics, and establishing and fostering a culture of collaboration and integration with business and delivery partners.To assist EPMO", "chunk_id": 1}, {"child_chunk": "includes identifying key roles and responsibilities, identifying metrics, and establishing and fostering a culture of collaboration and integration with business and delivery partners.To assist EPMO in its mission, the IRS requires professional expertise to provide end-to-end program management support to deliver enterprise-level information technologies capabilities. The IRS is seeking contractor support to provide a full range of delivery services necessary to support program technical and management approaches, organizational resources, and management controls in alignment with program cost, performance requirements and scheduling demands for the EPMO, delivery partners and other business stakeholders.2.0 OBJECTIVES---IRS is seeking to obtain contractor support for a wide range of program, project, and integration tasks. Applications, Programs and Legislative Mandates to be supported include, but are not limited", "chunk_id": 1}, {"child_chunk": "support for a wide range of program, project, and integration tasks. Applications, Programs and Legislative Mandates to be supported include, but are not limited to:", "chunk_id": 1}, {"child_chunk": "The Affordable Care Act (ACA)---The Patient Protection and Affordable Care Act (PPACA)---The Health Care and Education Affordability Reconciliation Act (HCERA)---FATCA – Foreign Account Tax Compliance Act---Tax Check Program (TCP)---Taxpayer First Act (TFA)---The contractor shall provide support services regardless of the selected engineering lifecycle path, methodology or approach for development and delivery of program capabilities. IRS1development paths may include: Agile, Waterfall, Iterative, Commercial-Off the-Shelf (COTS), Mobile Apps, Managed Services, or other IRS approved Software development Lifecyle paths.Capability development and delivery may be accomplished using traditional, largely sequential, or waterfall-based approaches, as well as", "chunk_id": 2}, {"child_chunk": "IRS approved Software development Lifecyle paths.Capability development and delivery may be accomplished using traditional, largely sequential, or waterfall-based approaches, as well as more iterative and incremental approaches that include leveraging Agile and Development Operations (DevOps) principles, methodologies, practices, and tools. The contractor shall assist the IRS in defining, managing, and executing strategies that result in the delivery of high-value, high-quality IT services and capabilities to meet both current and emerging IRS business needs.3.0 CONTRACT STRUCTURE---The IRS will procure these services through the establishment of multiple award Blanket Purchase Agreements (BPAs) against active and applicable General Services Administration (GSA) Federal Supply Schedule (FSS) contracts under which Performance-Based, Hybrid; Firm Fixed", "chunk_id": 2}, {"child_chunk": "against active and applicable General Services Administration (GSA) Federal Supply Schedule (FSS) contracts under which Performance-Based, Hybrid; Firm Fixed Price (FFP), Labor Hour Task Orders may be issued.The establishment of multiple award BPAs does not create guarantees or obligations for the Government to issue orders. The IRS reserves the right to issue no awards under the established BPA.", "chunk_id": 2}, {"child_chunk": "3.1 GSA Schedule Contract Requirements---Schedule contractors must have an active GSA Schedule contract before a BPA, or a Task Order can be awarded. A contractor may be awarded a BPA that extends beyond the current term of its GSA Schedule contract if there are option periods in the GSA Schedule contract that, if exercised, will cover the BPA's period of performance. If there is any instance where a Schedule contract has expired, the contractor will no longer be eligible for award of subsequent Task Orders under his BPA.All Task Orders are subject to the terms and conditions of the contractor’s GSA contract and the BPA. If there is a conflict between the terms and conditions of the GSA contract and the additional terms and conditions", "chunk_id": 3}, {"child_chunk": "GSA contract and the BPA. If there is a conflict between the terms and conditions of the GSA contract and the additional terms and conditions of the BPA, the GSA contract shall take precedence. If both the GSA contract and the BPA are silent in the event of a conflict, the Task Order shall take precedence.Contractors shall notify the Contracting Officer (CO) of any changes made by GSA to their applicable Schedule and shall resubmit the updated Schedule within 30 days of receipt of the modification.23.2 Task Orders All services required under this contract shall be ordered by the issuance of Task Orders against the multiple award BPAs. Task Orders will be placed directly with any multiple award BPA holder that can meet", "chunk_id": 3}, {"child_chunk": "ordered by the issuance of Task Orders against the multiple award BPAs. Task Orders will be placed directly with any multiple award BPA holder that can meet the agency needs. Individual orders may require support in one or more task areas. Awardees on Enterprise Develioment Operations Services(EDOS) will not be able to compete on the the task orders under EPPIS and vice-versa for the same scope of work. Task orders with only project scheduling scope, only Risk management scope, only configuration and change management scope will all be automatically set aside for small business. Services within the task areas identified below, may be performed under this contract:a) Task Area 1: Transition Management b) Task Area 2: Release Management", "chunk_id": 3}, {"child_chunk": "the task areas identified below, may be performed under this contract:a) Task Area 1: Transition Management b) Task Area 2: Release Management c) Task Area 3: Program/Project Management d) Task Area 4: Enterprise Life Cycle (ELC) e) Task Area 5: Program Integration f) Task Area 6: Technical Integration g) Task Area 7: Business Analysis h) Task Area 8: Requirements Engineering i) j) k) Task Area 11: Organizational Readiness l) m) Task Area 13: Engineering and Architecture n) Task Area 14: Enterprise Testing o) Task Area 15: Cybersecurity p) Task Area 16: Applications Development q) Task Area", "chunk_id": 3}, {"child_chunk": "Task Area 14: Enterprise Testing o) Task Area 15: Cybersecurity p) Task Area 16: Applications Development q) Task Area 17: Enterprise Operations (EOps) r) Task Area 18: Cloud Services s) Task Area 19: Optional Legislation & Initiatives Support t) Task Area 20: Optional Surge SupportTask Area 9: Configuration and Change Management Task Area 10: Change Management and Change Control", "chunk_id": 3}, {"child_chunk": "Task Area 12: Organizational Change Management---4.0 SCOPE OF WORK---The scope of this PWS encompasses Contractor support for EPPIS and IRS IT activities including, but not limited to, program management, project management, integration services, customer consultation/coordination, requirements specification analysis, planning, Enterprise Life Cycle (ELC) processes and documentation, and similar complex services in support of IRS IT missions. The IRS mission requires a Contractor who has expertise in such areas as program and project planning, program/project management and administration, integration services, cyber security services, performance measurements, cost reporting, and recommended solutions based on understanding of IRS’s information architecture, infrastructure, and organization.3As the federal agency that collects taxes and administers", "chunk_id": 4}, {"child_chunk": "reporting, and recommended solutions based on understanding of IRS’s information architecture, infrastructure, and organization.3As the federal agency that collects taxes and administers internal revenue laws, the Internal Revenue Service (IRS) is required to administer the tax provisions included in all legislation. The Contractor will provide services to support current tax code applications and build new processes that do not exist in tax administration today.The activities and responsibilities of the contractor will include those identified under the task areas listed below. Specific activities and deliverables shall be fully defined in individual Task Orders.5.0 DESCRIPTION OF TASKS---5.1 Task Area 1, Transition-in/Transition-out---Transition-in is defined as the one-time “start-up” period at initial award of the task orders", "chunk_id": 4}, {"child_chunk": "Area 1, Transition-in/Transition-out---Transition-in is defined as the one-time “start-up” period at initial award of the task orders (i.e., 90 days) for on-boarding resources and transitioning support and knowledge from any incumbent Contractors and/or IRS personnel to the new awardees for the task orders on the BPA. The new awardees are tasked with acquiring and understanding the necessary documentation, information, and processes related to any work in progress. This effort includes meeting with the IRS Subject Matter Experts and/or outgoing contractors frequently to gather any tacit knowledge related to the systems, projects, etc. in support of the Task Orders. The Government estimates ramp-up to take 120 days which includes on-boarding of", "chunk_id": 4}, {"child_chunk": "the systems, projects, etc. in support of the Task Orders. The Government estimates ramp-up to take 120 days which includes on-boarding of resources. To minimize any decreases in productivity and to prevent possible negative impacts on additional services at the beginning and conclusion of the Task Order’s performance, if appropriate, a transition phase will start no later than (60) days prior to its expiration date. The contractor shall:Have personnel on board during the phase in and out periods. • Remain responsible for the full performance of all efforts and cooperate fully with thestaff and/or the new incumbent contractor.Fully cooperate in providing all documentation and data identified by the government asgovernment owned information; andReturn any Government publication provided to the contractor during associated Task", "chunk_id": 4}, {"child_chunk": "Order performance.---All related work and products become the property of the government, regardless of the ownership of the automation hardware or software used to create the products or services.All reports, charts, logs, and maps shall become the property of the government upon completion or termination of each Task Order and shall be available for inspection by the Government upon request at any time during the Task Order period of performance.Key deliverables to be produced are:Transition Project Plan (tasks and timeline)4Transition Presentation, Kickoff meeting and subsequent meetings with the DigitalServices PMO(s) and new vendor---Final Work Summary Report (to include identification of any gaps) • Document inventory and gap analysis • Transfer knowledge of technical skills and lessons learned to IRS staff uponcompletion of", "chunk_id": 5}, {"child_chunk": "Report (to include identification of any gaps) • Document inventory and gap analysis • Transfer knowledge of technical skills and lessons learned to IRS staff uponcompletion of deliverable s and work products.---Transfer knowledge of operations and maintenance processes and procedures. • Support transition efforts to assist the Government with the transition of work fromthe contractor to the Government or to a successor contractor.---Develop a Transition Plan that includes training material, status report, plannedactivities, issues encountered and identified risks.Transition-out support: Transitioning support and knowledge from this BPA to the new task order, contract or BPA. The awardee will be tasked with development of documentation, and to provide training in support of the Task Orders to transition the support the awardee of", "chunk_id": 5}, {"child_chunk": "awardee will be tasked with development of documentation, and to provide training in support of the Task Orders to transition the support the awardee of task order is providing to another vendor on the another task order, contract or the BPA. The Government estimates ramp-down to take 90 days. To minimize any decreases in productivity and to prevent possible negative impacts on additional services at the beginning and conclusion of the Task Order’s performance, if appropriate, a transition phase will start no later than (60) days prior to its expiration date. The contractor shall:Have personnel available during the phase out periods. • Remain responsible for the full performance of all efforts and cooperate fully with thestaff and/or the new contractor.Fully cooperate in providing all documentation and", "chunk_id": 5}, {"child_chunk": "• Remain responsible for the full performance of all efforts and cooperate fully with thestaff and/or the new contractor.Fully cooperate in providing all documentation and data identified by the government asgovernment owned information; andReturn any Government publication provided to the contractor during associated Task", "chunk_id": 5}, {"child_chunk": "Order performance.---All related work and products become the property of the government, regardless of the ownership of the automation hardware or software used to create the products or services.All reports, charts, logs, and maps shall become the property of the government upon completion or termination of each Task Order and shall be available for inspection by the Government upon request at any time during the Task Order period of performance.Key deliverables to be produced are:Transition Project Plan (tasks and timeline) • Transition Presentation, Kickoff meeting and subsequent meetings with the DigitalServices PMO(s) and new vendor---Final Work Summary Report (to include identification of any gaps) • Document inventory and gap analysis5Transfer knowledge of technical skills and lessons learned to IRS staff/ newcontractor", "chunk_id": 6}, {"child_chunk": "(to include identification of any gaps) • Document inventory and gap analysis5Transfer knowledge of technical skills and lessons learned to IRS staff/ newcontractor upon completion of deliverables and work products.---Transfer knowledge of operations and maintenance processes and procedures. • Support transition efforts to assist the Government with the transition of work fromthe contractor to the Government or to a successor contractor.---Develop a Transition Plan that includes training material, status report, plannedactivities, issues encountered and identified risks.DESIRED OUTCOME – All contract efforts are transferred timely and completely from the incumbent contractor to the awardee contractor and from one task order to another contract or BPA. The Government is continuously informed of transition progress, there is no lapse in services provided,", "chunk_id": 6}, {"child_chunk": "contractor and from one task order to another contract or BPA. The Government is continuously informed of transition progress, there is no lapse in services provided, and there are no delays in scheduled performance.", "chunk_id": 6}, {"child_chunk": "5.2 Task Area 2, Release Management---The contractor shall support and advise technical development activities across IRS Domains for key initiatives. The contractor shall provide Development, Modernization and Enhancement (DME) support as it relates to the following: The contractor shall provide release planning and management support to the IRS EPMO programs. Support shall include:a) Development of release management plans b) Technical analysis and support for production and maintenance builds c) Development of configurable release guidance and other documents tailored for eachrelease---d) Support for release readiness reviews.---Representative activities shall include:Establish and maintain an integrated release plan. • Develop the IT Release Management Plan. • • • Provide milestone status tracking and reviews; issue identification, tracking", "chunk_id": 7}, {"child_chunk": "and maintain an integrated release plan. • Develop the IT Release Management Plan. • • • Provide milestone status tracking and reviews; issue identification, tracking andIdentify, monitor, and manage release dependencies. Identify, manage, and monitor release-level risks in accordance with IRS guidelines.resolution; and participation in program activities.---Facilitate lessons learned reviews - with continuous development, documentation,communication, and application of lessons learned.Develop, update, and maintain configurable release guidance, documents, and planstailored for each release.Plan and execute Release Readiness Reviews.6DESIRED OUTCOME – Develop a Lessons Learned Document and enable continuous improvement to all activities in the task order. Refer lessons learned in Strategy and Planning (S&P) lessons learned", "chunk_id": 7}, {"child_chunk": "Develop a Lessons Learned Document and enable continuous improvement to all activities in the task order. Refer lessons learned in Strategy and Planning (S&P) lessons learned library, refer lessons learned in prior releases and effectively minimize and mitigate program risks and deficiencies. Submit Lessons Learned to the S&P lessons learned library. Develop Program Management Institute (PMI) Risk Register that will ensure all important components related to the overall risk management framework are monitored specifically following the risk management processes specified in the PMBOK (Project Management Body of Knowledge) Guide which include planning risk management, identifying risks, performing qualitative risk analysis, performing quantitative risk analysis, planning risk responses and monitoring and controlling risks. Each Release shall have the planning and management guidance and insight necessary to successfully deploy assigned capabilities.", "chunk_id": 7}, {"child_chunk": "5.3 Task Area 3, Program/Project Management Support---The contractor shall provide services in support of the IRS efforts. The contractor shall provide support and assistance with program and project management oversight. The contractor shall provide and maintain program management expertise and shall use proven and mature program management practices and processes in the execution of IRS EPMO programs. Management shall include Program Control, billing functions, scheduling, and quality management necessary to insure successful management of all TO-related activities. This shall include tracking and reporting on deliverables, work product development, managing requirements, and risk management functions. The contractor shall appoint a Project Manager (PM) to coordinate delivery of the TO. The contractor shall support the IRS by identifying, advising, and promoting the most effective", "chunk_id": 8}, {"child_chunk": "appoint a Project Manager (PM) to coordinate delivery of the TO. The contractor shall support the IRS by identifying, advising, and promoting the most effective use of resources for the completion of the activities under the TO.The contractor shall provide a web-based management tool using IRS standard tools such as Rational Team Concert for DME portfolio tracking purposes. Goal is to provide the input and tracking of Agile Surge burndown, user stories and Task Order (TO) iterations. The contractor shall be responsible for managing the workflow process for Agile IT Services. The contractor shall provide and support the following tasks as related to program management:(a) Strategic Planning (b) Portfolio Management (c) Business Case Analysis (d) Risk Management (e) Communication Management,", "chunk_id": 8}, {"child_chunk": "to program management:(a) Strategic Planning (b) Portfolio Management (c) Business Case Analysis (d) Risk Management (e) Communication Management, (f) Program Management Office (PMO) Stand-Up (g) Contingency Planning (h) Performance Measurement (i) Program Reporting (j) Quality Management7Representative activities shall include:Develop program vision and charter, to include program objectives, business benefits,program scope/boundaries, guiding principles, engagement model, etc.Develop, update, and document all processes in use on the program, and facilitate regularreviews and updates to ensure currency and accuracy.Address and document, or update for existing programs, the critical success factors,associated metrics, technical performance measures and criteria, and the", "chunk_id": 8}, {"child_chunk": "ensure currency and accuracy.Address and document, or update for existing programs, the critical success factors,associated metrics, technical performance measures and criteria, and the methods by which validation will occur in accordance with IRS guidelines.Conduct supporting analyses, including, but not limited to, Analyses of Alternatives (AoAs) and research activities; make recommendations, provide supporting presentations, and track actions.Enhance and provide analysis and input for the system reporting requirements for externaland internal program reporting, including benefits measurement approaches, plans, metrics, and reporting to support PMO reporting requirements, as well as measurement approaches, plans and reporting for program, delivery partner, project, and release status and activities.Revise, review, and update the program benefits based on evolving", "chunk_id": 8}, {"child_chunk": "plans and reporting for program, delivery partner, project, and release status and activities.Revise, review, and update the program benefits based on evolving external and internaldirection and feedback from benefits reporting and measurement.Maintain program reporting structures. •Identify and document program-wide risks, associated mitigations and contingencies, and issues, in conjunction with representatives from each project and service delivery partner. Implement procedures to continuously identify, prevent, and eliminate deficient or defective processes, practices, or services potentially impeding program success including the use of quality reviews and program control reviews to assess and monitor all aspects of program health, efficiency, and effectiveness.Support development and maintenance of strategic roadmaps and operating models. • Create and/or update plans for contingency planning and", "chunk_id": 8}, {"child_chunk": "of program health, efficiency, and effectiveness.Support development and maintenance of strategic roadmaps and operating models. • Create and/or update plans for contingency planning and management. • Create, manage, and maintain the program Integrated Master Schedule (IMS). • Coordinate creation of semi-monthly detailed status reports. • Coordinate extra hours’ requests, as needed. • Meet with COR bi-weekly to discuss ongoing task matters and resources to support contract. • Meet with team members to coordinate and address issues and risks as needed • Review and approve subcontractor invoices. • Review and signed off on all new TOs • Update quarterly housing report. • Coordinate with COR to get SMART ID badges and minimum background investigations", "chunk_id": 8}, {"child_chunk": "(MBIs) renewals for all team members.---Work with COR to get all contractor access issues resolved. • Create Tracker, forecasting and invoice reports • Review and audit TO process documentation. • Ensure CMMI guidelines are met, and all data is recorded and archived based on task orderneeds.---8Ensure uninterrupted performance for all Programs • Prepare and submit Status Reports • Prepare power point slides for and participate in monthly Program Management Review. • Provide timesheet reports via Excel workbook • • • Measures and metrics • Processes and procedures related to the software development efforts • Prepare Ad-hoc reports and briefings • Budget and financial project tracking report • Review, comment, and coordinate responses to draft deliverables. • Represent in Project Planning efforts, as", "chunk_id": 9}, {"child_chunk": "briefings • Budget and financial project tracking report • Review, comment, and coordinate responses to draft deliverables. • Represent in Project Planning efforts, as needed. • Develop and manage IT project specific schedules. • Provide updates to Integrated Master Schedules. • Provide schedule analysis, including critical path analysis. • Assist in the development of financial reporting. • Identify, record, and manage a project issue management log. • Identify, record, and manage project action items assigned for resolution. • Provide updates for project issues and action items in a weekly status reports. • Provide weekly status of project issues and resolutions • Meetings will include, but not limited toIntegrated program schedule and work breakdown structure (WBS) Integrated requirements trackingo Bi-weekly Meetings with", "chunk_id": 9}, {"child_chunk": "resolutions • Meetings will include, but not limited toIntegrated program schedule and work breakdown structure (WBS) Integrated requirements trackingo Bi-weekly Meetings with CORs to discuss invoicing, subtask assignments,", "chunk_id": 9}, {"child_chunk": "projections, etc.---o Status Meetings with project leads---Facilitate and conduct analyses at the necessary depth for current and upcoming projects • Socialize and gain alignment on the vision, strategy, and conceptual target state architecture • Develop portfolio/product roadmaps to allocate capabilities to transition states, releases, andprojects---DESIRED OUTCOMES – The Contractor shall successfully support the project management office with required documentation by due dates. Project management support activities are effective and completed on schedule and in accordance with the business requirements. Development and application of program management practices and controls that allow the EPMO programs to effectively establish and maintain control of program status, execution, costs, and schedule.The contractor shall prepare the required documents, deliverables and work products as", "chunk_id": 10}, {"child_chunk": "to effectively establish and maintain control of program status, execution, costs, and schedule.The contractor shall prepare the required documents, deliverables and work products as requested. Project Management support shall include, but not limited to the following:9Task Order Status Report (TOSRs) (monthly, quarterly, and annually as requested in the task order) for all tasks and Government Furnished Equipment (GFE) inventory reports, Burn Rate report for the FFP and LH subtasks, semi-monthly reports on actual hours and dollars expended as well as active task orders, etc. TO’s WBS and project schedule, responses to monthly RACF (Resource Access Controls Facilities) Violation Reports, monthly invoice reconciliation reports, ad hoc reports upon request,", "chunk_id": 10}, {"child_chunk": "project schedule, responses to monthly RACF (Resource Access Controls Facilities) Violation Reports, monthly invoice reconciliation reports, ad hoc reports upon request, etc.", "chunk_id": 10}, {"child_chunk": "Program Management Review (PMR)---The program management review shall cover the items prescribed in this PWS. The Program Manager/ COR is responsible for developing the agenda, prescribing the format (e.g., teleconference, onsite meeting), and scheduling of the PMR.Frequency of PMR. A PMR will be conducted quarterly. The schedule for conducting an PMR is set by the Program Manager/ COR in coordination with the CO and is dependent on the criticality and complexity of the major investment or major acquisition.5.4 Task Area 4, Enterprise Life Cycle (ELC)---The Contractor shall provide ELC support by creating and/or maintaining ELC and other documents as specified by the IRS Internal IT Performance Work Request", "chunk_id": 11}, {"child_chunk": "Contractor shall provide ELC support by creating and/or maintaining ELC and other documents as specified by the IRS Internal IT Performance Work Request (PWR). Changes to the ELC governance structure, for example implementation of Capability Maturity Model Integration (CMMI) or a change in methodology (e.g., from Waterfall to Agile) may result in the Contractor being required to update content to conform to changes in document templates. These changes will be completed within Five (5) business days after notification is received from the Government. The contractor shall support the IRS in the selection, tailoring, management, and execution of ELC paths, methodologies, and approaches for development and delivery of program capabilities. Selected ELC development paths shall include Waterfall,", "chunk_id": 11}, {"child_chunk": "and execution of ELC paths, methodologies, and approaches for development and delivery of program capabilities. Selected ELC development paths shall include Waterfall, Iterative, COTS, Mobile Apps, Managed Services, or another IRS approved path. Selected development and delivery approaches include Waterfall, Agile, and DevOps. The contractor shall employ best practices and proven expertise in managing and executing capability delivery utilizing these paths, methods, and approaches. Agile expertise shall include the ability to employ the Scaled Agile Framework (SAFE) as appropriate to realize the benefits of Agile and Lean development at enterprise scale. As specified by the IRS, contractor services and support shall be provided in alignment with existing IRS frameworks, processes, standards, and tools.", "chunk_id": 11}, {"child_chunk": "The Contractor shall:---Maintain and/or create ELC documentation such as: • Project Plan and associated documents, System Deployment Plan • Estimation Workbook, Computer Operator Handbook, 508 Documentation,Requirements Self Certification Checklist/Business Specification Report, Test Plan, End of Test Report per software release/milestone exit10Coordinate document reviews using the Peer Review Defect & Resolution Report (PRDRR) Form for creation and/or maintenance of ELC and other documents as specified by the PWR.Provide advice and oversight regarding IRS ELC processes and documentation. • Provide information for milestone readiness reviews as requested.Representative activities shall include:Assist in the selection and tailoring of ELC paths, methodologies, and approaches tomanaging and delivering program", "chunk_id": 12}, {"child_chunk": "activities shall include:Assist in the selection and tailoring of ELC paths, methodologies, and approaches tomanaging and delivering program capabilities.Assist in the development, communication, and execution of supporting program delivery strategies, incorporating and blending elements from multiple ELC paths, methodologies, and approaches, as needed, to accomplish delivery within the constraints and limitations of the existing IRS environment and culture.Assist the IRS in the adoption of new software development and delivery approaches, including to Agile and DevOps, and provide coaching support to assist the IRS in operationalizing supporting methodologies, processes, practices, and tools, as needed. • Utilize web-based enterprise project management software specifically designed for the IRS-selected software development approach (e.g., Agile, Waterfall,", "chunk_id": 12}, {"child_chunk": "as needed. • Utilize web-based enterprise project management software specifically designed for the IRS-selected software development approach (e.g., Agile, Waterfall, etc.). Document format will be in accordance with IRS guidelines using either Microsoft products.Facilitate capture of business needs through agile practices of defining and decomposingepics and user stories to ensure accurate interpretation of requirements.Assist with prioritization of requirements, epics, and user stories, as needed, to facilitate rapid and timely delivery of high-value capabilities in accordance with business needs and priorities.Engage Business, Development, Quality Assurance, Operations and Maintenance(O&M), and Cybersecurity stakeholders as equal partners in a multi-disciplinary delivery team to specify, design, integrate, deliver, operate, and maintain", "chunk_id": 12}, {"child_chunk": "and Cybersecurity stakeholders as equal partners in a multi-disciplinary delivery team to specify, design, integrate, deliver, operate, and maintain program capabilities. • Facilitate and participate in stakeholder feedback sessions to ensure solution alignment", "chunk_id": 12}, {"child_chunk": "with stakeholder needs and requirements.---Support development and execution of strategies for frequent and continuous building,testing, integration, and deployment of software, utilizing automation, whenever possible, to provision, configure, and modify environments and infrastructure.Create and manage documentation required by the ELC. Document format will be inaccordance with IRS guidelines and preferably editable / reusable (e.g., Microsoft Word). • Track and report on the delivery of agreed-upon capability, functionality, documentation,and other artifacts.---Provide support to facilitate common understanding and consistent application ofmethodologies, approaches, processes, practices, standards, and tools within and across the EPMO and its Programs.11Provide continuous analysis of the efficiency and effectiveness of program practices,processes,", "chunk_id": 13}, {"child_chunk": "and tools within and across the EPMO and its Programs.11Provide continuous analysis of the efficiency and effectiveness of program practices,processes, methodologies, approaches, and tools, along with recommendations for change or improvement, as needed.DESIRED OUTCOME – Deliver high quality documentation that is relatively error free so that updates, generated by document reviews, are minimal. The contractor shall successfully complete all requirements as documented in the PWR. Rapid, reliable, and low-risk delivery of high-value, high-quality program capabilities produced in close collaboration with integrated business and IT stakeholder teams through adaptive planning, evolutionary development, and rapid and flexible response to change.Subtask 5.4.1 Scrum Master and Scrum Development Support---The contractor shall", "chunk_id": 13}, {"child_chunk": "evolutionary development, and rapid and flexible response to change.Subtask 5.4.1 Scrum Master and Scrum Development Support---The contractor shall provide Scrum (a standard framework in Agile Project Management) development methodology and in producing documentation of Scrum team (sprints are 2-3-week durations of work) activities. The Contractor shall support scrum teams in the following areas: • Document the teams’ sprint planning efforts by producing sprint burn-down (work that has been accomplished) and backlog (work that needs to be accomplished) reportsFacilitate daily team meetings • Identify and track teams’ action items • Identify and track action items for escalation • Track and report teams’ burn-down metricsDESIRED OUTCOMES – The completion", "chunk_id": 13}, {"child_chunk": "teams’ action items • Identify and track action items for escalation • Track and report teams’ burn-down metricsDESIRED OUTCOMES – The completion of the Scrum support CLIN shall result in the following:Sprint teams’ plans for each sprint cycle are fully documented • Sprint teams’ progress against plan is tracked and documented • Sprint teams’ assigned action items are identified and tracked • Sprint teams’ action items for escalation are identified and tracked", "chunk_id": 13}, {"child_chunk": "Subtask 5.4.2 Agile Coaching---The IRS is seeking Agile Coaching support for assistance in adopting flexible Agile software methodologies and to establish the deep, institutional capability required to become a truly agile organization. Agile Coaching support would serve to deliver agile capability services to meet IRS needs such as foundational skills training, topic specific workshops, embedded coaching, spot coaching, team start up, team facilitation and general consulting to the IRS for Agile software practices.Deliverable Activities include activities such as:12Identify and provide recommended solutions for systemic gaps in Agile/Iterative delivery capabilityProvide support for the IRS Agile software methodology processes and ensure adhere ofFDT activities to prescribed cadencesEnhance product delivery flow • Provide staffing coaches to engagements based on the", "chunk_id": 14}, {"child_chunk": "IRS Agile software methodology processes and ensure adhere ofFDT activities to prescribed cadencesEnhance product delivery flow • Provide staffing coaches to engagements based on the needs of theteam/Portfolio/organization---Support Agile Communities of Practice (CoP) and ensure they increase organizationalagile capability through skills practice as well as knowledge acquisition.---Sustain the internal Agile Coaching Community and championing involvement inexternal Agile and Coaching community---Create a sustainable Agile capability that lasts long after key players move ensuring the healthy application of Agile practices and providing assistance to teams and program support when neededAssist the IRS with championing Agile transformation activitiesDESIRED OUTCOME: Improved knowledge transfer in adopting flexible Agile methodologies in supporting software development of digital capabilities.", "chunk_id": 14}, {"child_chunk": "Subtask 5.4.3 Agile Transformation---As IRS IT works to transition into Agile software delivery organization, it is to clearly identify define, communicate, and work to transform the barriers between the current operations, staffing and processes to those that will enable an Agile culture. The IRS has had some initial successes in Agile transformation activities but is looking for Contract support to assist with identifying further opportunities to continue the success and developing innovative solutions to achieving further success in working towards a more Agile software development organization. Delivery Activities include but are not limited to strategic planning, execution, and documentation support for:Identify organizational, staffing and process barriers to implementing Agile development practicesDevelop recommendations and plans to break down identified Agile or Iterative barriers • Assist the Digital Services", "chunk_id": 15}, {"child_chunk": "organizational, staffing and process barriers to implementing Agile development practicesDevelop recommendations and plans to break down identified Agile or Iterative barriers • Assist the Digital Services PMO and other IT organizations to implementrecommendations and plans to break down the Agile barriersDESIRED OUTCOME – The PMO will identify barriers to enabling Agile software development within the IRS and systemically work with IT partners to remove those barriers and transform the way the IRS develops software products5.5 Task Area 5, Program Integration---13The contractor shall support the establishment and execution of stakeholder engagement processes and models, including analysis, documentation, and management of program level action items, dependencies, risks, and gaps. The contractor shall also support the identification, as well as the consistent definition,", "chunk_id": 15}, {"child_chunk": "and management of program level action items, dependencies, risks, and gaps. The contractor shall also support the identification, as well as the consistent definition, communication, and application of standards, processes, methodologies, and approaches that are common to multiple EPMO programs and/or designated for EPMO-wide adoption or compliance.Representative activities shall include:Documenting the recommended stakeholder engagement processes, and processes and establish and develop a stakeholder interaction model to facilitate engagement between the PMO and IRS business and IT delivery partners.Create, coordinate, and maintain the program integrated master schedule, capturingkey program, release, project, stakeholder, and delivery partner activities, milestones, dependencies, and integration points including the schedules of the Program Office, multiple contractors,", "chunk_id": 15}, {"child_chunk": "release, project, stakeholder, and delivery partner activities, milestones, dependencies, and integration points including the schedules of the Program Office, multiple contractors, internal and external stakeholders, and delivery partners. Identify, specify, and communicate common or EPMO-wide standards, processes, methodologies, and approachesProvide coaching as needed to facilitate consistent and correct adoption or execution", "chunk_id": 15}, {"child_chunk": "within and between EPMO programs.---Desired Outcome: Efforts are aligned across the EPMO to avoid service and capability duplication and disruption, while achieving cost efficiencies. Programs receive information and guidance needed to understand and consistently apply common standards, processes, methodologies, and approaches. Program dependencies are continuously identified, managed, and addressed to minimize impacts to successful capability delivery.5.6 Task Area 6, Technical Integration---The contractor shall provide systems engineering and integration services to support upfront identification of program dependencies and integration points, as well as continuous monitoring, management, and response to anticipate and mitigate associated impacts to successful delivery of any EPMO program. Contractor integration support shall span the entire lifecycle of any program, from program initiation through delivery and", "chunk_id": 16}, {"child_chunk": "associated impacts to successful delivery of any EPMO program. Contractor integration support shall span the entire lifecycle of any program, from program initiation through delivery and operation of program capabilities. The Contractor shall support the Programs with technical integration analysis of projects and releases, including consideration and interfaces of upstream/downstream systems, with a particular emphasis on enterprise processes, infrastructure, tools, technologies, and environments. Ensure that new releases and projects are seamlessly integrated into the broader enterprise without negative impacts to overarching Program or filing season functionality.Representative activities shall include:High-level technical integration and deployment planning14Assisting IRS personnel with technical integration and deployment planning •Identify and manage technical dependencies and integration points at the EPMO-level, as well as those within and between", "chunk_id": 16}, {"child_chunk": "with technical integration and deployment planning •Identify and manage technical dependencies and integration points at the EPMO-level, as well as those within and between EPMO programs, releases, and projects. Identify and manage technical dependencies and integration points between supporting systems, processes, policies, technologies, organizations, delivery partners, project teams, and any other identified stakeholder groups.Provide upfront and continuous requirements analysis and engineering to understand,document, and communicate how non-functional requirements further define, refine, and constrain functional requirements. Identify, integrate, and manage dependencies and constraints arising from the intersection of functional and non-functional requirements where non-functional requirements are those that specify solution quality and assurance attributes including security, privacy, availability, reliability, and performance.Provide continuous requirements", "chunk_id": 16}, {"child_chunk": "requirements where non-functional requirements are those that specify solution quality and assurance attributes including security, privacy, availability, reliability, and performance.Provide continuous requirements refinement and decomposition to produce system,project, and “build-to” requirements needed to sufficiently inform development efforts. • Establish, maintain, and manage traceability between all levels and types of requirements from program initiation through design, development, testing, delivery, and operational acceptance.Perform technical integration planning. • Provide technical integration support across multiple internal and external projects fortesting.Provide strategy and technical support for the application and integration of tools needed for program execution including tools for program management, development, and testing.Conduct impact analyses of technical dependencies make recommendations forresolution and ensure technical decisions are communicated to all components of the program", "chunk_id": 16}, {"child_chunk": "program management, development, and testing.Conduct impact analyses of technical dependencies make recommendations forresolution and ensure technical decisions are communicated to all components of the program and owners of impacted upstream and downstream systems.Manage and maintain traceability from Technical Integration plans, includingdevelopment, build, release, and verification schedules, to the specific, approved functional requirements.Support research and analysis, assessment, and Independent Verification and Validation(IV&V) efforts to establish or confirm accuracy, completeness, sufficiency, appropriateness, and/or effectiveness of IRS-selected elements of the EPMO programs including program solutions, designs, products, technologies, data, frameworks, processes, practices, and documentation.Provide support to analyze and resolve issues impacting the quality of data needed for theprogram", "chunk_id": 16}, {"child_chunk": "technologies, data, frameworks, processes, practices, and documentation.Provide support to analyze and resolve issues impacting the quality of data needed for theprogram to achieve its stated goals and objectives.Perform technical integration planning, review, and update for each release, based on the Contractor’s technical analysis of the release plans, projected capabilities, and schedule. This will be accomplished in coordination with Program, Release and Project supportAnalyze technical alternatives if the release will not deploy on schedule or meet itsobjectives and develop high-level plans and activities for implementing the alternatives.15Desired Outcome: The program will have an executable technical integration plan incorporated into each release plan to ensure that new releases are seamlessly integrated into the broader enterprise without negative impacts to overarching or filing season functionality.", "chunk_id": 16}, {"child_chunk": "technical integration plan incorporated into each release plan to ensure that new releases are seamlessly integrated into the broader enterprise without negative impacts to overarching or filing season functionality. Requirements of all types and levels are sufficiently defined, managed, integrated, traceable, and communicated to facilitate development and delivery of desired solutions with little to no rework due to missing or misunderstood requirements, dependencies, or related impacts.", "chunk_id": 16}, {"child_chunk": "5.7 Task Area 7, Business Analysis---The contractor shall provide business process analysis, business process reengineering support, and project assessments to the program.Representative activities include:Develop descriptions of existing processes and planned process changes including complex process flow charts and diagrams, and presentations for each release.Facilitate the business transition to new capabilities for each release throughidentification of potential business process and resource impacts and recommendations for implementation.---Provide supporting analyses, documentation, presentations, meetings, andrecommendations as required.Update best practices for business process analysis, reengineering, and documentation, and demonstrate potential changes to the Business Modernization Office (BMO).Support business process reengineering activities for each release by applying expertise in the techniques and tools and by leading", "chunk_id": 17}, {"child_chunk": "to the Business Modernization Office (BMO).Support business process reengineering activities for each release by applying expertise in the techniques and tools and by leading and facilitating reengineering sessions, documenting the results, and analyzing and recommending potential improvements. • Support identification and communication of business process related impacts to/from allelements of the program and provide recommendations to address them.Desired Outcome: Business process integration points and impacts to or from the EPMO programs are captured, coordinated, and communicated to business and IT stakeholders to inform requirements, design, development, delivery, quality assurance, and transition planning efforts as needed.5.8 Task Area 8, Requirements Engineering---The contractor shall provide the program with requirements engineering support applying subject matter expertise and best practices for requirements", "chunk_id": 17}, {"child_chunk": "Task Area 8, Requirements Engineering---The contractor shall provide the program with requirements engineering support applying subject matter expertise and best practices for requirements development, analysis, management, traceability, validation, and tool integration.Representative activities shall include:16Analyze business requirements from key stakeholders. • Elicit, develop, and document program requirements including upfront specification of all functional and non-functional requirements needed to fully support program capabilities and business objectives.Refine and decompose program requirements into system, project and “build-to”requirements needed to support program development, testing, delivery, and operations activities.Utilize various methods for capturing and communicating requirements, as appropriate, for the program needs including use of epics, user stories, use cases and traditional “shall”", "chunk_id": 17}, {"child_chunk": "methods for capturing and communicating requirements, as appropriate, for the program needs including use of epics, user stories, use cases and traditional “shall” statements.Establish, maintain, and document traceability from business needs through and between all levels and types of requirements to supporting test cases/scenarios and acceptance criteria.Develop a program requirements traceability report to ensure that requirementstraceability is maintained at all levels.Revise, review, and update program requirements documents. • Support requirements tool integration. • Continuously assess requirements to verify and maintain traceability and to ensurepersistent alignment with evolving business needs, solution architecture, change requests and other dependencies.Desired Outcome: A requirements engineering process that integrates with IRS enterprise processes and tools, provides visibility into all program", "chunk_id": 17}, {"child_chunk": "solution architecture, change requests and other dependencies.Desired Outcome: A requirements engineering process that integrates with IRS enterprise processes and tools, provides visibility into all program and project requirements, maintains, and illustrates requirements traceability from business benefits and needs through deployment and facilitates rapid identification of issues.", "chunk_id": 17}, {"child_chunk": "5.9 Task Area 9, Configuration and Change Management---The contractor shall support Configuration Management (CM) functions including Unified Work Request (UWR) activities, Engineering Review Board (ERB) activities, Change Control Board (CCB) activities, business rule changes, configuration identification, configuration control, configuration status accounting and configuration audits.Representative activities shall include:Track and document all configuration items included in baseline releases during designintegration, testing, fielding and sustainment.Provide CM, quality assurance, and sustainment of all documentation. • Update Implementation Packages accordingly. • Develop Audit Plans and Reports, prepare and perform Audit Checklist activities. • Meet Government acceptance criteria for configuration management.17Support installation, configuration, integration, optimization of software used", "chunk_id": 18}, {"child_chunk": "Reports, prepare and perform Audit Checklist activities. • Meet Government acceptance criteria for configuration management.17Support installation, configuration, integration, optimization of software used by project’sfederated development team Implementing Agile change and configuration management• Adherence to established configuration and change management principles • Provide reporting to convey system configuration information, performance data, costinformation, and the status of operational activities. The contractor shall conduct ongoing analysis of the infrastructure to form the basis for recommendations to maintain and replenish inventory in a manner that enables rapid recovery/provisioning with minimized service disruption and downtime.Administer and optimize use of network and enterprise approved tools managementtechniques and tools to deploy new operating systems code, push configuration changes, capture essential information, and manage device configuration", "chunk_id": 18}, {"child_chunk": "of network and enterprise approved tools managementtechniques and tools to deploy new operating systems code, push configuration changes, capture essential information, and manage device configuration files.Support installation, configuration, integration, optimization of software used by project’sfederated development team and system/infrastructureContractors must state how they would manage the Portfolio and perform functions such as configuration management, the application of industry standards, and use of best practices, version control, security monitoring, preventive maintenance, and training for personnel. Additionally, contractors should describe what monitoring techniques (e.g., inspection regimen, customer input, audits) they would use to ensure the effectiveness of such activities.Desired Outcome: Consistent configuration management that implements standard documentation and reporting methods and provides a single logical view", "chunk_id": 18}, {"child_chunk": "would use to ensure the effectiveness of such activities.Desired Outcome: Consistent configuration management that implements standard documentation and reporting methods and provides a single logical view of all IT components and connections needed to effectively deliver IT services to customers.", "chunk_id": 18}, {"child_chunk": "5.10 Task Area 10, Change Management and Change Control---The contractor shall define and establish Change Management and Change Control processes and procedures for the IRS Program. The contractor shall describe how changes shall be initiated, analyzed, dispositioned by the IRS Program Office, and handed off for implementation. The contractor shall support the Program Office in establishing a CCB as the official mechanism for reviewing and recommending dispositions of change requests (CRs).Representative activities shall include:Develop a consistent approach to monitor change requests against projects/releases,evaluate change requests in terms of scope, cost, and schedule, and make recommendations to the Program Office.Monitor and track system baseline changes throughout the development, integration, andbaseline release process.---18Conduct analysis and", "chunk_id": 19}, {"child_chunk": "make recommendations to the Program Office.Monitor and track system baseline changes throughout the development, integration, andbaseline release process.---18Conduct analysis and coordinate UWR/CR life cycle support, business rules life cyclesupport, ERB support, and CCB support.---Analyze existing change management and change control processes and providerecommendations for improvement consistent with industry standards and best practices.---Desired Outcome: Mature change management and change control process that controls the lifecycle of all changes and enables beneficial changes to be made with minimum disruption to IT services.5.11 Task Area 11, Organizational Readiness---The contractor shall provide the PMO with organizational readiness support working across the technical and business organizations to ensure that the readiness work ties", "chunk_id": 19}, {"child_chunk": "Organizational Readiness---The contractor shall provide the PMO with organizational readiness support working across the technical and business organizations to ensure that the readiness work ties directly to the IRS’ goal of ensuring people, process, and technology readiness to support development, delivery, and operation of program capabilities. The Contractor shall provide the Programs with Organizational Readiness support, working across the technical and business organizations to ensure that this readiness work ties directly to our goal of ensuring people, process, and technology readiness.Representative activities shall include:Identify, document, and communicate end-to-end technical and organizational readiness requirements throughout the lifecycle of the program.Provide support to facilitate increased use of tools and automation. • Support definition and implementation of plans to address readiness requirements and to", "chunk_id": 19}, {"child_chunk": "facilitate timely achievement of both technical and organizational readiness.---Revise, review, and update program Organizational Readiness Plans to reflect changesand modifications in implementation planning.---Monitor and track the plan for each project/release that ensures the PMO, the business and delivery partners are ready for deployment from a people and process perspective.Support PMO leadership and integration of multiple organizational readiness work streams including integrating with business and delivery partners for identification, analysis and resolution of gaps and action items, preparation for stakeholder meetings and best practice analysis.Some programs have an integrated plan and process for ensuring the IRS organization is ready for deployment of each release and project, from people, process, and technology perspectives, including coordinating and executing activities, identifying gaps, and tracking resolution", "chunk_id": 20}, {"child_chunk": "ready for deployment of each release and project, from people, process, and technology perspectives, including coordinating and executing activities, identifying gaps, and tracking resolution implementation across the program.Programs execute its Organizational Readiness plan and has a documented artifact to summarize all Organizational Readiness and Transition Management activities.Support leadership with integration of multiple organizational readiness work streams focused on people readiness, process readiness and technology readiness. For the purposes of this sub-task, organizational readiness includes transition to operations. 19Ensure that each project/release has a plan and provides development, integration, andexecution support for that plan for:---Providing managers with implementation information to ensure they are ready fordeployment from a people perspective including staffing, labor relations, training, and communications.Ensuring", "chunk_id": 20}, {"child_chunk": "managers with implementation information to ensure they are ready fordeployment from a people perspective including staffing, labor relations, training, and communications.Ensuring that managers are ready for deployment from a process perspective including", "chunk_id": 20}, {"child_chunk": "business processes, operational processes, and operational and infrastructure documentation.---Develop Transition Management Plans, where required, to reflect the plans describedabove.---Desired Outcome: Coordinated and executed organizational readiness activities with gaps identified and resolutions implemented across business and delivery partners for each program or project as needed. The program has an integrated plan and process for ensuring the IRS organization is ready for development, deployment, and operation of each release from people, process, and technology perspectives.5.12 Task Area 12, Organizational Change Management---The contractor shall provide services to identify and plan for organizational change needed to support or resulting from; the execution or delivery of EPMO programs.Representative activities shall include:Support organizational design, strategic communications, organizational", "chunk_id": 21}, {"child_chunk": "to support or resulting from; the execution or delivery of EPMO programs.Representative activities shall include:Support organizational design, strategic communications, organizational assessment, andtransformation change management activities.---Develop communications training materials to support stakeholder engagement, rolloutprocedures and executive and governance reporting.---Desired Outcome: Effective stakeholder engagement model to facilitate organizational change to include processes, specification of roles and responsibilities of key organizational staff positions and templates.5.13 Task Area 13, Engineering and Architecture---The contractor shall provide support to ensure that the Solution Architecture and System Design Report reflect the strategic directions of the IRS. The Contractor shall provide technical expertise to ensure the development, update, and review of technical artifacts.Representative activities shall", "chunk_id": 21}, {"child_chunk": "the strategic directions of the IRS. The Contractor shall provide technical expertise to ensure the development, update, and review of technical artifacts.Representative activities shall include:Support the documentation and evaluation of logical and physical designs.20Facilitate and participate in detailed logical and physical design reviews at the project and", "chunk_id": 21}, {"child_chunk": "release levels.---Support capacity performance testing of loads processing. • Support performance prototypes and analysis of alternatives for candidate solutionarchitecture components.---Review project and release plans and related documentation and establish a cleararticulation of project impacts on the IT Modernization Plan including risks, gaps, and dependencies; and providing recommendations to address.Document Programs' Solution Architecture questions and work with stakeholders toprovide timely resolution in collaboration with subject matter experts, the originator, and other accountable personnel to preclude delays and disruptions to program and project schedules.Track and document business process reengineering opportunities for future statesolutions.---Facilitate and participate in detailed logical and physical design reviews at the project andrelease levels, providing recommendations, and ensuring that all issues are timely dispositioned to", "chunk_id": 22}, {"child_chunk": "and participate in detailed logical and physical design reviews at the project andrelease levels, providing recommendations, and ensuring that all issues are timely dispositioned to preclude delays and disruptions to project schedules.Prior to each milestone exit, review, revise, and update, as necessary, the Programs’Solution Architecture and the Vision Solution Architecture (VSA); this effort includes planning review meetings, preparing materials for engineering briefings for technical and executive decisions.Track and support analyses of action items and coordinate and provide supportingpresentations. This includes tracking decisions or other changes that might impact the Solution Architecture.Develop solution architecture and system design related ELC documentation including, but not limited to, Solution Architecture, Simplified System Design Report, Interface Control Document, and Government Equipment", "chunk_id": 22}, {"child_chunk": "and system design related ELC documentation including, but not limited to, Solution Architecture, Simplified System Design Report, Interface Control Document, and Government Equipment List.Desired Outcome: An accurate and updated Architecture and System Design plans for the programs", "chunk_id": 22}, {"child_chunk": "5.14 Task Area 14, Enterprise Testing---The contractor shall provide technical expertise for test planning, integration and reporting for releases and projects.Representative activities shall include:Support the creation and collaborative update of the program Test Strategy and Test Plan. • Facilitate meetings and interviews to collaborate with the Test Integration Office (TIO) andother stakeholders.---Update the program-level view of cross-project test execution. • Assess program test integration processes and document findings for improvement.21Enhance testing, including the design and development of automated test artifacts to theextent practicable.---Testing - coordinating and performing demonstrations and conducting unit level, system, anduser testing to be performed before the conclusion of each iterationo Documenting and reporting testing results while", "chunk_id": 23}, {"child_chunk": "and performing demonstrations and conducting unit level, system, anduser testing to be performed before the conclusion of each iterationo Documenting and reporting testing results while adhering to IRS requirementsrelative to product quality requirement.---o Identifying agile test results reports that are appropriate for IRS iterative deliveryprojects---o Utilizing test driven development approach, as applicable, to support the developmentof high-quality code---Contractor shall perform defect resolution • Support user acceptance testing of new release • Support capacity performance testing of loads processing • Support the implementing a strategy for regression testing that includes efficient andeffective automated testing processes that provide maximum coverage of major business processesCoordinate the testing and validating of all IRS infrastructure software patches andarchitectural changes---Provide review, support of testing of", "chunk_id": 23}, {"child_chunk": "maximum coverage of major business processesCoordinate the testing and validating of all IRS infrastructure software patches andarchitectural changes---Provide review, support of testing of projects/releases • Coordinating with Stakeholders and other relevant business units, to support maintenance and implementation of test plans, conforming to IRS test procedures as specified in IRM 2.127.2Support, Unit Testing, System Integration Test (SIT) and Application Qualification Test(AQT) testingDesired Outcome: An accurate and updated Program Test Plan that reflects changes to the Release Plan.", "chunk_id": 23}, {"child_chunk": "5.15 Task Area 15, Cybersecurity---The contractor shall work collaboratively with IRS Cybersecurity, Information Assurance (IA) and other delivery partner staff to ensure that security and privacy requirements, dependencies and constraints are fully integrated with program, project, system and “build-to” requirements and that they are continuously identified, managed, and addressed in all aspects of program planning, execution, and delivery from initiation through deployment and operations. The contractor shall provide the program with the development and deployment of security architecture and engineering changes made as part of the program.The Contractor shall support the IRS Security SME as they ensure that all releases comply with IRS security requirements and processes. In addition, the Contractor shall support the Programs with meeting Enterprise Continuous Monitoring", "chunk_id": 24}, {"child_chunk": "Security SME as they ensure that all releases comply with IRS security requirements and processes. In addition, the Contractor shall support the Programs with meeting Enterprise Continuous Monitoring (eCM-r) requirements previously called Security Assessment and Authorization (SA&A) for releases. The Contractor shall staff a security specialist (Systems Security Administrator) to assist the IRS Programs’ security point of 22contact with security documentation, FISMA application material weakness reconciliation and processes associated with the IRS SA&A.The IRS is seeking Contractor support to assist in cyber security software development compliance and secure (web) application development activities. As necessary cyber security support personnel may be embedded directly within the Federated Development team.Representative activities include:Review deliverables created by the program security engineering team leveraging a deep", "chunk_id": 24}, {"child_chunk": "understanding of security and privacy principles and solutions.---Confirm the accuracy of test result statistics. • Document risk mitigation strategies and alternative solutions for security and privacy riskareas.---Support resolution of identified defects through analyses, presentations, and coordinationmeetings.---Maintain an internal risk register to track potential security and privacy weaknesses. • Document, monitor, and report on status and resolution of known security deficiencies, defects, risks, and mitigation efforts impacting any systems, components, software, hardware, processes, personnel, or approval mechanisms needed to accomplish delivery of program capabilities.Provide continuous assessment and validation that solutions are specified, developed, andtested to meet and demonstrate compliance with security and privacy requirements. Identify and recommend options for modifying approaches to achieving and maintaining security", "chunk_id": 25}, {"child_chunk": "are specified, developed, andtested to meet and demonstrate compliance with security and privacy requirements. Identify and recommend options for modifying approaches to achieving and maintaining security compliance to support program delivery strategies that seek to achieve more rapid, frequent, and continuous delivery of IT systems and services.Create Change Requests based on consultation with the security engineering team toenhance security or privacy.---Assist security champion on filing request forms • Prepare Application Audit Plan update for each release Review Change Requests andUnified Work Requests (UWRs) for security impactsAssist \\ Security Team with Cyber Security Change Request forms • Attend and participate in ERB meetings as the Security SME • Provide applicable documentation for all IT and FISMA related security items impacting", "chunk_id": 25}, {"child_chunk": "Programs.---Support in Enterprise Continuous Monitoring (eCM) activities • Support in updates of eCM documentation, i.e., the System Security Plan (SSP), Security Risk Assessment (SRA), Information Systems Contingency Plan (ISCP), Privacy Impact Assessment (PIA), Security Impact Analysis (SIA) and Authorization Boundary Memo (ABM).23Support annual security controls testing Participate in Security meetings with ProjectSecurity Team---Security and risk posture analysis associated with software development efforts • Compliance of development efforts with information security best practices and industryregulations---Review and analysis of source code, database, and Digital Services software codevulnerability scanningReal time support to secure development activities and mitigation /remediation activitiesto ensure products", "chunk_id": 26}, {"child_chunk": "database, and Digital Services software codevulnerability scanningReal time support to secure development activities and mitigation /remediation activitiesto ensure products produced are compliant with all cyber security policiesSupport for assessing and documenting adherence to FISMA and Security Assessmentand Authorization (SA&A) requirements.---Desired Outcome: Effective and timely mitigation strategies for security and privacy risks. The program security and privacy team inputs are efficiently and effectively incorporated into program processes and solutions. Programs are continuously aware of; and responsive to, both known and emerging security and privacy impacts and risks.5.16 Task Area 16, Applications Development---The contractor shall provide integration and coordination support to the Applications Development organization that encompasses risk mitigation planning, application system requirements management and impact", "chunk_id": 26}, {"child_chunk": "Applications Development---The contractor shall provide integration and coordination support to the Applications Development organization that encompasses risk mitigation planning, application system requirements management and impact coordination, test planning, deployment and operations/production process support, financial material weakness resolution and related integration and coordination activities as required.Representative activities shall include:Identify the appropriate integration points for impact analysis in support of the requirements management process for the program. Provide integration support for data exchange compatibility test planning. Support AD-wide internal and external stakeholder communications. Support the development and documentation of new systems and changes to legacy systems. Review project and release designs, solution assurance plans and validation plan to identify risks associated with implementation and achieving expected objectives.Develop, manage, and administer the SharePoint sites or similar type of", "chunk_id": 26}, {"child_chunk": "solution assurance plans and validation plan to identify risks associated with implementation and achieving expected objectives.Develop, manage, and administer the SharePoint sites or similar type of sites to supportthe programs while adhering to IRS guidelineso Conduct planning sessions with IT Delivery Partners to develop and communicate requirements to facilitate implementation and deployment of SharePoint sites or similar type of siteso Develop SharePoint sites or similar type of sites based on the requirements andadminister the sites to manage the changes and access to the sites24Desired Outcome: Selected operational support processes and procedures that align with program tasks meet agreed upon objectives and are completed on schedule and in coordination with the program PMO and impacted projects.", "chunk_id": 26}, {"child_chunk": "5.17 Task Area 17, Enterprise Operations (EOps)---The contractor shall support program coordination, planning, scheduling, and monitoring tasks on behalf of EOps. The contractor shall also provide systems administration support to EOps- specified IT infrastructure initiatives including the IRS Linux Migration Initiative, operational monitoring, change management, disaster recovery and business continuity.Representative activities shall include:Assist EOps Security Operations and Standards Division (SOSD) to ensure complianceand security of IRS IT infrastructure.---Develop and recommend best practices and implementation of new technologies andmethodologies as requested by the IRS.Documents perform knowledge transfer and train IRS staff related to the installation, configuration, tuning, troubleshooting, and lessons learned of the technology stack. • Review and comment", "chunk_id": 27}, {"child_chunk": "perform knowledge transfer and train IRS staff related to the installation, configuration, tuning, troubleshooting, and lessons learned of the technology stack. • Review and comment on design and operational documents from the EOps perspective including Vision Scope Architecture (VSA), Solution Architecture (SA), Computer Operators Handbook (COH) and Information System Contingency Plan (ISCP) documents.Represent EOps in technical meetings and guide the stakeholders with IRS EOpsprocesses/procedures.---Options for operations and maintenance of a set of ancillary applications •Implementation of functional enhancements, which include services needed to improve operation of IFS in new functional areas arising during the life of the Task Order Implementation of advanced technical capabilities, which include the services needed to incorporate technical changes that arise", "chunk_id": 27}, {"child_chunk": "in new functional areas arising during the life of the Task Order Implementation of advanced technical capabilities, which include the services needed to incorporate technical changes that arise during the life of the Task Order Initial transition to support activities, from the incumbent to the selected Contractor, and from the Contractor to the Government, or to a successor Contractor, at the completion of this contract.Desired Outcome: EOps has efficient and effective infrastructure available as well as sufficient knowledge and expertise, to operate in support of EPMO program requirements.", "chunk_id": 27}, {"child_chunk": "5.18 Task Area 18, Cloud Services---The contractor shall support program coordination, planning, scheduling, and monitoring tasks of all current and future cloud and its supporting services. The contractor shall also provide25systems administration support as needed including the IRS Migration Initiatives, operational monitoring, change management, disaster recovery and business continuity.Representative activities shall include:Design and execute a cloud migration strategy solution with Programs, cross-serviceteams, and third-party partners---Translate IRS/IT strategic goals, roadmaps, and business requirements into future statearchitectures designed to leverage the cutting-edge functionality delivered through cloud service providersMitigate adoption challenges on infrastructure and application portfolios and bridge thegaps during the migration strategy design process.---Plan,", "chunk_id": 28}, {"child_chunk": "functionality delivered through cloud service providersMitigate adoption challenges on infrastructure and application portfolios and bridge thegaps during the migration strategy design process.---Plan, execute & monitor cloud adoption • Ensure compliance & governance of cloud operationsDesired Outcome: Cloud services is one of the most implemented methods for developing and delivering enterprise applications. It is also the most opted solution for the ever-expanding need of expertise for large-scale enterprises like IRS. Cloud services helps IRS transform the business information system domain as it provides adequate services for the growing needs of businesses5.19 Task Area 19 – Optional Legislation & Initiatives Support---(Task Area 1: Transition Management, Task Area 2: Release Management, Task Area 3: Program/Project Management, Task Area", "chunk_id": 28}, {"child_chunk": "Area 1: Transition Management, Task Area 2: Release Management, Task Area 3: Program/Project Management, Task Area 4: Enterprise Life Cycle (ELC), Task Area 5: Program Integration, Task Area 6: Technical Integration, Task Area 7: Business Analysis, Task Area 8: Requirements Engineering, Task Area 9: Configuration and Change Management, Task Area 10: Change Management and Change Control, Task Area 11: Organizational Readiness, Task Area 12: Organizational Change Management, Task Area 13: Engineering and Architecture, Task Area 14: Enterprise Testing, Task Area 15: Cybersecurity, Task Area 16: Applications Development, Task Area 17: Enterprise Operations", "chunk_id": 28}, {"child_chunk": "Area 14: Enterprise Testing, Task Area 15: Cybersecurity, Task Area 16: Applications Development, Task Area 17: Enterprise Operations (EOps), Task Area 18: Cloud Services)The Government may require optional surge support during the base or any option period for new legislative changes, new initiatives, unexpected major changes to current initiatives/projects. Legislation & Initiatives will be in-scope to provide support for the defined task areas of a Task Order PWS. Legislation & Initiatives support is OPTIONAL and is not a guarantee. If the Government determines that an increased support is required for any task areas defined in the Task Order PWS, the Government reserves the right to exercise the Legislation & Initiatives Option. Legislation & Initiatives support", "chunk_id": 28}, {"child_chunk": "any task areas defined in the Task Order PWS, the Government reserves the right to exercise the Legislation & Initiatives Option. Legislation & Initiatives support will be provided at the same labor rates proposed and found fair and reasonable at time of BPA/task order award for the applicable ordering period.5.19 Task Area 20 – Optional Surge Support Option Task 20 - Additional Services (Task Area 1: Transition Management, Task Area 2: Release Management, Task Area 3: Program/Project Management, Task Area 4: Enterprise Life26Cycle (ELC), Task Area 5: Program Integration, Task Area 6: Technical Integration, Task Area 7: Business Analysis, Task Area 8: Requirements Engineering, Task Area", "chunk_id": 28}, {"child_chunk": "Program Integration, Task Area 6: Technical Integration, Task Area 7: Business Analysis, Task Area 8: Requirements Engineering, Task Area 9: Configuration and Change Management, Task Area 10: Change Management and Change Control, Task Area 11: Organizational Readiness, Task Area 12: Organizational Change Management, Task Area 13: Engineering and Architecture, Task Area 14: Enterprise Testing, Task Area 15: Cybersecurity, Task Area 16: Applications Development, Task Area 17: Enterprise Operations (EOps), Task Area 18: Cloud Services)The Government may require optional Surge support during the base or any option period to support expected modernization and other strategic initiatives that have not previously determined timeline to", "chunk_id": 28}, {"child_chunk": "Government may require optional Surge support during the base or any option period to support expected modernization and other strategic initiatives that have not previously determined timeline to implement the requirements. Optional modifications will be in-scope to provide increased support for the defined task areas of a Task Order PWS. Optional support is not a guarantee. If the Government determines that an increased quantity of support is required for the task areas defined in the Task Order PWS, the Government reserves the right to exercise the Optional Surge Support. Optional support will be provided at the same labor rates proposed and found fair and reasonable at time of BPA/task order award for the applicable ordering period.", "chunk_id": 28}, {"child_chunk": "5.20 Task Area 20 – Optional Surge Support---Surge Option Task 20 - Additional Services (Task Area 1: Transition Management, Task Area 2: Release Management, Task Area 3: Program/Project Management, Task Area 4: Enterprise Life Cycle (ELC), Task Area 5: Program Integration, Task Area 6: Technical Integration, Task Area 7: Business Analysis, Task Area 8: Requirements Engineering, Task Area 9: Configuration and Change Management, Task Area 10: Change Management and Change Control, Task Area 11: Organizational Readiness, Task Area 12: Organizational Change Management, Task Area 13: Engineering and Architecture, Task Area 14: Enterprise Testing,", "chunk_id": 29}, {"child_chunk": "Readiness, Task Area 12: Organizational Change Management, Task Area 13: Engineering and Architecture, Task Area 14: Enterprise Testing, Task Area 15: Cybersecurity, Task Area 16: Applications Development, Task Area 17: Enterprise Operations (EOps), Task Area 18: Cloud Services)The Government may require optional Surge support during the base or any option period to support expected modernization and other strategic initiatives that have not previously determined timeline to implement the requirements. Optional modifications will be in-scope to provide increased support for the defined task areas of a Task Order PWS. Optional support is not a guarantee. If the Government determines that an increased quantity of support is required for the task areas defined in the Task Order", "chunk_id": 29}, {"child_chunk": "Optional support is not a guarantee. If the Government determines that an increased quantity of support is required for the task areas defined in the Task Order PWS, the Government reserves the right to exercise the Optional Surge Support. Optional support will be provided at the same labor rates proposed and found fair and reasonable at time of BPA/task order award for the applicable ordering period.", "chunk_id": 29}, {"child_chunk": "6.0 SKILL REQUIREMENTS---27In addition to any pre-defined labor categories, which are anticipated as necessary to fulfill the Government’s requirements, the Contractor is expected to provide expertise, knowledge, and skills relating to software development lifecycle, modernization, project management, program management, and other services.6.1 Contractor Key Personnel (KP)---Only the positions, identified below will be considered Key Personnel.Anticipated Labor Category descriptions are located in Attachment 4 –Labor CategoryCrosswalk---In the Table below, the Contractor shall identify individuals considered as Key Personnel. Positions listed below may be used at BPA and/or Task Order Level. However, we are asking that each Contractor identify:1. BPA Level – Program Manager KP", "chunk_id": 30}, {"child_chunk": "be used at BPA and/or Task Order Level. However, we are asking that each Contractor identify:1. BPA Level – Program Manager KP that will be designated to be utilized acrossassociated Task Orders, and BPA levelo Point of Contact that will be responsible for direction and coordination withgovernment regarding changes, concerns, and/or updates to their overall BPA management2. Task Order Level - Project Manager, Agile Coach, Technical Writer, Technical---Architect, 508 Developer/Test KPs shall be designated during individual Task Order quotation.Table 2 – Key Personnel---Name---Position or Role---Contractor’s Schedule Labor Category---TBD---Program Manager (BPA)---TBD---Project Manager", "chunk_id": 30}, {"child_chunk": "Personnel---Name---Position or Role---Contractor’s Schedule Labor Category---TBD---Program Manager (BPA)---TBD---Project Manager (TO)---TBD---Agile Coach (TO)---TBD---Technical Writer (TO)---TBD---Technical Architect (TO)---TBD---508 Developer/Tester (TO)---The Task Order Project Manager shall be responsible for the performance of work performed under their designated Task Orders. The Project Manager shall have full authority to act on28behalf of the Contractor on all award matters relating to daily operation. The BPA Program Manager shall be available during core hours – 8:00 a.m. to 4:30 p.m., Monday thru Friday except Federal", "chunk_id": 30}, {"child_chunk": "Program Manager shall be available during core hours – 8:00 a.m. to 4:30 p.m., Monday thru Friday except Federal holidays or when the IRS facility is closed for administrative reasons.The Contractor shall submit resume for identified PM for review and qualifications", "chunk_id": 30}, {"child_chunk": "verification.---The Contractor must notify the Contracting Officer, in writing, prior to making any changes or substitutions in key personnel. No substitutions shall be made except in accordance with below process and substitution clause located within IRS Security Clauses specifically #26 IR1052.204.9006 – NOTIFICATION OF CHANGE IN CONTRACTOR EMPLOYEE EMPLOYMENT STATUS, ASSIGNMENT, or STANDING.1. Contractor promptly notifies the Contracting Officer in writing, at least fifteen (15)working days in advance of the proposed substitutions. The Government has 30 days to approve or disapprove key personnel or they are deemed acceptable substitutions. Contractor must provide:a. detailed explanation of the circumstances necessitating the proposed substitutions, b. complete resume for the proposed", "chunk_id": 31}, {"child_chunk": "or they are deemed acceptable substitutions. Contractor must provide:a. detailed explanation of the circumstances necessitating the proposed substitutions, b. complete resume for the proposed substitute, and c. any other information requested by the Contracting Officer needed to approve ordisapprove the proposed substitution.2. All proposed substitutions must have qualifications that are equal to or greater than thelabor category position requirements.---3. The Contracting Officer (CO) will forward request to authorized Portfolio Office---representative (usually BPA or Task Order Level COR) to conduct evaluation of request. Representative will notify CO approval or disapproval, in writing.7.0 DELIVERABLES---7.1 Deliverables---The contractor shall provide the following deliverables at the BPA", "chunk_id": 31}, {"child_chunk": "in writing.7.0 DELIVERABLES---7.1 Deliverables---The contractor shall provide the following deliverables at the BPA Level:7.1.1 Kickoff Meeting---Within five (5) business days of award, the contractor shall meet with Government representatives at a mutually agreed upon location or via teleconference. The intent of this meeting is to initiate the communication process between the IRS and the contractor by introducing key participants, explaining their roles, reviewing communication ground rules, and assuring a common understanding of requirements and objectives.29The meeting shall include an introduction of those in attendance and discussion of the successful contractor’s approach and plan for the scope of work. The contractor shall provide meeting notes (inclusive of any follow-up", "chunk_id": 31}, {"child_chunk": "in attendance and discussion of the successful contractor’s approach and plan for the scope of work. The contractor shall provide meeting notes (inclusive of any follow-up actions) to the Government within five (5) business days after the meeting.The Government may, at its discretion, require Kickoff meetings at the Task Order level. If a Task Order Kickoff meeting is required, the parameters and scope of the meeting will be set forth in the Task Order.", "chunk_id": 31}, {"child_chunk": "7.1.2 Quality Control Plan (QCP)---The contractor shall prepare a Quality Control Plan (QCP) for the work to be conducted. The purpose of the QCP is to outline a strategy and identify mechanisms for ensuring that all products and services meet quality standards for completeness, accuracy, and timeliness. In the plan, contractors must describe the quality control methods they would employ to ensure that the requirements are provided as specified. Contractors must state how they would manage the program and perform functions such as configuration management, the application of industry standards, and use of best practices, version control, security monitoring, preventive maintenance, and training for personnel. Additionally, contractors should describe what monitoring techniques (e.g., inspection regimen, customer input,", "chunk_id": 32}, {"child_chunk": "security monitoring, preventive maintenance, and training for personnel. Additionally, contractors should describe what monitoring techniques (e.g., inspection regimen, customer input, audits) they would use to ensure the effectiveness of such activities. The QCP shall describe the methods for identifying and preventing problems before the level of performance becomes unacceptable. The plan shall be provided in electronic format and shall comply with all applicable standards of 36 CFR §1194 – Section 508 of the Rehabilitation Act of 1973, as amendedThe QCP shall be provided within thirty (30) days of award. Any proposed changes to the QCP after it has been accepted by the IRS shall require written concurrence from the CO.7.2 Task Order Level Deliverables The contractor shall provide", "chunk_id": 32}, {"child_chunk": "after it has been accepted by the IRS shall require written concurrence from the CO.7.2 Task Order Level Deliverables The contractor shall provide the deliverables as described in Table 1 below for Task Orders issued against the BPAs. All contractor deliverables or work products shall remain categorized as \"Official Use Only.” The release of any portion must be authorized in writing by the Government. The deliverables and work products will be provided in electronic format and shall comply with all applicable standards of Section 508 of the Rehabilitation Act. Table 1 defines the deliverables at a high level and should not be considered all inclusive. Each Task Order will identify the specific deliverables required for that Task Order and the final format and content requirements will be mutually developed", "chunk_id": 32}, {"child_chunk": "be considered all inclusive. Each Task Order will identify the specific deliverables required for that Task Order and the final format and content requirements will be mutually developed and agreed upon among the IRS Program Manager (PM), the contractor and the contracting officer’s technical representative (COR). The Task Order shall also specify the required delivery dates and timeframes.", "chunk_id": 32}, {"child_chunk": "Table 1: Schedule of Deliverables---30Task Area 1, Transition Management---Deliverable No.---Deliverable---Due Date/Frequency---1Knowledge transfer plans---TBD---2Transition plans---TBD---Task Area 2, Release Management Support---Deliverable No.---Deliverable---Due Date/Frequency---TBD---3Integrated release planTBD---4Release dependencies list---TBD---5Release risk and issue register---TBD---6Release status reports---TBD---7Release meeting agendas, presentations, and minutes---TBD---8Lessons Learned---Task Area 3, Program/Project Management Support---Deliverable No.---Deliverable---Due", "chunk_id": 33}, {"child_chunk": "Learned---Task Area 3, Program/Project Management Support---Deliverable No.---Deliverable---Due Date/Frequency---TBD---9Project management documentation---TBD---10Project schedules---TBD---11Project status reports---TBD---12Process and procedure documentation---TBD---13Project meeting agendas, presentations, and minutes---14Program vision and charter---TBD---15Program meeting agendas presentations and minutes---TBD---16Process and procedure documentation---TBD---17Analysis of alternatives---TBD---18Program reports---TBD---Program risk and issue register---19TBD---Strategic roadmaps and operating models---20TBD---Contingency", "chunk_id": 33}, {"child_chunk": "reports---TBD---Program risk and issue register---19TBD---Strategic roadmaps and operating models---20TBD---Contingency plans---21TBD---31TBD---22Lessons learnedTask Area 4, ELC Support---Deliverable No.---Deliverable---Due Date/Frequency---23Artifact strategy---TBD---Task Area 5, Program Integration---Deliverable No.---Deliverable---Due Date/Frequency---24Stakeholder engagement process and interaction model---TBD---25Program integrated master scheduleTBD---Task Area 6, Technical Integration---Deliverable No.---Deliverable---Due Date/Frequency---Technical dependencies, integration points and impact", "chunk_id": 33}, {"child_chunk": "Area 6, Technical Integration---Deliverable No.---Deliverable---Due Date/Frequency---Technical dependencies, integration points and impact analyses---26TBD---TBD---27Non-functional requirements---Dependencies List identifying the intersection of functional and non-functional requirementsTBD---28TBD---29Technical integration plans---Task Area 7, Business Analysis Support---Deliverable No.---Deliverable---Due Date/Frequency---Business process descriptions, process flows, diagrams and presentations---TBD---30TBD---31Business process impacts and recommendations---Best practices for business process analysis and reengineering---TBD---32Task Area 8, Requirements Engineering Support---Deliverable No.---Deliverable---Due", "chunk_id": 33}, {"child_chunk": "process analysis and reengineering---TBD---32Task Area 8, Requirements Engineering Support---Deliverable No.---Deliverable---Due Date/Frequency---Program requirements, functional and non-functional---TBD---33TBD---34System, project and build-to requirements---TBD---35Requirements traceability reports---32Task Area 9, Configuration and Change Management Support---Deliverable No.---Deliverable---Due Date/Frequency---TBD---36Configuration items list---TBD---37Implementation packages---TBD---38Audit plans and reports---Task Area, 10, Change Management and Change Control Support---Deliverable No.---Deliverable---Due", "chunk_id": 33}, {"child_chunk": "plans and reports---Task Area, 10, Change Management and Change Control Support---Deliverable No.---Deliverable---Due Date/Frequency---TBD---39Change request process---TBD---40UWR/CR Analysis---Task Area 11, Organizational Readiness Support---", "chunk_id": 33}, {"child_chunk": "Deliverable No.---Deliverable---Due Date/Frequency---41TBD---Organizational readiness plans and reports---Task Area 12, Organizational Change Management Support---Deliverable No.---Deliverable---Due Date/Frequency---TBD---42Organizational change assessments---TBD---43Organizational change plans and reports---TBD---44Communication plans---TBD---45Training plans---Task Area 13, Engineering and Architecture Support---Deliverable No.---Deliverable---Due Date/Frequency---46Technical analyses and assessments---TBD---Task Area 14, Enterprise Testing Support---Deliverable No.---Deliverable---Due Date/Frequency---TBD---47Test", "chunk_id": 34}, {"child_chunk": "Area 14, Enterprise Testing Support---Deliverable No.---Deliverable---Due Date/Frequency---TBD---47Test plans---TBD---48Test results reports---TBD---49Test integration analysis and recommendations---Task Area 15, Cybersecurity Support---33Deliverable No.---Deliverable---Due Date/Frequency---TBD---50Security and privacy requirements---TBD---51Security and privacy risk management plans and reports---TBD---52Defect analysis reports and recommendations---TBD---53Security test plans---TBD---54Security test results reports---Task Area 16, Applications Development Support---Deliverable No.---Deliverable---Due", "chunk_id": 34}, {"child_chunk": "test results reports---Task Area 16, Applications Development Support---Deliverable No.---Deliverable---Due Date/Frequency---TBD---55Requirements management plans---TBD---56Test plans---TBD---57Technical review results and recommendations---TBD---58Communications plans---TBD---59Risk management plans---Task 17, Enterprise Operations Support---Deliverable No.---Deliverable---Due Date/Frequency---TBD---60Best practices recommendations---TBD---61Knowledge transfer plans---TBD---62Technical review results and recommendations---Task Area 18, Cloud Services---Task Area 18, Cloud Services---Task Area 18, Cloud Services---Deliverable", "chunk_id": 34}, {"child_chunk": "and recommendations---Task Area 18, Cloud Services---Task Area 18, Cloud Services---Task Area 18, Cloud Services---Deliverable No.---Deliverable---Due Date/Frequency---63Cloud Strategy Plan---TBD---64Cloud Transition Plan---TBD---65Cloud Implementation Plan---TBD---TBD – To Be Determined347.3 Submission of Deliverables---Any deliverables that do not comply with the acceptance criteria outlined in the BPA, Task Order or the QASP shall be considered rejected. The COR shall provide written feedback on deliverables within ten (10) business days. The contractor shall provide revisions within five (5) business days of receipt of the COR’s feedback. The number of days", "chunk_id": 34}, {"child_chunk": "(10) business days. The contractor shall provide revisions within five (5) business days of receipt of the COR’s feedback. The number of days allotted to the contactor for re-submission of deliverables may be adjusted if agreed upon by both parties. If the vendor has not been notified of any discrepancies within ten (10) business days after submission of the deliverable or successful completion of a task, the deliverable or task shall be considered accepted. Unless otherwise specified in the Task Order, all deliverables/ work products shall be provided no later than 4:00 p.m. EST on the applicable due date(s).", "chunk_id": 34}, {"child_chunk": "7.4 Documentation Requirements---The contactor shall provide all documentation in Section 508 compliant electronic format and hard copy. The Government will have the right to request suppression of hard copy deliverables in cases where security and privacy concerns are a factor, or to reduce paperwork burden. All deliverables resulting from work executed under this contact shall convey to the government. In addition to the requirements set forth in the QASP and the Task Order, all documentation shall be provided in accordance with the criteria set forth below:Completeness – The document demonstrates sufficient level of detail to showunderstanding of the requirements, technology and design, customers, and operating environment.Feasibility - The document defines information, which is formatted properly, contains valid information in support of the", "chunk_id": 35}, {"child_chunk": "and design, customers, and operating environment.Feasibility - The document defines information, which is formatted properly, contains valid information in support of the task orders and provides a deliverable within time constraints.Understandability - The document is to be clean, clearly written, all printed words are legible, and the outline is easy to follow. All diagrams are easy to understand and relevant to the supporting narrative.Accuracy – The document is accurate in presentation exhibiting clear and conciseinformation, technical content, and adherence to accepted elements of style, operational content, and consistent within itself and with other documents.Practicality - The document provides information and guidance that is practical for implementation within the IRS environment and appropriate given the subject organization’s level of", "chunk_id": 35}, {"child_chunk": "other documents.Practicality - The document provides information and guidance that is practical for implementation within the IRS environment and appropriate given the subject organization’s level of maturity.358.0 QUALITY ASSURANCE SURVEILLANCE PLAN (QASP)The Quality Assurance Surveillance Plan (QASP) at Attachment 1 will provide a means for evaluating the contractor's performance to ensure that the Government receives the level of service required to achieve the objectives of this procurement. Under this plan, the contractor's performance will be assessed against established standards and quality levels to determine if the IRS is receiving the quality of services set forth in the performance work statement.In addition, the contractor shall establish and maintain a complete QCP in accordance with Section 7.1.2.", "chunk_id": 35}, {"child_chunk": "forth in the performance work statement.In addition, the contractor shall establish and maintain a complete QCP in accordance with Section 7.1.2. This links the Government and contractor’s quality assurance efforts into an integrated package with shared objectives.", "chunk_id": 35}, {"child_chunk": "9.0 PERIOD OF PERFORMANCE---The period of performance of each BPA shall be Seven (7) years from date of award.10.0 PLACE OF PERFORMANCE---All work under this agreement will be performed at the contractor’s site and at IRS sites in the following locations:Lanham, Maryland • Memphis, Tennessee • Austin, Texas • Dallas, Texas • Ogden, Utah •IRS locations may be added based on future requirements.11.0 TRAVEL---Travel may be required by the contractors to complete the requirement of individual Task Orders. Task orders contemplating travel will have a specific Travel CLIN. Travel requires written pre-approval by the Contracting Officer Representative (COR). Travel and per diem will be reimbursed at cost", "chunk_id": 36}, {"child_chunk": "Travel CLIN. Travel requires written pre-approval by the Contracting Officer Representative (COR). Travel and per diem will be reimbursed at cost in accordance with the limitations set forth in FAR 31.205-46 and the General Services Administration’s Federal Travel Regulations (FTR). Profit must not be applied to the travel costs. Local travel may be required for on-site meetings and it is not paid by the government. Voucher and receipts along with the written approval to travel must be attached to the monthly invoice to be reimbursed.Travel expenses of contractor personnel located in or near “place of performance” location are not reimbursable; for example, contractor personnel located in:Metro DC area will not be reimbursed for travel to New", "chunk_id": 36}, {"child_chunk": "of performance” location are not reimbursable; for example, contractor personnel located in:Metro DC area will not be reimbursed for travel to New Carrollton; or36Utah will not be reimbursed for travel to Ogden.12.0 GOVERNMENT FURNISHED PROPERTY (GFP) AND INFORMATION (GFI)Government furnished property (to include material, equipment, and/or information) shall be provided in the performance of this contract. Specific items and quantities shall be set forth in the Task Orders. The IRS will provide the following property:", "chunk_id": 36}, {"child_chunk": "ITEMS---QUANTITY---Contractor Identification Badge---TBD---Contractor Building Access/Proximity Card---TBD---Laptops with Local Area Network Access---TBD---Office Space (Desk, Chair, Standard Office Equipment)---TBD---Microsoft: Word, Excel, PowerPoint, Project Access---TBD---Telephone With VMS---TBD---Air cards---TBD---Government furnished information (to include manuals, notes, memos, instruction materials, and other information) may be provided during the performance of this agreement. Specific types and quantities shall be set forth in the Task Orders.Access to standards and guidelines and any other documentation that is required for the satisfactory performance of this requirement will be made available to the contractor no later", "chunk_id": 37}, {"child_chunk": "Task Orders.Access to standards and guidelines and any other documentation that is required for the satisfactory performance of this requirement will be made available to the contractor no later than five (5) business days after request.The issuance, handling, and disposition of GFP shall be conducted in accordance with FAR 52.245-1, Government Property, Alternate I, 52.245-9, Use and Charges and the requirements set forth in Section 11, Security Requirements. All GFP/GFI shall be returned to the Government upon contract completion, as appropriate.13.0 SECURITY REQUIREMENTS---In accordance with Title III of the E-Government Act of 2002 (Public Law 107-347), also known as the Federal Information Security Management Act of", "chunk_id": 37}, {"child_chunk": "Title III of the E-Government Act of 2002 (Public Law 107-347), also known as the Federal Information Security Management Act of 2002 (FISMA), which requires each federal agency to provide security for the information and information systems that support the37operations and assets of the agency and Internal Revenue Manual (IRM) 10.8.1, which provides overall security control guidance for the IRS, the contractor shall comply with the following IRS security clauses and provisions:", "chunk_id": 37}, {"child_chunk": "14. ATTACHMENTS---14.1 Quality Assurance Surveillance Plan---14.2 Security Documentation/Forms (Documents will be provided by COR Upon Award)---(1) Nondisclosure Agreement (NDA) Template (2) Contractor Separation Checklist (Form 14604 (Rev. 4-2015)) (3) SBU & Government Property/Equipment/Information Inventory List (4) Certification of Return - SBU & Government Property/Equipment/Information38", "chunk_id": 38}]