[{"chunk": "ADDENDUM TO STADARD FORM 1449---This addendum to the Standard Form (SF) 1449 provides for continuation of the schedule and description of supplies/equipment to be acquired.NOTICE---This is a Request for Quotation (RFQ) using GSA IT Schedule 70, Special Item Number(s):132 51 and 70 500. The offerors agree to and are bound by all instructions, procedures and rules of this RFQ.Solicitation Information Submission of Written Questions: In accordance with Section 11.4 of the RFQ, all questions regarding this RFQ shall be submitted in writing no later than 5:00 PM Eastern Time on August 12, 2019 via email to amber.jones@gsa.gov. The Government will provide an Amendment to the solicitation to respond to questions received by the designated due date/time.Proposal Due Date: Proposals are due on or before 5:00 PM Eastern Time on August 23, 2019 via eBuy.Note: After the closing time and date noted above the Government will begin immediate review and evaluation of the submissions; therefore, contractor submissions or information requests about this RFQ after the closing date and time will not be considered.REQUEST FOR QUOTATION (RFQ)Solicitation Number: ID11190022---HUD OCIO Application and Modernization---in support of:---Department of Housing and Urban Development (HUD)---Issued to: Contractors under the General Services Administration IT Schedule 70 Special Item Number(s): 132 51 and 70 500The Contractor’s Basic GSA Schedule contract is applicable to this Multiple-Award Blanket Purchase Agreement (BPA) resulting from the award under this RFQ", "chunk_id": 1, "page_no": 2}, {"chunk": "Conducted under Federal Acquisition Regulation (FAR) 8.4---Issued by:General Services Administration (GSA) National Capital Region (NCR) Federal Acquisition Service (FAS) Contracting Operations Division (COD)301 7th Street, S.W. Washington, D.C. 20407Date of RFQ Release: August 05, 2019---Project ID Number: ID11190022---Solicitation Number ID11190022 Page 1 of 53---Table of Contents Section 1 – Procedures---5 51.1 Summary---5 51.2 Authorized BPA Users---1.3 Ordering Procedures---6 61.4 Services---1.4.1 Base Period---6 71.4.2 First Option Period---1.4.3 Second Option Period---7 71.4.4 Third Option Period---1.4.5 Fourth Option Period---9 9 9 9 10 10 13 14 15 16 17 18 18 19 20 21Section 2 – Statement of Objectives (SOO)---2.1 Background---2.2 Scope---2.3 Objective---2.4 Tasks---2.4.1 Task 1 –Program Management---2.4.2 Task 2 – Technical Data Research---2.4.3 Task 3 – Design and Implementation---2.4.4 Task 4 – Data Pipeline and BI /BA Report/Analytics Development Lifecycle---2.4.5 Task 5 – Data Governance Services---2.4.6 Task 6 – System, Software, and Application Development---2.4.7 Task 7 – Training Support---2.4.8 Task 8 – Transition in Support---2.4.9 Task 9 – Transition out Support---Section 3 – Packaging and Marking---Section 4 – Inspection and Acceptance---21 214.1 Place of Inspection and Acceptance---4.2 Scope of Inspection---21 214.3 Basis of Acceptance---4.3.1 Acceptance of IT Development Requirements---22 234.4 Draft Deliverables---Section 5 – Deliveries or Performance---23 235.1 Period of Performance---5.2 Place of Performance---23 25", "chunk_id": 2, "page_no": 3}, {"chunk": "5.3 Milestone/ Deliverables---5.4 Public Release of Contract Documents Requirement---Solicitation Number ID11190022 Page 2 of 53---25 255.5 Deliverables Media---5.6 Place(s) of Delivery---26 275.7 Notice Regarding Late Delivery/ Problem Notification Report (PNR)---Section 6 – Contract Administration Data---27 276.1 Contracting Officer (CO)---6.2 Contracting Officer’s Representative (COR)---27 286.3 Technical Point of Contact (TPOC)---6.4 Contract Administration---28 296.5 Invoice Submission---6.5.1 Time-and-Material (T&M) CLINs (for LABOR)---30 306.5.2 Firm-Fixed-Price (FFP) CLINs---6.5.3 Order Level Material (OLM)---30 326.5.4 Travel---Section 7 – Special Contract Requirements---32 327.1 Key Personnel---7.1.1 Program Manager (PM)---33 337.1.2 Key Personnel Substitution---7.2 Government-Furnished Property (GFP)---33 337.3 Government-Furnished Information (GFI)---7.4 Security Requirements---33 34 37 37 37 38 38 39 397.4.1 Security Assessment and Authorization to Operate (ATO) Request---7.4.2 Federal Information Technology Security Services---7.4.3 Prevailing Terms and Conditions---7.5 Organizational Conflict of Interest and Non-Disclosure Requirements---7.5.1 Organizational Conflict of Interest (OCI)---7.5.2 Non-Disclosure Requirements---7.6 Section 508 Compliance Requirements---7.7 Commercial Supplier Agreements---7.8 Press/ News Release---39 407.9 Intellectual Property Rights---Section 8 – Contract Clauses---40 418.1 FAR 52.252-2 Clauses Incorporated by Reference (FEB 1998)---8.1.1 FAR Clauses Incorporated by Full Text---42 438.2 General Services Administration Acquisition Manual (GSAM) Clauses Incorporated by Reference---8.3 HUD Acquisition Regulation (HUDAR) Clauses Incorporated by Reference---44 44Section 9 – List of Attachments---9.1 List of Attachments---45 46Section 10 – Representations, Certifications, and Other Statements of Offerors or Respondents---", "chunk_id": 3, "page_no": 4}, {"chunk": "Section 11 – Instructions, Conditions, and Notices to Offerors---Solicitation Number ID11190022 Page 3 of 53---46 4611.1 FAR 52.252-1 Solicitation Provisions Incorporated by Reference (FEB 1998)---11.2 General Instructions---47 4711.3 General Information---11.3.1 Availability of Equipment and Software---47 4711.3.2 Contractor Support during Technical Evaluations---11.4 Submission of Questions---48 4811.5 Submission of Offers---11.6 Submission of the Written Price Quote (Part I)---50 5011.6.2 Price Assumptions---11.7 Submission of the Written Technical Quote (Part II)---50 5011.7.1 508 Compliance (Factor 1)---11.7.2 Key Personnel (Factor 2)---51 5111.7.3 Similar Experience (Factor 3)---11.8 Technical Assumptions---51 5211.9 Delivery Instructions---Section 12 – Evaluation Factors for Award---52 5212.1 Method of Award---12.2 Price Proposal Evaluation---53 5312.2.1 Organizational Conflict of Interest (OCI)---12.2.2 Price Assumptions---53 53 54 5512.2.3 Overtime and Extended Billing Hour Practices---12.3 Technical Evaluation Factors---12.3.1 Rating Methodology---12.4 Technical Assumptions---Solicitation Number ID11190022 Page 4 of 53---Section 1 – Procedures---1.1 Summary This acquisition is being issued as a Request for Quotes (RFQ) under the GSA Schedules Program. The government intends to award a Multiple Award BPA against GSA IT Schedule 70, in accordance with Federal Acquisition Regulation (FAR) 8.405-3(b)(1)(ii)(B)(2) competitive procedures for establishing BPAs. This is not a FAR Part 15 negotiated competition.All BPA Call Orders issued from this Multiple-Award BPA are subject to the following terms and conditions. In the event of an inconsistency between provisions of the BPA and any BPA Call Orders issued pursuant to this BPA, the provisions of this BPA will take precedence.The establishment of these BPAs creates no guarantee or obligation on the part of the Government to place any BPA Call Orders. The Government is obligated only to the extent of authorized purchases actually ordered under the BPA.Issuance of a BPA does not obligate any funds. Funds will be obligated upon award of BPA Call Orders. The contractor shall perform the efforts required by this BPA, as specified below.All interested GSA IT Schedule 70 SIN 132 51 and 70 500 holders are eligible to submit quotes.1.2 Authorized BPA Users The Contracting Officer (CO) designated for administering this BPA is noted in Section 6.1. The CO, in accordance with FAR 1.6, is the only person authorized to make or approve any changes in any of the terms and conditions of this BPA, and notwithstanding any clauses contained elsewhere in the contract, the said authority remains solely with the CO. In the event the Contractor makes any changes at the direction of any person other than the CO, the change will be considered to have been made without authority and no adjustment will be made in the BPA/ BPA Call Order price to cover any increase in cost incurred as a result thereof.1.3 Ordering Procedures In accordance with FAR 8.405-3(c), the following procedures shall apply to the award of a BPA Call Order. All work required under this BPA shall be authorized through execution of a BPA Call Order, signed by the Contractor and CO. A BPA Call Order may be awarded at any time within the BPA period of performance (PoP).When the Government elects to fill a requirement, the CO shall provide a BPA Call Order request to the Contractor for which a response is being solicited.Within the time allowed for proposals preparation (time allowed for proposal preparation and submission will vary depending on the BPA Call Order and will be designated in each BPA Call Order). The Contractor shall submit their proposal in response to a BPA Call Order, which shall include, but not necessarily limited to the following information:1. Statement that the Contractor has a clear understanding of the task requirement;", "chunk_id": 4, "page_no": 6}, {"chunk": "Solicitation Number ID11190022 Page 5 of 53---2. Statement of technical and managerial resources and expertise the Contractor can provideto satisfy the requirement;3. A schedule of performance identifying major milestones, deliverables and delivery date,and task completion; and---4. A price schedule necessary to complete the work.The Government will evaluate the proposal and conduct negotiations as necessary. A BPA Call Order will be awarded once the proposal is determined to be acceptable by the Government based on the technical and price factors specified in the BPA Call Order request.1.4 Services The contractor shall perform one or more of the following services, required under the anticipated BPA and subsequent BPA Call Orders.Note: Orders will not be issued for any tasks that are currently being administered under the Centers of Excellence (CoE).1.4.1 Base Period---Description---Program Management (Task 1) Technical Data Research (Task 2) Design and Implementation (Task 3) Data Pipeline and BI /BA Report/Analytics Development Lifecycle (Task 4) Data Governance Services (Task 5) System, Software, and Application Development (Task 6) Training Support (Task 7) Transition In Support (Task 8) Transition Out Support (Task 9) Order Level Materials (OLMs) Long-Distance TravelSolicitation Number ID11190022 Page 6 of 53---1.4.2 First Option Period---Description---Program Management (Task 1) Technical Data Research (Task 2) Design and Implementation (Task 3) Data Pipeline and BI /BA Report/Analytics Development Lifecycle (Task 4) Data Governance Services (Task 5) System, Software, and Application Development (Task 6) Training Support (Task 7) Transition In Support (Task 8) Transition Out Support (Task 9) Order Level Materials (OLMs) Long-Distance Travel", "chunk_id": 5, "page_no": 8}, {"chunk": "1.4.3 Second Option Period---Description---Program Management (Task 1) Technical Data Research (Task 2) Design and Implementation (Task 3) Data Pipeline and BI /BA Report/Analytics Development Lifecycle (Task 4) Data Governance Services (Task 5) System, Software, and Application Development (Task 6) Training Support (Task 7) Transition In Support (Task 8) Transition Out Support (Task 9) Order Level Materials (OLMs) Long-Distance Travel1.4.4 Third Option Period---Description---Program Management (Task 1) Technical Data Research (Task 2) Design and Implementation (Task 3) Data Pipeline and BI /BA Report/Analytics Development Lifecycle (Task 4) Data Governance Services (Task 5) System, Software, and Application Development (Task 6) Training Support (Task 7) Transition In Support (Task 8) Transition Out Support (Task 9) Order Level Materials (OLMs) Long-Distance Travel1.4.5 Fourth Option Period---Solicitation Number ID11190022 Page 7 of 53---Description---Program Management (Task 1) Technical Data Research (Task 2) Design and Implementation (Task 3) Data Pipeline and BI /BA Report/Analytics Development Lifecycle (Task 4) Data Governance Services (Task 5) System, Software, and Application Development (Task 6) Training Support (Task 7) Transition In Support (Task 8) Transition Out Support (Task 9) Order Level Materials (OLMs) Long-Distance TravelSolicitation Number ID11190022 Page 8 of 53---Section 2 – Statement of Objectives (SOO)---2.1 Background Recent reviews of the IT Portfolio at HUD have illustrated the need for a consistent capability to procure cost effective and scalable enterprise solutions. Proliferation of various technologies and contracting models have, over time, produced inconsistent development methodologies, performance results, knowledge transfer, and complicates IT management goals. HUD currently has numerous individual development contracts that are tied to a specific business need instead of an enterprise demand. Furthermore, the various procurement lead times and contracting vehicles have become obstacles in adapting systems to changing business requirements. The Chief Technology Officer (CTO) recent technology assessment has noted reduced agility and lack of consistent integration that resulted from the varied terms and conditions across multiple development contracts.2.2 Scope The Contractor shall provide the expertise, technical knowledge, staff support, and other related resources necessary to accomplish the tasks and deliverable described in this SOO.Services may include the following task areas:1. Project Management; 2. Technical Data Research; 3. Design and Implementation; 4. Data Pipeline and BI/BA Report/Analytics Development Lifecycle ; 5. Data Governance; 6. Systems, Software, and Application Development; and 7. Training Support.2.3 Objective HUD’s objectives are to obtain IT support services to include:1. Implementation of a performance-based managed services contract that providesinnovation and best practices in the timely and efficient delivery of IT services;", "chunk_id": 6, "page_no": 10}, {"chunk": "2. Delivery of systems/software/application that complies with Federal and Agency---regulations and security standards;---3. Supporting of a highly mobile workforce and remote sites through real-time applicationsand team collaboration tools; and---4. Development of tactical support and strategic support (development, modernization, and enhancement) that achieves operational steady state and cost efficiencies while positioning stakeholders and their respective business partners to fulfill their missions.Solicitation Number ID11190022 Page 9 of 53---2.4 Tasks All tasks and subtasks under this section are not Inherently Governmental Functions as defined in FAR 7.5 and shall not be construed as such.2.4.1 Task 1 –Program Management The contractor shall provide the following Program Management support services, upon the issuance of a BPA Call Order request.Program Management tasks shall include:The management and oversight of all activities performed by contractor personnel, including subcontractors, to satisfy the requirements identified in this BPA and resulting BPA Call Orders. The contractor shall identify a Program Manager (PM) by name, who shall serve as the primary interface and point of contact (POC) with the Government program authorities and representatives on technical program/project issues. The contractor shall provide management, direction, administration, quality assurance (QA).The contractor shall facilitate Government and contractor communications and all activities necessary to ensure the accomplishment of timely and effective support, performed in accordance with this BPA and subsequent BPA Call Orders.The contractor shall use industry and academia best-standards and proven methodologies to assure all activities are identified, documented, and tracked. The project will continuously be evaluated and monitored for timely and quality service. The contractor shall notify the CO and the Contracting Officer’s Representative (COR), in writing of any technical, financial, personnel, or general managerial problems encountered throughout this BPA. The Project Manager shall be knowledgeable of the project management lifecycle and conduct project management activities as identified in the Project Management Institute (PMI) Project Management Body of Knowledge (PMBOK) in support of any project.2.4.1.1 Subtask 1 – Project Kick-off Meeting The contractor shall schedule, coordinate and host a Project Kick-off Meeting no later than (NLT) ten workdays after the BPA Call Order award for PM Support, at the location approved by the Government. The meeting shall provide the opportunity to discuss technical, management, and logistic issues; travel authorization; and reporting procedures. At a minimum, the attendees shall include key contractor personnel, key Government representatives, CO, COR, and Technical Point of Contact (TPOC). The contractor shall provide a Project Kick-Off Meeting Agenda NLT five workdays after the BPA Call Order award for PM Support. The agenda shall include the following:a) Introduction of personnel b) Overview of project tasks c) Overview of organization (complexity) d) Schedule e) Performance metrics f) Discussion of draft Program Management Plan (PMP)", "chunk_id": 7, "page_no": 11}, {"chunk": "Solicitation Number ID11190022 Page 10 of 53---g) Travel notification and processes h) Government-furnished information (GFI) i) Security requirements (Building access, badges, Common Access Cards [CAC] j) Invoice procedures k) Reporting Requirements, e.g. Quarterly Status Report l) POCs to include name, phone, email and role m) Roles and Responsibilities n) Overview of incoming Transition Plan to include process and timeframes o) Prioritization of contractor activities p) Any initial deliverables q) Other logistic issues r) Draft Quality Control Plan (QCP) s) Sensitivity and protection of information t) Additional issues of concern (Leave/back-up support)2.4.1.2 Subtask 2 – Quarterly Status Report The PM shall develop and deliver a Quarterly Status Report using Microsoft (MS) Office Suite. All BPA holders shall submit a Quarterly Status Report consisting of high level and detailed information for each awarded BPA Call Order. The reports will be used to assess contractor performance and program success, and to collect information, best practices, and lessons learned. The BPA holders shall electronically update and submit the quarterly status report in ITSS at https://portal.fas.gsa.gov. Reports are to be submitted no later than (15) workdays after the end of each calendar year quarter. BPA holders with no BPA Call Orders awarded during the quarter are NOT required to submit a Quarterly Status Report unless there are changes to a previously submitted report. The status reports shall be cumulative, beginning from the time of BPA establishment.The contractor shall provide at a minimum the following information:a) Activities during the reporting period, by task to include: A brief description of thetask, on-going activities, new activities, activities completed, deliverables submitted for that period; and progress to date on all above mentioned activities.b) Problems and corrective actions taken. Also include issues and/or concerns andproposed resolutions to address them to include risk mitigation plans.c) Government actions required. d) Schedule (shows major tasks, milestones, and deliverables; planned and actual start", "chunk_id": 8, "page_no": 12}, {"chunk": "and completion dates for each).---e) Summary of trips taken, conferences attended, etc. (attach trip reports to for reportingperiod).---2.4.1.3 Subtask 3 – Project Management Plan (PMP) The contractor shall develop and deliver a draft PMP at the Project Kick-off Meeting, based on the contractor’s proposed solution outlining the proposed management approach, the tasks and deliverables necessary to meet the BPA objectives to include: milestones, tasks, and subtasks required in this BPA. The contractor shall present and brief the draft PMP at the Kick-off meeting. The contractor shall document all support requirements in the PMP. Following the Kick-off meeting, the contractor shall revise the PMP to incorporate Government comments.Solicitation Number ID11190022 Page 11 of 53---All HUD IT projects, including all information systems acquired, developed, enhanced, or maintained shall follow the policy, procedures, standards, and guidelines set forth within the IT Management Framework using the Project Planning and Management (PPM) Life Cycle located at HUD’s PPM Life Cycle Website: http://portal.hud.gov/hudportal/HUD?src=/program_offices/cio/ppm/PPMV20HOMEThe PMP shall contain, at a minimum, the following for each task:a) Describe the proposed management approach. b) Include milestones, tasks, and subtasks required. c) Describe in detail the contractor’s approach to risk management. d) Describe in detail the contractor’s approach to communications including processes,", "chunk_id": 9, "page_no": 13}, {"chunk": "procedures, and other rules of engagement between the contractor and the Government.---e) Describe the contractor’s approach to identifying and implementing cost savings and increased efficiencies for engagement delivery, including areas such as coordinating support logistics across multiple engagements, seeking lower-cost high performing vendors, and other best-value decision-making.f) Include the contractor’s Draft QMP. g) General operating procedures for:1. Travel 2. Work hours 3. Leave 4. Deliverables 5. Staff training policies 6. Problem/issue resolution proceduresThe contractor shall provide final PMP NLT 30 calendar days after receipt of government comments. Changes to the final PMP may be made with mutual consent of the contractor and the Government.2.4.1.4 Subtask 4 – PMP Updates The PMP is an evolutionary document that shall be updated bi-annually (twice per year) at a minimum. When updates are made the contractor shall provide the TPOC a copy for review. The contractor shall work from the latest Government-approved version of the PMP. Deliverable associated with this task includes:2.4.1.5 Subtask 5 – Quality Control Plan (QCP) The Contractor shall develop, maintain, enforce and document a Quality Control Plan (QCP). The contractor shall employ realistic and substantial methods and monitoring techniques for improving the overall quality of this BPA and resulting BPA Call Orders. Within the QCP, the contractor shall identify its approach for providing quality control in meeting the requirements of the contract.Specifically, the contractor shall describe:", "chunk_id": 10, "page_no": 13}, {"chunk": "Solicitation Number ID11190022 Page 12 of 53---a) Quality control methodology for accomplishing the performance expectations andobjectives;---b) Processes and procedures that provides high quality performance for each Task Area; c) Approach to planning, organizing, and managing internal resources, includingsubcontractors to include lines of authority;d) Methodology to identify and resolve issues and problems, including escalationprocedures;---e) Rationale for tracking and reporting progress and costs and integrating the requirementsof the contract; and---f) Approach to ensure cost, performance and schedule objectives adhere to task planning.The contractor shall provide the Government with a draft QCP NLT 5 workdays after the BPA Call Order award for PM Support on which the Government will make comments. The contractor shall update the draft QCP in accordance with the CO, COR, and TPOC’s comments and provide a final QCP ten workdays after receipt of Government comments.2.4.1.6 Subtask 6 – Travel Request and Trip Reports---The contractor shall issue a Travel Request (TR) for each individual participant. All TR’s shall be annotated to clearly detail the purpose of the trip and the provisions available during the trip. All TR’s shall be reviewed and approved by the TPOC prior to participant travel.The contractor shall submit Trip Reports to the TPOC, NLT five business days after completion of a trip for all long distance travel.The Trip Report shall include the following information:a. Name(s) and title(s) of personnel who traveled. b. Dates of travel. c. Destination(s). d. Purpose of trip. e. Cost of the trip. f. Approval authority. g. Summary of events.The contractor shall keep a summary of all long-distance travel including, but not limited to, the name of the employee, location of travel, duration of trip, and Point of Contact (POC) at travel location. Trip reports shall also contain Government approval authority, total cost of the trip, a detailed description of the purpose of the trip, and any knowledge gained.2.4.2 Task 2 – Technical Data Research The Contractor shall provide technical research services:1. Gathering and documenting requirements or user stories;", "chunk_id": 11, "page_no": 14}, {"chunk": "Solicitation Number ID11190022 Page 13 of 53---2. Researching and recommending modern data science technologies to support Data Lakearchitecture including artificial intelligent and machine learning;3. Researching and proposing any improvement to HUD big data environment/networkinfrastructure;---4. Researching and proposing improvements to HUD big data framework/tool;5. Researching and proposing any improvement to BI/BA environment/networkinfrastructure;---6. Researching and proposing any improvement to BI/BA framework/tool;7. Recommending data processing improvements to ETL scripts, SQL scripts, batchscripts, shell scripts, etc.;---8. Researching and proposing any security improvement to protect HUD data;9. Implementing prototype or proof of concept as necessary; and10. Reviewing other proposed architecture and provide recommendations.2.4.3 Task 3 – Design and Implementation Design and implementation services includes gathering, documenting, producing, and tracking information required to support HUD program offices on system architecture to be designed, developed, and implemented. Design development and implementation services shall be accompanied by Prototype Source Codes based on business requirements specified at the BPA Call Order Level. Final working software prototypes shall be operational and functional according to specifications provided by the specific BPA Call Order.Design and implementation services may include:1. Implementing prototype or proof of concept for HUD’s system environment. Prototypes or proof of concepts shall be interoperable with other HUD systems and shall result in no system degradations;2. Building and extending data model for Enterprise Data Warehouse to accommodate eachprogram office needs that shall follow HUD’s Data Governance Board;3. Designing and building an enterprise data model for HUD;4. Designing and configuring BI platforms (e.g.: SAS, SAP, Microstrategy, Tableau, Power", "chunk_id": 12, "page_no": 15}, {"chunk": "BI, etc.);---5. Configuring, managing, controlling, utilizing, and administering big data tools (e.g.:Talend, Azure HDI, Azure Blob, Erwin, SQL, Postgres, MongoDB, Blob, etc.) to supportSolicitation Number ID11190022 Page 14 of 53---data governance, master data management, metadata management, data glossary, data dictionary, etc.;---6. Designing DataMart according to business needs;7. Automating unit and integration testing that shall detect errors or bugs;8. Proposing performance benchmarks and recommending appropriate scaling and tuning;9. Designing and implementing access control and logging in Data Lake and throughoutdata pipeline; and/or---10. Implementing systems that may use one or many of the following programing languages: R, Python, SAS, MatLab, SQL, Pig, Spark, Hive, Hadoop, Java, C/C++, Ruby, Perl., etc..2.4.4 Task 4 – Data Pipeline and BI /BA Report/Analytics Development Lifecycle Data pipeline and BI/BA report/analytics development lifecycle tasks may include gathering and documenting requirements or user stories and performing one or many of the following services using various tools (e.g.: SAS, SAP, Microstrategy, Tableau, Power BI, etc.):a. Designing and developing ETLs to onboard data sources to Data Lake,transforming and saving it to corresponding data model in Enterprise Data Warehouse (EDW), and loading it into Datamart for applications or BI/BA consumption;b. Performing data integration including extracting, transforming, cleansing,standardizing, and modeling according to HUD’s data governance board policies and guidance;c. Designing and developing data processing from ingest, extract, transform, load,validate, analyze, and publish data from the sources to the consumption applications or tools;d. Updating master data management, metadata management, glossary, and catalog;e. Utilizing and mapping data to established data standards (MISMO, NIEM, Grant,", "chunk_id": 13, "page_no": 16}, {"chunk": "etc.);---f. Designing semantic search, lineage and relationships for intelligent data---discovery;---g. Implementing data quality and integrity policy, process, and procedure as part ofenterprise data management effort;---h. Designing and developing data models to support software applicationdevelopments;---Solicitation Number ID11190022 Page 15 of 53---i. Designing and developing generic or summary dashboard;j. Designing and developing ad-hoc and dynamic reporting capabilities;k. Designing and developing statistical analysis and modeling;l. Designing and developing other analytics capabilities;m. Reviewing software designs and providing recommendations;n. Automating unit testing, integration testing, regression testing, stress testing, load---testing, etc.;o. Automating software deployment package;---p. Providing software performance improvements; and/orq. Providing SQL programing, database relationship, and data analysis includingbusiness knowledge discovery, data mining, predictive modeling, and prescriptive analytics.---2.4.5 Task 5 – Data Governance Services Data Governance tasks may include the following:1. Producing and reviewing data quality and compliance scorecards;2. Producing and reviewing data volume, performance, and availability reports;3. Standardizing data domains, data structures, and data models; and4. Providing data governance approach for:a. Metadata Management b. Master Data Management c. Data Quality d. Data Stewardship e. Escalation and Approval process2.4.6 Task 6 – System, Software, and Application Development The Contractor shall provide systems, software, and application development services that incorporate cyber security implementation. Development services shall be designed as specified by specific BPA Call Orders.Development services may include:", "chunk_id": 14, "page_no": 17}, {"chunk": "Solicitation Number ID11190022 Page 16 of 53---1. Web application development;---2. Mobile responsive website development;---3. Mobile native app development;---4. Innovation Lab or Proof of Concept;---5. Enterprise services and utilities Development;---6. Application migration and decommission; and---7. Government Off-the-Shelf (GOTS)/Commercial Off-the-Shelf (COTS)---configuration and customization.---2.4.6.1 Subtask One – Technical Research and Prototype The Contractor shall provide technical research and prototype services for all hardware and software solutions. These services shall include gathering and writing requirements, user stories, and epics based on business requirements and producing technical research documents and working prototypes.2.4.6.2 Subtask Two – Systems Development Services Systems development tasks include:---a. Developing custom software or applications with highly configurable modulesthat can be reused by similar business functions across HUD program offices. The Contractor shall leverage HUD Enterprise Components when designing and building new systems. Those components may include, but are not limited to:Enterprise Service Bus (Mulesoft) • Enterprise Document/Record Management (Alfresco) • Enterprise Workflow (Alfresco Activiti and Redhat BRMS) • Enterprise Intake Service (Java/Ephesoft) • Identify Credential Access Management (ForgeRock) • Enterprise databases like MS SQL, PostgreSQL, MongoDBb. Developing, integrating, and testing applications using Continuous Integration / Continuous Delivery (CI/CD) pipelines (JIRA, Chef, Jenkins, GitLab, etc.);c. Working with open source technologies (Java, JQuery, JSon, Python, etc.) and", "chunk_id": 15, "page_no": 18}, {"chunk": ".NET technologies;---d. Customizing and configuring COTS products like Salesforce, MS Dynamic,entellitrak, Pegga Systems, ServiceNow, etc.;---e. Developing mobile native apps (Android, iOS, Windows) and responsive webapps; and---Solicitation Number ID11190022 Page 17 of 53---f. Performing the flowing activities as applicable to development areas:Research and recommendation • Prototype and mockup • Graphic and UX design • Solution/System architecture and design • Database Design • Code Development • System Integration • Consumption of enterprise services and utilities • Automation of unit testing, integration testing, regression testing, stresstesting, load testing, etc. • Migration and transition • Performance tuning • Automate deployment package to applicable environments • Social networking capabilities (e.g., Facebook, Twitter, Google, RSS, etc.)2.4.7 Task 7 – Training Support Based on the size and/or complexity of the BPA Call Order(s), new or updated end-user training and technical training may be required. The Contractor shall provide the following training support services: virtual training, recorded videos, or in-person training. Frequency and detail will be detailed at the BPA Call Order level.2.4.8 Task 8 – Transition in Support The Contractor shall provide Transition-In services upon BPA Call order request. As a successor, the Contractor shall have sufficient personnel on board during the Transition-In period to ensure a smooth transition with the incumbent Contractor. The Contractor shall provide an orderly transition of work acceptance and accomplishment such that any impact to the program is minimized. During the Transition-In period, the Contractor shall become familiar with the requirements in order to commence full performance of services by the end of the BPA Call Order Transition-In period. Transition-In is not required if the successor Contractor is the incumbent Contractor.The contractor shall provide a draft Transition-In Plan NLT ten workdays after BPA Call Order award. The contractor shall provide a final Transition-In Plan NLT five workdays after receipt of the COR and TPOC’ss comments.", "chunk_id": 16, "page_no": 19}, {"chunk": "2.4.9 Task 9 – Transition out Support---To minimize any decrease in productivity and to prevent possible negative impacts on additional services, the contractor shall provide transition-out support when required by the Government. The contractor shall develop and implement its Transition-Out Plan at the end of each Development and Maintenance phase, to be identified at the BPA Call Order level. The Transition-Out Plan shall facilitate the accomplishment of a seamless transition from the incumbent to incoming contractor/Government personnel at the expiration of the contract.Solicitation Number ID11190022 Page 18 of 53---In the Transition-Out Plan, the contractor shall identify how it will coordinate with the incoming contractor and/or Government personnel to transfer knowledge regarding the following:a. Project management processes. b. Points of contact. c. Location of technical and project management documentation/deliverables. d. Status of ongoing technical initiatives. e. Appropriate contractor to contractor coordination to ensure a seamless transition. f. Schedules and milestones. g. Actions required of the Government. h. Coordination of IT related programs.Solicitation Number ID11190022 Page 19 of 53---Section 3 – Packaging and Marking---This page intentionally left blank.Solicitation Number ID11190022 Page 20 of 53---Section 4 – Inspection and Acceptance---Note: Additional specifications maybe identified at the BPA Call Order level.4.1 Place of Inspection and Acceptance Inspection and acceptance of all work performance, reports, and other deliverables under the resulting BPA Call Orders will be performed virtually or on site at HUD Headquarters located at 451 7th Street S.W., Washington DC, by the TPOC.", "chunk_id": 17, "page_no": 22}, {"chunk": "4.2 Scope of Inspection---All deliverables will be inspected for content, completeness, accuracy, and conformance to the requirements by the COR and the TPOC. Inspection may include validation of information through the use of automated tools, testing, or inspections of the deliverables, as specified in the contract. The scope and nature of this inspection will be sufficiently comprehensive to ensure the completeness, quality, and adequacy of all deliverables.The Government requires a period NTE 15 workdays after receipt of final deliverable items for inspection and acceptance or rejection.4.3 Basis of Acceptance---The basis for acceptance shall be in compliance with the requirements set forth in the relevant terms and conditions of this BPA and subsequent BPA Call Orders. Deliverable items rejected shall be corrected in accordance with the applicable clauses.The final acceptance will occur when all discrepancies, errors, or other deficiencies identified in writing by the Government have been resolved, through documentation updates, program correction, or other mutually agreeable methods.Reports, documents, and narrative-type deliverables will be accepted when all discrepancies, errors, or other deficiencies identified in writing by the Government have been corrected.If the draft deliverable is adequate, the Government may accept the draft and provide comments for incorporation into the final version.All of the Government’s comments on deliverables shall either be incorporated in the succeeding version of the deliverable, or the contractor shall explain to the Government’s satisfaction why such comments should not be incorporated.If the Government finds that a draft or final deliverable contains spelling errors, grammatical errors, or improper format, or otherwise does not conform to the quality assurance requirements stated within this contract, the document may be rejected without further review and returned to the contractor for correction and resubmission. If the contractor requires additional Government guidance to produce an acceptable draft, the contractor shall arrange a meeting with the COR.", "chunk_id": 18, "page_no": 22}, {"chunk": "Solicitation Number ID11190022 Page 21 of 53---4.3.1 Acceptance of IT Development Requirements---For IT development, the final acceptance will occur when all discrepancies, errors, or other deficiencies identified in writing by the Government have been resolved, through documentation updates, program correction, or other mutually agreeable methods.4.4 Draft Deliverables---The Government will provide written acceptance, comments, and/or change requests, if any, within 15 workdays (unless specified otherwise in Section 5 – Deliveries or Performance) from Government receipt of the draft deliverable. Upon receipt of the Government comments, the contractor shall have ten workdays to incorporate the Government’s comments and/or change requests and to resubmit the deliverable in its final form.Solicitation Number ID11190022 Page 22 of 53---Section 5 – Deliveries or Performance---5.1 Period of Performance The anticipated period of performance for this BPA is as follows: Base Period: September 30, 2019 – September 29 2020 Option Period 1: September 30, 2020 – September 29, 2021 Option Period 2: September 30, 2021 – September 29, 2022 Option Period 3: September 30, 2022 – September 29, 2023 Option Period 4: September 30, 2023 – September 29, 20245.2 Place of Performance---The primary place of performance will be at the contractor’s facility. However, performance may be required at the Government’s facility (451 7th Street S.W., Washington DC) for some BPA Call Orders and a PIV will be required. Additional security requirements will be provided at the BPA Call Order level.The actual performance location will be identified in the individual BPA Call Order level.", "chunk_id": 19, "page_no": 24}, {"chunk": "5.3 Milestone/ Deliverables---Deliverables will be established and defined at the BPA Call Order level. Deliverables will be used by the CO, COR and TPOC to monitor timely progress under subsequent BPA Call Orders.Deliverables are due the next Government workday if the due date falls on a holiday or weekend.Deliverable products shall be flexible, scalable, deployable, and consumable to applicable HUD on-premise environment and/or HUD Azure Cloud environment. Deliverables shall also be compliant with HUD architecture and technology profiles.The contractor shall deliver the deliverables listed in the following table via email to the CO, COR, TPOC, and the Assist System (https://portal.fas.gsa.gov/).The contractor shall mark all deliverables listed in the above table to indicate authorship by contractor (i.e., non-Government) personnel; provided, however, that no deliverable shall contain any proprietary markings inconsistent with the Government's data rights set forth in this contract. The Government reserves the right to treat non-conforming markings in accordance with FAR 52.227-14.5.4 Public Release of Contract Documents Requirement---The contractor agrees to submit, within ten workdays from the date of the GSA CO’s execution of the BPA, or any modification to the BPA (exclusive of Saturdays, Sundays, and Federal holidays), a portable document format (PDF) file of the fully executed document with all proposed necessary redactions, including redactions of any trade secrets or any commercial or financial information that it believes to be privileged or confidential business information, for the purpose of public disclosure at the sole discretion of GSA. The contractor agrees to provide a", "chunk_id": 20, "page_no": 24}, {"chunk": "Solicitation Number ID11190022 Page 23 of 53---detailed written statement specifying the basis for each of its proposed redactions, including the applicable exemption under the Freedom of Information Act (FOIA), 5 United States Code (U.S.C.) § 552, and, in the case of FOIA Exemption 4, 5 U.S.C. § 552(b)(4), shall explain why the information is considered to be a trade secret or commercial or financial information that is privileged or confidential. Information provided by the contractor in response to the BPA requirement may itself be subject to disclosure under the FOIA. Submission of the proposed redactions constitutes concurrence of release under FOIA.The CO will carefully consider the contractor’s proposed redactions and associated grounds for nondisclosure prior to making a final determination as to what information in such executed documents may be properly withheld.5.5 Deliverables Media---The contractor shall deliver all electronic versions by electronic mail (email) and removable electronic media, as well as placing in the HUD OCIO designated repository. The following are the required electronic formats, whose versions must be compatible with the latest, commonly available version on the market.a. Text:---Microsoft (MS) Word, Google Docs, Portable Document Format (PDF)---b. Spreadsheets: MS Excel, Google Sheets c. Briefings: d. Drawings: e. Schedules:---MS PowerPoint, Google Slides MS Visio, Google Drawings MS Project, Smartsheets---", "chunk_id": 21, "page_no": 25}, {"chunk": "5.6 Place(s) of Delivery---All unclassified deliverables or correspondence shall be submitted electronically to the following website location: https://portal.fas.gsa.gov/Copies of all deliverables shall also be delivered electronically to the CO, COR, and TPOC.5.7 Notice Regarding Late Delivery/ Problem Notification Report (PNR)---The contractor shall notify the COR, CO, and TPOC via a PNR, Attachment D as soon as it becomes apparent to the contractor that a scheduled delivery will be late. The contractor shall include in the PNR the rationale for late delivery, the expected date for the delivery, and the project impact of the late delivery. The COR will review the new schedule and provide guidance to the contractor. Such notification in no way limits any Government contractual rights or remedies including, but not limited to, termination.Solicitation Number ID11190022 Page 24 of 53---Section 6 – Contract Administration Data---6.1 Contracting Officer (CO)---1. The CO is the only individual who can legally commit the Government to the expenditureof public funds. No person other than the CO can make any changes to the terms, conditions, general provisions, or other stipulations of this contract.2. The CO is the only person with the authority to act as agent of the Government under thiscontract. Only the CO has authority to:a. Direct or negotiate any changes in the PWS ; b. Modify or extend the period of performance; c. Change the delivery schedule; d. Authorize reimburse to the Contractor of any costs incurred during the", "chunk_id": 22, "page_no": 26}, {"chunk": "performance of this contract; and---e. Otherwise change any terms and conditions of this contract.---3. No information other than that which may be contained in an authorized modification to this contract, duly issued by the CO, which may be received from any person employed by the US Government, other otherwise, shall be considered grounds for deviation from any stipulation of this contract.4. The Government may unilaterally change its CO designation, after which it will notify Contractor in writing of such change. The CO will appoint a COR in writing through a COR Appointment Letter that will be provided to the contractor upon award.6.2 Contracting Officer’s Representative (COR) The CO will appoint a COR in writing through a COR Appointment Letter that will be provided to the contractor upon BPA award. The COR will receive, for the Government, all work called for by the BPA and will represent the CO in the technical aspects of the contract. The COR will assist in resolving any technical issues that arise during performance. The COR will provide no supervisory or instructional assistance to contractor personnel.The COR is not authorized to change any of the terms and conditions, the PWS, schedule, or price of the contract. Any changes to the BPA will be made only by the CO by properly executed modifications to the contract.6.3 Technical Point of Contact (TPOC) The CO will appoint a TPOC in writing through a TPOC Appointment Letter that will be provided to the contractor upon BPA award. The TPOC, in coordination with the COR will monitor the Contractor’s performance to ensure that all of the technical requirements under the BPA are met by the delivery date or within the period of performance, and at the price or within the ceiling stipulated by each BPA Call Order.", "chunk_id": 23, "page_no": 26}, {"chunk": "6.4 Contract Administration Contracting Officer:---Solicitation Number ID11190022 Page 25 of 53---Oke Obi GSA FAS AAS 301 7th Street SW Washington DC, 20407 Email: Oke.Obi@gsa.govContract Specialist:---Amber Jones GSA FAS AAS 301 7th Street SW Washington DC, 20407 Email: Amber.Jones@gsa.govContracting Officer’s Representative:---Chris Kuzmitsky GSA FAS AAS 301 7th Street SW Washington DC, 20407 Email: christopher.kuzmitsky@gsa.govTechnical Point of Contact:---To be provided after award.6.5 Invoice Submission---For BPA Call Orders the Contractor shall submit Requests for Payments in accordance with the guidance outlined below to be considered proper for payment.In addition, the data elements indicated below shall be included on each invoice:Contract Number: (from SF 1449, Block 4) Paying Number: (ACT/DAC NO.) (From SF 1449, Block 1) NCR Project No.: ID11190022 Project Title: HUD OCIO Application ModernizationThe contractor shall certify with a signed and dated statement that the invoice is correct and proper for payment.The contractor shall submit invoices as follows:All invoicing must be prepared and submitted electronically to the following GSA website: Portal.fas.gsa.gov. Additionally, reports, deliverables, and invoices must be submitted electronically by the Contractor to IT Solutions Shop (ITSS) for client review/acceptance. All invoices must include the BPA Number, Project Number, and the GSA ACT# for properSolicitation Number ID11190022 Page 26 of 53---identification. Failure to include this information may result in the Contractor having to resubmit the invoice and delaying payment.For all invoices, the contractor shall provide invoice backup data, including labor categories, rates and quantity of labor hours (when applicable). Invoices shall be sent to: Portal.fas.gsa.gov and www.finance.gsa.gov.In order to be considered for award, all vendors must be registered in the IT Solutions System. Any contractor that is not registered at the time of award shall not be considered for award. Contractors can register at:", "chunk_id": 24, "page_no": 28}, {"chunk": "https://web.itss.gsa.gov/itss/v41_helpdocs.nsf/HomeTellMeRegAbout/About+Contractor+Regist ration?OpenDocument---NOTE: FAILURE TO SUBMIT THE INVOICE IN ITSS WILL RESULT IN REJECTION OF THE INVOICE. If there are any issues submitting an invoice, contact the Assisted Acquisition Services Business Systems (AASBS) Help Desk for support at 877-472-4877 (toll free) or by email at AASBS.helpdesk@gsa.gov.The final invoice is desired to be submitted within six months of project completion. The contractor shall provide the Government with a monthly status on when the final invoice will be submitted to the Government.6.5.1 Time-and-Material (T&M) CLINs (for LABOR)---The contractor shall invoice monthly on the basis of hours incurred for the T&M CLINs. The invoice shall include the period of performance covered by the invoice (all current charges shall be within the active period of performance) and the CLIN number and title. All hours and costs shall be reported by CLIN element (as shown in Section 1), by contractor employee, and shall be provided for the current billing month and in total from project inception to date. The contractor shall provide the invoice data in spreadsheet form with the following detailed information. The listing shall include separate columns and totals for the current invoice period and the project to date.a. Employee name (current and past employees) b. Employee company c. Employee labor category d. Monthly and total cumulative hours worked e. Corresponding proposed ceiling rate f. Hours incurred not billed by CLIN g. Total Amount Paid (Lump Sum) by CLIN", "chunk_id": 25, "page_no": 28}, {"chunk": "6.5.2 Firm-Fixed-Price (FFP) CLINs---The contractor may invoice for the FFP CLINs. The invoice shall include the period of performance covered by the invoice (all current charges shall be within the active period of performance) and the CLIN number and title. All prices shall be reported by CLIN element (asSolicitation Number ID11190022 Page 27 of 53---shown in Section 1) and shall be provided for the current invoice and in total from project inception to date. The contractor shall provide the invoice data in spreadsheet form with the following detailed information. The listing shall include separate columns and totals for the current invoice period and the project to date.a. FFP period of performance b. Total Amount Paid (Lump Sum) by CLIN6.5.3 Order Level Material (OLM)---Order-Level Materials (OLMs) are supplies and/or services acquired in direct support of an individual task or delivery order placed against a Federal Supply Schedule (FSS) contract or FSS blanket purchase agreement (BPA). OLMs are not defined, priced, or awarded at the FSS contract level. They are unknown before a task or delivery order is placed against the FSS contract or FSS BPA. OLMs are only authorized for inclusion at the order level under a Time- and-Materials (T&M) or Labor-Hour (LH) Contract Line Item Number (CLIN) and are subject to a Not To Exceed (NTE) ceiling price. OLMs include direct materials, subcontracts for supplies and incidental services for which there is not a labor category specified in the FSS contract, other direct costs (separate from those under ODC SINs), and indirect costs. OLMs are purchased under the authority of the FSS Program and are not \"open market items.\"Items awarded under ancillary supplies/services or other direct cost (ODC) SINs are not OLMs. These items are defined, priced, and awarded at the FSS contract level, whereas OLMs are unknown before an order is placed. Ancillary supplies/services and ODC SINs are for use under all order type CLINs (Fixed-Price (FP), T&M, and LH), whereas the Order-Level Materials SIN is only authorized for use under T&M and LH order CLINs.The Order-Level Materials SIN is only authorized for use in direct support of another awarded SIN. Price analysis for OLMs is not conducted when awarding the FSS contract or FSS BPA; therefore, GSAR 538.270 and 538.271 do not apply to OLMs. OLMs are defined and priced at the ordering activity level in accordance with GSAR clause 552.238-82 Special Ordering Procedures for the Acquisition of Order-Level Materials. Prices for items provided under the Order-Level Materials SIN must be inclusive of the Industrial Funding Fee (IFF). The value of OLMs in a task or delivery order, or the cumulative value of OLMs in orders against an FSS BPA awarded under an FSS contract, cannot exceed 33.33%.The contractor may invoice monthly on the basis of cost incurred for the OLM, in accordance with GSAM 552.238-115 Special Order Procedures for the Acquisition of Order-Level Materials.The contractor may invoice monthly on the basis of cost incurred for the OLM CLIN. The invoice shall include the period of performance covered by the invoice and the CLIN number and title. In addition, the contractor shall provide the following detailed information for each invoice submitted, as applicable. Spreadsheet submissions, in MS Excel format, are required.a. OLM(s) purchased. b. Request to Initiate Purchase or Consent to Purchase number or identifier. c. Date delivery accepted by the Government. d. Associated CLIN.", "chunk_id": 26, "page_no": 29}, {"chunk": "Solicitation Number ID11190022 Page 28 of 53---e. Project-to-date totals by CLIN. f. Cost incurred not billed by CLIN. g. Remaining balance of the CLIN.6.5.4 Travel---Contractor costs for travel will be reimbursed at the limits set in the following regulations (see FAR 31.205-46):a. Federal Travel Regulation (FTR) - prescribed by GSA, for travel in the contiguousUnited States (U.S.).---b. Joint Travel Regulations (JTR) Volume 2, Department of Defense (DoD) Civilian Personnel, Appendix A - prescribed by the DoD, for travel in Alaska, Hawaii, and outlying areas of the U.S.The contractor may invoice monthly on the basis of cost incurred for cost of travel comparable with the FTR. The invoice shall include the period of performance covered by the invoice, the CLIN number and title. Separate worksheets, in MS Excel format, shall be submitted for travel.CLIN Total Travel: This invoice information shall identify all cumulative travel costs billed by CLIN. The current invoice period’s travel details shall include separate columns and totals and include the following:a. Travel Authorization Request identifier, approver name, and approval date. b. Current invoice period. c. Names of persons traveling. d. Number of travel days. e. Dates of travel. f. Number of days per diem charged. g. Per diem rate used. h. Total per diem charged. i. Transportation costs (rental car, air fare, etc.). j. Total charges. k. Explanation of variances exceeding ten percent of the approved versus actual costs.", "chunk_id": 27, "page_no": 30}, {"chunk": "Solicitation Number ID11190022 Page 29 of 53---Section 7 – Special Contract Requirements---7.1 Key Personnel The following are the minimum personnel who shall be designated as “Key.” The Government does not intend to dictate the composition of the ideal team to perform this contract.a. Program Manager (PM)---The Government desires that Key Personnel be assigned for the duration of the contract. Additional Key Personnel may be requested at the BPA Call Order level.7.1.1 Program Manager (PM)---The contractor shall identify a PM to serve as the Government’s primary POC and to provide overall leadership and guidance for all contractor personnel assigned to this BPA and resulting BPA Call Orders. The PM is responsible for the quality and efficiency of this BPA and resulting BPA Call Orders, to include both technical issues and business processes. The PM shall be an employee of the prime contractor. The PM shall assign taskings to contractor personnel, supervise on-going technical efforts, and manage overall performance. The PM shall have the authority to commit the contractor’s organization and make decisions for the contractor’s organization in response to Government issues, concerns, and comments, as well as be proactive in alerting the Government to potential contractual or programmatic issues. The PM shall be readily available to respond to Government questions, concerns, and comments, as well as be proactive in alerting the Government to potential contractual or programmatic issues.The contractor shall identify a PM by name that shall provide management, direction, administration, quality assurance, and leadership of the execution of this contract. The PM shall be available between the hours of 8:00am to 4:30pm Monday through Friday EST/EDT, except Federal Holidays or when the Government facility is closed for administrative reasons.It is desired that the PM has the following qualifications:", "chunk_id": 28, "page_no": 31}, {"chunk": "a. Certified Project Management Professional (PMP) or equivalent.---b. Experience managing competing, multiple vendors, crosses functional technology andinfrastructure projects simultaneously.---c. Experience in Enterprise Transformation efforts, through directing, managing,implementing and executing business and technology related solutions and project teams that involve shared services, assessments, design, business case development, IT strategy, planning, performance management, IT effectiveness, benchmarking, operating, systems integration, cloud architecture and infrastructure management.d. Experience with executing strategy and deliverables, as well as write, communicate,facilitate, and present cogently, to and/or for, all levels of industry audience, clients and internal staff and management, which includes the following: presentation slides, practice marketing materials, change management plans and/or project plans, workshops for various internal and external clients and audience levels, practice methodologies and tools, policies and procedures, whitepapers, other standard business communications.Solicitation Number ID11190022 Page 30 of 53---7.1.2 Key Personnel Substitution---The contractor shall not replace any personnel designated as Key Personnel without the written concurrence of the CO. Prior to utilizing other than the Key Personnel specified in its quote in response to the RFQ, the contractor shall notify the CO, COR and TPOC listed within the existing contract. This notification shall be no later than ten workdays in advance of any proposed substitution and shall include justification (including resume(s) and labor category of proposed substitution(s)) in sufficient detail to permit evaluation of the impact on contract performance.Substitute Key Personnel qualifications shall be equal to, or greater than, those of the Key Personnel substituted. If the CO, COR and TPOC determine that a proposed substitute Key Personnel is unacceptable, or that the reduction of effort would be so substantial as to impair the successful performance of the work under the contract, the contractor may be subject to default action as prescribed by FAR 52.249-8, Default (Fixed-Price Supply and Service).", "chunk_id": 29, "page_no": 32}, {"chunk": "7.2 Government-Furnished Property (GFP)---Government-furnished property will be identified at the BPA Call Order level if applicable.7.3 Government-Furnished Information (GFI) Government-furnished information will be identified at the BPA Call Order level if applicable.7.4 Security Requirements---The contractor shall comply with all security requirements. All contract personnel performing under this contract shall be U.S. citizens with a security clearance at the Public Trust Level One (1) Background.Contractor personnel shall be required to obtain and maintain security badges and adhere to the installation security requirements as applicable at the task order level. Homeland Security Presidential Directive (HSPD-12) mandates the issuance of a common form of identification for all federal employees and contractors for use in accessing government-controlled facilities and information systems. As a result, contract employees that require access to federal facilities for 6 months or more shall have the ability to pass a National Agency Check with Credit (NACIC) background investigation and obtain the HSPD-12 identification, if necessary for performance, before receiving computer access. The Contractor shall be responsible for the cost of complying with HSPD-12.7.4.1 Security Assessment and Authorization to Operate (ATO) Request---This requirement may vary depending on the type of information in the system. Security Integrated Project Team members will help determine what artifacts are needed based on the particulars of the application. Information systems software, hardware, and equipment developed by or sold to Federal agencies must undergo a Security Assessment and Authorization (SA&A) to receive an ATO before the system is operational. This is a mandatory requirement. The process culminates in the signing of the ATO request by HUD’s Chief Information Security Officer (CISO). The artifacts", "chunk_id": 30, "page_no": 32}, {"chunk": "Solicitation Number ID11190022 Page 31 of 53---required for the ATO package may vary based on the details of the developed application. Generally, the package will include information such as:1. System Security Plan: Provides an overview of the security requirements of the system and describes the controls in place or planned for meeting those requirements. OMB requires all Federal agencies to incorporate a security plan that is consistent with NIST guidance on security planning.2. Security Risk Assessment: Provides the inputs for the development of the Security Plan.3. Security Test and Evaluation Plan/Report: Security Test and Evaluation (ST&E) (often---times referred to as Certification Test & Evaluation) is a requirement within all Certification and Accreditation (C&A) processes. ST&E is the Independent Verification and Validation (IV&V) of a security control on a system to determine if it was properly implemented and if it is working correctly. While providing this service, organizations must leverage a variety of standards such as NIST 800115 to properly perform the testing.4. Business Impact Analysis (BIA): The BIA is a key step in the contingency planningprocess. The BIA enables the project team to fully characterize the system requirements, processes, and interdependencies and use this information to determine contingency requirements and priorities. The purpose of the BIA is to correlate specific system components with the critical services that they provide, and based on that information, to characterize the consequences of a disruption to the system components. Key steps are listing critical IT resources, identifying disruption impacts and allowable outage times, and developing recovery priorities.5. System Impact Analysis: Describes the changes that will occur to a system from theaddition of system or application enhancements or modification. It documents why a new ATO process is needed or not needed. The document is prepared by the Contractors Security Engineer.6. Contingency Plan: Contingency planning establishes thorough plans, procedures, and technical measures that can enable a system to be recovered quickly and effectively following a service disruption or disaster.", "chunk_id": 31, "page_no": 33}, {"chunk": "7.4.2 Federal Information Technology Security Services---The Contractor shall maintain compliance with all current and future Federal IT security requirements. The Contractor shall:(a) Maintain IT security and comply with all terms and conditions of the BPA throughout theterm of the BPA with respect to all data and information technology requirements.(b) Use, maintain, enhance, develop and upgrade all information technology software andsystem documentation under this BPA in accordance with Federal Laws, best practices, and regulations. This includes, but is not limited to:Solicitation Number ID11190022 Page 32 of 53---1. Federal Information Security Management Act - https://www.dhs.gov/fisma 2. The Clinger-Cohen Act - https://www.fismacenter.com/Clinger%20Cohen.pdf 3. Government Paper Reduction Act - http://www.hhs.gov/ocio/policy/collection/ 4. Office of Management, and Budget Circulars A-130, and A-I23 -https://www.whitehouse.gov/omb/circulars_default---5. Department of Housing and Urban Development regulations, Handbooks and---Policies - http://www.HUD.gov.---6. Applicable Ginnie Mae Handbooks and Policies and policies now and in thefuture - http://www.ginniemae.gov---7. GAO directives 8. Federal Financial Manager Integrity Act (FFMIA)(c) Maintain SA&A standards in accordance with guidance published by NIST. As part of each application deployment, an independent SA&A will be performed by HUD during the period of performance of this BPA. If applicable, per each BPA Call Order, the Contractors shall support the completion of the SA&A working with HUD and the HUD business partner who will be responsible for the application O&M once the application is developed.(d) Follow HUD's PPM Life Cycle and industry best practices in the analysis, design, development, testing and implementation of proposed new systems and/or the enhancement to existing systems.(e) Review and update system documentation to ensure accuracy, compliance andcompleteness. Reviews and revisions to be completed and delivered to HUD quarterly.(f) If applicable per each BPA Call, the Contractor will prepare its security plan as part of its demonstration that it meets the requirements for SA&A per the applicable requirements from HUD, OMB, NIST, etc., which will require the preparation of several related documents, including but not limited to:1. FIPS 199/200 Security Categorization Analysis; 2. SP-800 Security Controls Self-Assessment; 3. Application and network venerability scans; 4. Business Impact Assessment; 5. Privacy Impact Assessment; 6. Create System Security Plan, Risk Assessment, Technical Architecture, COOP and Contingency Plans, Quality Control Plan, ST&E Plan and other relevant SA&A supporting documentation for each new application;7. Security Assessment Reports (formerly ST&E Testing); 8. Security Assessment Reports (formerly ST&E Report); 9. POA&M; and 10. Accreditation Documentation.", "chunk_id": 32, "page_no": 34}, {"chunk": "Solicitation Number ID11190022 Page 33 of 53---(g) Each mixed or financial system that the Contractor manages, develops, modifies, enhances, releases and/or upgrades will be assessed under the Federal Information System Controls Audit Manual (FISCAM) methodology that includes control families for both General Computer and Business Process Application controls:General Controls ● Security Management ● Access Controls ● Configuration Management ● Segregation of Duties ● Contingency Planning ● Business Process Application Controls ● Application Security ● Business Process Controls ● Interfaces ● Data Management(h) Each mixed or financial system that the Contractor manages, develops, modifies,enhances, releases and/or upgrades must comply with identified OMB A-123 Appendix A. “Management’s Responsibility for Internal Control”, and Appendix D (Compliance with the Federal Financial Management Improvement Act of l996) key controls; and the Federal Information Security Management Act of 2002 (FISMA) to include:1. National Institute of Standards and Technology Special Publication (SP) 800-53,Security and Privacy Controls for Federal Information Systems and Organizations, Revision 4 (NIST SP 800-53, Rev. 4)2. NIST SP 800-18 Rev. 1 – Guide for Developing Security Plans for FederalInformation Systems---3. NIST SP 800-23 – Guidelines to Federal Organizations on Security Assurance---and Acquisition/Use of Tested/Evaluated Products---4. NIST SP 800-30 Rev. 1 – Guide for Conducting Risk Assessments 5. NIST SP 800-34 Rev. 1 – Contingency Planning Guide for Federal Information", "chunk_id": 33, "page_no": 35}, {"chunk": "Systems---6. NIST SP 800-37 Rev. 1 – Guide for Applying the Risk Management Frameworkto Federal Information Systems---7. NIST SP 800-47 – Security Guide for Interconnecting Information Technology---Systems---8. NIST SP 800-53A Rev. 1 – Guide for Assessing the Security Controls in Federal Information Systems and Organizations, Building Effective Security Assessment Plans9. NIST SP 800-59 – Guideline for Identifying an Information System as a NationalSecurity System---10. NIST SP 800-60 Rev. 1 – Guide for Mapping Types of Information andInformation Systems to Security Categories---11. NIST SP 800-84 – Guide to Test, Training, and Exercise Programs for IT Plansand Capabilities---Solicitation Number ID11190022 Page 34 of 53---12. Federal Information Processing Standards (FIPS) 199/200 – Security---Categorization Analysis---13. FIPS 191 – Guideline for the Analysis of Local Area Network Security(i) HUD will have responsibility for maintaining the FISCAM-based mapping of security controls that will be required to maintain compliance with FISMA, OMB A-123, and HUD security requirements.1. The Contractor shall support and provide system security to ensure availability, confidentiality, and integrity of the HUD OCIO Application Modernization (e.g. maintaining access control, user identification, password protection and authentication, confidentiality of customer profiles and traffic, physical and personnel security required under this BPA). Provide SA&A support, including potential off cycle or unanticipated SA&A support, over the life of the contract.(j) Failure to adhere to the above NIST requirements could result in penalties, to include the issuance of a BPA performance stop-work order until compliance can be demonstrated. Disregard of these NIST requirements could also lead to other criminal, civil, administrative, or contract penalties, including:1. Breach of Contract damages 2. False Claims Act damages 3. Liquidated Damages 4. Termination for Default 5. Termination for Convenience 6. Poor Past Performance 7. Suspension/debarment", "chunk_id": 34, "page_no": 36}, {"chunk": "7.4.3 Prevailing Terms and Conditions---This BPA shall adhere to the rules, regulations, laws, standards, and conventions identified by HUD as well as within the Federal Government. The HUD standards and guidelines attached (see Attachment K) have been coded as mandatory (M) and advisory (A). The Contractor shall comply with the standards and guidelines coded as mandatory. The Contractor shall be guided by the standards and guidelines coded advisory to the extent necessary to accomplish requirements in this BPA.7.5 Organizational Conflict of Interest and Non-Disclosure Requirements---7.5.1 Organizational Conflict of Interest (OCI)---a. If a contractor has performed, is currently performing work, or anticipates performingwork that creates or represents an actual or potential OCI, the contractor shall immediately disclose this actual or potential OCI to the CO in accordance with FAR Subpart 9.5. The nature of the OCI may involve the prime contractor, subcontractors of any tier, or teaming partners.Solicitation Number ID11190022 Page 35 of 53---b. The contractor is required to complete and sign an OCI Statement. The contractor must represent either that (1) It is not aware of any facts which create any actual or potential OCI relating to the award of this contract, or (2) It has included information in its quote, providing all current information bearing on the existence of any actual or potential OCI and has included a mitigation plan in accordance with paragraph (c) below.c. If the contractor with an actual or potential OCI believes the conflict can be avoided,neutralized, or mitigated, the contractor shall submit a mitigation plan to the Government for review.d. In addition to the mitigation plan, the CO may require further information from thecontractor. The CO will use all information submitted by the contractor, and any other relevant information known to GSA, to determine whether an award to the contractor may take place, and whether the mitigation plan adequately avoids, neutralizes, or mitigates the OCI.e. If any such conflict of interest is found to exist, the CO may determine that the conflictcannot be avoided, neutralized, mitigated, or otherwise resolved to the satisfaction of the Government and the contractor may be found ineligible for award. Alternatively, the CO may determine that it is otherwise in the best interest of the U.S. to contract with the contractor and include the appropriate provisions to avoid, neutralize, mitigate, or waive such conflict in the BPA awarded.", "chunk_id": 35, "page_no": 37}, {"chunk": "7.5.2 Non-Disclosure Requirements---If the contractor acts on behalf of, or provides advice with respect to any phase of an agency procurement, as defined in FAR 3.104-4, then the contractor shall execute and submit a Corporate Non-Disclosure Agreement (NDA) Form, Attachment G and ensure that all its personnel (to include subcontractors, teaming partners, and consultants) who will be personally and substantially involved in the performance of the contract:a. Are instructed in the FAR 3.104 requirements for disclosure, protection, and marking ofcontractor bid or quote information, or source selection information.---b. Are instructed in FAR Part 9 for third-party disclosures when acting in an advisorycapacity.---All proposed replacement contractor personnel shall also be instructed in the requirements of FAR 3.104. Any information provided by contractors in the performance of this BPA or obtained from the Government is only to be used in the performance of the contract. The contractor shall put in place appropriate procedures for the protection of such information and shall be liable to the Government for any misuse or unauthorized disclosure of such information by its personnel, as defined above.7.6 Section 508 Compliance Requirements---Unless the Government invokes an exemption, all Electronic and Information Technology (EIT) products and services provided shall fully comply with Section 508 of the Rehabilitation Act of 1973, per the 1998 Amendments, 29 U.S.C. 794d, and the Architectural and Transportation Barriers Compliance Board’s EIT Accessibility Standards at 36 Code of Federal Regulations (CFR) 1194. The contractor shall identify all EIT products and services provided, identify the technical standards applicable to all products and services proposed, and state the degree of", "chunk_id": 36, "page_no": 37}, {"chunk": "Solicitation Number ID11190022 Page 36 of 53---compliance with the applicable standards. Additionally, the contractor must clearly indicate where the information pertaining to Section 508 compliance can be found (e.g., Vendor’s or other exact web page location). The contractor must ensure that the list is easily accessible by typical users beginning at the time of award.7.7 Commercial Supplier Agreements---The Government understands that commercial software tools that may be purchased in furtherance of this BPA and as contemplated in the OLM CLIN (included with final RFQ) may be subject to commercial agreements which may take a variety of forms, including without limitation licensing agreements, terms of service, maintenance agreements, and the like, whether existing in hard copy or in an electronic or online format such as “clickwrap” or “browsewrap” (collectively, “Supplier Agreements”). For purposes of this BPA, the Supplier Agreements are “collateral agreements” within the meaning of the FAR clause at 52.227-14.The contractor shall ensure that any proposed Supplier Agreements allow the associated software and services to be used as necessary to achieve the objectives of this BPA. The contractor shall provide all applicable Supplier Agreements to the CO prior to purchase and shall cooperate with the Government, including negotiations with the licensor as appropriate, to ensure compliance with this Section. Without limiting the generality of the foregoing, a compliant Supplier Agreement shall permit all of the following at no extra charge to the Government:(a) Access and use by support contractors, including a successor contractor upon termination or expiration of this BPA;(b) Access and use by employees of other Federal, state and local law enforcement agencies;(c) Transfer to a different data center and/or a successor contractor’s cloud; and(d) The creation of derivative works that shall be subject to at least the same rights as set forth in subparagraphs (a) through (c) above. The above rights constitute “other rights and limitations” as contemplated in subparagraph (d) of the FAR clause at 52.227-14, Rights In Data – General (May 2014), Alternate III (Dec 2007).", "chunk_id": 37, "page_no": 38}, {"chunk": "7.8 Press/ News Release---The contractor shall not make any press/news release pertaining to this procurement without prior Government approval and only in coordination with the CO.7.9 Intellectual Property Rights---The existence of any patent, patent application or other intellectual property right that encumbers any deliverable must be disclosed in writing on the cover letter that accompanies the delivery. If no such disclosures are provided, the data rights provisions in FAR 52.227-14.Solicitation Number ID11190022 Page 37 of 53---Section 8 – Contract Clauses---8.1 FAR 52.252-2 Clauses Incorporated by Reference (FEB 1998) This contract incorporates one or more clauses by reference with the same force and effect as if they were given in full text. Upon request, the CO will make their full text available. Also, the full text of a clause may be accessed electronically at the FAR website:http://www.acquisition.gov/far/---Table 2: FAR 52.252-2 Clauses Incorporated by Reference (FEB 1998)---FAR---Clause Title---Date---52.203-13 Contractor Code of Business Ethics and Conduct---(Oct 2015)52.204-7System for Award Management---(Oct 2018)52.204-8 Annual Representations and Certifications---(Oct 2018)52.204-9Personal Identity Verification of Contractor Personnel---(Jan 2011)52.204-10 Reporting Executive Compensation and First-Tier Subcontract Awards---(Oct 2018)52.204-14 Service Contract Reporting Requirements---(Oct 2016)52.209-5 Certification Regarding Responsibility Matters---(Oct 2015)52.209-7Information Regarding Responsibility Matters---(Oct 2018)52.209-9 Updates of Publicly Available Information Regarding Responsibility---(Oct 2018)Matters---Representation by Corporations Regarding Delinquent Tax Liability or a Felony Conviction under any Federal Law52.209-11(Feb 2016)", "chunk_id": 38, "page_no": 39}, {"chunk": "52.209-12 Certification Regarding Tax Matters---(Feb 2016)Limitations on Pass-Through Charges- Identification of Subcontractor Effort---52.215-22(Oct 2009)52.215-23 Limitations on Pass-Through Charges---(Oct 2009)52.217-5 Evaluation of Options---(Jul 1990)52.222-17 Non-displacement of Qualified Workers---(May 2014)52.225-1 Buy American – Supplies---(May 2014)Solicitation Number ID11190022 Page 38 of 53---52.227-14 Rights in Data – General---(May 2014)Representation of Limited Rights Data and Restricted Computer Software---52.227-15(Dec 2007)52.239-1 Privacy or Security Safeguards---(Aug 1996)52.243-1 Changes – Fixed Price---(Aug 1987)52.243-3 Changes – Time-and-Materials or Labor-Hours---(Sept 2000)52.246-1 Contractor Inspection Requirements---(Apr 1984)52.246-2Inspection of Supplies-Fixed-Price---(Aug 1996)52.246-4Inspection of Services— Fixed Price---(Aug 1996)52.246-6Inspection-Time-and-Material and Labor-Hour---(May 2001)52.246-19 Warranty of Systems and Equipment under Performance Specifications---(May 2001)or Design Criteria---8.1.1 FAR Clauses Incorporated by Full Text---FAR 52.217-8 Option to Extend Services (NOV 1999)---The Government may require continued performance of any services within the limits and at the rates specified in the contract. These rates may be adjusted only as a result of revisions to prevailing labor rates provided by the Secretary of Labor. The option provision may be exercised more than once, but the total extension of performance hereunder shall not exceed six months. The CO may exercise the option by written notice to the Contractor within 30 days.(End of clause)---FAR 52.217-9 Option to Extend the Term of the Contract (MAR 2000)---a. The Government may extend the term of this contract by written notice to the Contractor provided that the Government gives the Contractor a preliminary written notice of its intent to extend at least 60 days the contract expires. The preliminary notice does not commit the Government to an extension.b. If the Government exercises this option, the extended contract shall be considered toinclude this option clause.c. The total duration of this contract, including the exercise of any options under this clause,shall not exceed 66 months.", "chunk_id": 39, "page_no": 40}, {"chunk": "Solicitation Number ID11190022 Page 39 of 53---(End of clause)---8.2 General Services Administration Acquisition Manual (GSAM) Clauses Incorporated---by Reference---The full text of a provision may be accessed electronically at the GSAM website:https://www.acquisition.gov/gsam/gsam.html---Table 3: General Services Administration Acquisition Manual (GSAM) Clauses Incorporated by Reference GSAM 552.204-9TITLE Personal Identity Verification Requirements Contract Terms and Conditions—Commercial Items (FAR Deviation) Prompt Payment Unenforceability of Unauthorized Obligations (FAR Deviation) Special Ordering Procedures for the Acquisition of Order- Level Materials Information Technology Security Plan and Security Authorization Security Requirements for Unclassified Information Technology ResourcesDATE---OCT 2012552.212-4FEB 2018552.232-25NOV 2009552.232-39JUL 2015552.238-115MAY 2019552.239-70JUN 2011552.239-71JAN 20128.2.1 GSAM CLAUSES INCORPORATED BY FULL TEXT---GSAM 552.212-71 Contract Terms and Conditions Applicable to GSA Acquisition of Commercial Items (JUNE 2016)As prescribed in 512.301(a)(1), insert the following clause:Contract Terms and Conditions Applicable to GSA Acquisition of Commercial Items (Jun 2016)(a) The Contractor agrees to comply with any clause that is incorporated herein by reference to implement agency policy applicable to acquisition of commercial items or components. The clause in effect based on the applicable regulation cited on the date the solicitation is issued applies unless otherwise stated herein. The clauses in paragraph (b) of this section are incorporated by reference:(b) Clauses---552.203-71 Restriction on Advertising---552.211-73 Marking552.215-70 Examination of Records by GSA---", "chunk_id": 40, "page_no": 41}, {"chunk": "552.215-71 Examination of Records by GSA (Multiple Award Schedule)---Solicitation Number ID11190022 Page 40 of 53---552.229-70 Federal, State, and Local Taxes---552.232-23 Assignment of Claims---552.232-72 Final Payment---552.237-71 Qualifications of Employees---552.238-71 Submission and Distribution of Authorized FSS Schedule Price List---552.238-74 Industrial Funding Fee and Sales Reporting---552.238-75 Price Reductions---552.238-81 Modifications (Multiple Award Schedule)---552.242-70 Status Report of Orders and Shipments---(End of clause)---8.3 HUD Acquisition Regulation (HUDAR) Clauses Incorporated by Reference---The full text of a provision may be accessed electronically at Defense Procurement and Acquisition Policy website:Table 4: HUD Acquisition Regulation (HUDAR) Clauses Incorporated by Reference---HUDAR---TITLE---2452.203-70 Prohibition Against the Use of Federal Employees---Preservation of, and Access to, Contract Records (Tangible and Electronically Stored Information (ESI) Formats) – Alternate II2452.204-702452.233-70 Review of Contracting Officer Protest Decisions 2446.502-70---Inspection and acceptance---https://www.hud.gov/program_offices/cpo/hudar---Solicitation Number ID11190022 Page 41 of 53---Section 9 – List of Attachments---9.1 List of Attachments The following attachments are attached, either in full text or electronically at the end of the RFQ.Table 5: List of Attachments---ATTACHMENT A B C D E---TITLE---SF 1449 COR Appointment Letter (To be completed at time of BPA award) TPOC Appointment Letter (To be completed at time of BPA award) Problem Notification Report (PNR) Template Corporate Non-Disclosure Agreement (NDA) Key Personnel Qualification Matrix (KPQM) (To be removed at time of award) Similar Experience Template (To be removed at time of award) Pricing Schedule and Labor Category (LCAT) descriptions (To be removed at time of award) Glossary of Definitions, Abbreviations, and Acronyms", "chunk_id": 41, "page_no": 43}, {"chunk": "F---G---H---I---Solicitation Number ID11190022 Page 42 of 53---Section 10 – Representations, Certifications, and Other Statements of Offerors or Respondents---This page intentionally left blank.Solicitation Number ID11190022 Page 43 of 53---Section 11 – Instructions, Conditions, and Notices to Offerors---11.1 FAR 52.252-1 Solicitation Provisions Incorporated by Reference (FEB 1998) This solicitation incorporates one or more solicitation provisions by reference, with the same force and effect as if they were given in full text. Upon request, the CO will make the full text available. The offeror is cautioned that the listed provisions may include blocks that must be completed by the offeror and submitted with its quotation or offer. In lieu of submitting the full text of those provisions, the offeror may identify the provision by paragraph identifier and provide the appropriate information with its quotation of offer. The solicitation provisions and/or contract clauses are available in either HTML or PDF format at:https://www.acquisition.gov/far---Table 6: Solicitation Provisions Incorporated by Reference (FEB 1998) FAR 52.204-7 52.215-1 52.217-5TITLE System for Award Management Instructions to Offerors-Competitive Acquisition Evaluation of Options Prohibition on Contracting With Entities Engaging in Certain Activities or Transactions Relating to Iran— Representation and Certifications Representation of Limited Rights Data and Restricted Computer Software Submission of Electronic Funds Transfer Information with Offer", "chunk_id": 42, "page_no": 45}, {"chunk": "DATE---OCT 2016 JAN 2004 JUL 199052.225-25OCT 201552.227-15DEC 200752.232-38JUL 201311.2 General Instructions---a. Offerors shall furnish the information required by this solicitation. A Standard Form (SF) 1449, \"Solicitation/Contract/Order for Commercial Items\" completed and signed by the offeror, Block 30, constitutes the offeror's acceptance of the terms and conditions of the proposed RFQ. Therefore, the SF 1449 must be executed by a representative of the offeror authorized to commit the offeror to contractual obligations.b. Offerors are expected to examine this entire solicitation document including the Contract.Failure to do so will be at the offeror's own risk.c. The Government reserves the right to make an award based on initial offers received,without discussion of such offers. Proposals shall set forth full, accurate, and complete information as required by this solicitation package (including Attachments). The penalty for making false statements in proposals is prescribed in 18 U.S.C. 1001. d. Offerors submitting restrictive data will mark it as follows in accordance with the FAR 52.215-1, Instructions to Offerors - Competitive Acquisition, which is incorporated by reference. Clause 52.215-1 states: \"Offerors who include in their proposals data they do not want disclosed to the public for any purpose or used by the Government except for evaluation purposes, shall –", "chunk_id": 43, "page_no": 45}, {"chunk": "Solicitation Number ID11190022 Page 44 of 53---Mark the title page with the following legend:---\"This proposal includes data that shall not be disclosed outside the Government and shall not be duplicated, used or disclosed--in whole or in part--for any purpose other than to evaluate this proposal or quotation. If, however, a BPA Call Order is awarded to this offeror as a result of--or in connection with--the submission of this data, and the Government incorporates the proposal as part of the award, the Government shall have the right to duplicate, use, or disclose the data. Also, this restriction does not limit the Government's right to use information contained in this data if it is obtained from another source without restriction. The data subject to the restriction is contained in sheets (insert numbers or other identification of sheets)\"; andMark each sheet of data it wishes to restrict with the following legend:\"Use or disclosure of data contained on this sheet is subject to the restriction on the title page of this proposal or quotation.\"e. The Government assumes no liability for disclosure or use of unmarked data and may use or disclose the data for any purpose. Unless restricted, information submitted in response to this request may become subject to disclosure to the public pursuant to the provisions of the Freedom of Information Act (5 U.S.C. 551).", "chunk_id": 44, "page_no": 46}, {"chunk": "11.3 General Information---11.3.1 Availability of Equipment and Software---All commercial and non-commercial hardware and software proposed in response to this solicitation and subsequent BPA Call Orders shall not have been formally announced as at its end of life or end of technical support by its publisher or licensor. Proposal of commercial or non-commercial hardware and software that is at its end of life may render the offeror’s proposal NOT ACCEPTABLE.11.3.2 Contractor Support during Technical Evaluations---The Government may employ contractor support from Contracting Resources Group, Inc. and Accurate Conceptions, during the evaluation of proposals. These technical consultants/advisors will only be used to draft reports and advise on specific technical, management, and price matters and shall not under any circumstances, be used as evaluators. Personnel from this organization will execute non-disclosure agreements.11.4 Submission of Questions---Offerors are required to submit their questions to this RFQ by referencing the particular Section/subsection number. Questions must be received by August 12, 2019 at 5:00PM ET via email to amber.jones@gsa.gov. Questions or requests for extension submitted after the cutoffSolicitation Number ID11190022 Page 45 of 53---date will not be considered. Questions shall be submitted in the table format specified below in Table 7.Table 7: Format BPA Questions---BPA Reference (section number)---", "chunk_id": 45, "page_no": 47}, {"chunk": "Recommended Answer/Solution and Rationale---Question---Comment---1.2.…Any information given to a prospective offeror concerning this solicitation will be furnished promptly to other prospective offerors as an amendment to the solicitation.11.5 Submission of Offers---Each offer shall be in two parts.Part I is the written Price proposal and shall contain the following: a. Organizational Conflict of Interest Statement (TAB A) b. Contract Registration (TAB B) c. Solicitation, Offer and Award (SF1449) (TAB C) d. Supplies or Services and Prices/Costs (TAB D) e. Subcontractor Pricing (TAB E)Part II is the written Technical Proposal and shall contain the following:a. 508 Compliance b. Key Personnel c. Similar Experience11.6 Submission of the Written Price Quote (Part I) Note: The price proposal shall be no more than 30 pages. The Microsoft Excel spreadsheet is exempt from the page limit.Solicitation Number ID11190022 Page 46 of 53---The price proposal will be evaluated (but not scored) based on Price reasonableness. The offeror shall fully support all proposed prices. The offeror’s proposal is presumed to represent the offeror’s best efforts in response to the solicitation. Any inconsistency, whether real or apparent, between promised performance, and cost or price, shall be explained in the proposal.Written Price Proposals shall be submitted as an electronic copy only. The offeror shall submit pricing in Microsoft Word or PDF for the narrative components of the price proposal tabs and a Microsoft Excel spreadsheet for the pricing portion of the proposal utilizing the formats without cells locked and include all formulas. The offeror shall include adequate information, which will allow the Government to determine price reasonableness.All prime offerors are responsible for ensuring that all subcontracts include the same type of price detail as required above.Offerors shall not include any price data in the technical proposals.11.6.1 Price Quote TABs The price proposal shall contain the following tabs:a. Organizational Conflict of Interest Statement (Tab A). The offeror and eachsubcontractor, consultant, and teaming partner shall complete and sign an Organizational Conflict of Interest (OCI) Statement. The OCI Statement shall identify any actual or potential conflicts of interest(s) under this contract.b. Contract Registration (Tab B). The offeror shall submit a statement that the contractholder under which this proposal is being submitted has been registered in ITSS and that all information in ITSS is up-to-date. In order to qualify for award, all vendors must be registered at ITSS. The URL for ITSS registration is http://web.itss.gsa.gov.c. Solicitation, Offer and Award (SF 1449) (Tab C). When completed and signed by the offeror constitutes the offeror's acceptance of the terms and conditions of the proposed contract. Therefore, the form must be executed by representatives of the offeror authorized to commit the offeror to contractual obligations. Offerors shall sign the SF 1449 in Block #17.d. Supplies or Services and Prices/Costs (Tab D). The information requested is required to enable the Government determine price reasonableness. The Offeror shall complete the Pricing Schedule (Attachment H) utilizing their GSA labor rates. Attachment H must be submitted in an electronic editable soft copy. The price proposal shall be based on the offeror’s GSA Labor Rate Schedule, utilizing any and all discounts. Subcontractor rate information shall also be included, if applicable.e. Subcontractor Supporting Documentation (Tab E). If a subcontractor is proposed, alllabor proposed must be contained within the prime contractor’s GSA Schedule Contract. The Government will evaluate the acceptability of any subcontractor as part of its evaluation of price. Failure to provide complete supporting documentation may result in no further consideration of the offeror’s quote. Subcontractors may submit proprietary", "chunk_id": 46, "page_no": 48}, {"chunk": "Solicitation Number ID11190022 Page 47 of 53---data directly to the GSA CO or through the prime contractor is a separate, sealed envelope.11.6.2 Price Assumptions No Assumptions, Conditions, Exceptions are permitted. Any response containing Assumptions, Conditions, or Exceptions will be rejected and ineligible for award.11.7 Submission of the Written Technical Quote (Part II)---Each offeror shall submit all information described in the following paragraphs. The offeror shall provide an electronic original containing all required sections of this Part.Note: The technical proposal shall be no more than 100 pages. All pages must maintain 1” margins, 12 point Times New Roman font, single spaced and single sided. Unless otherwise specified, pages must be 8.5x11 inch. Charts/Graphics embedded in proposal will count toward page limitations. Key Personnel Qualification Matrix, Project Staffing Plan, and Similar Experience will not count towards the page number limitation. Charts/Graphics text shall be a minimum of 10 point Times New Roman font. Items such as a Title Page, Table of Contents, Cover Letter, List of Figures, and Acronym Lists are excluded from the page counts below, unless they are inclusive of a document; in which case it would count toward the stated page limitations. PDF files are permitted for executed documents such as Letters of Commitment.Any pages submitted beyond the page limitations will be removed and not evaluated. Unless otherwise specified, one page is one side of an 8.5” x 11” piece of paper.11.7.1 508 Compliance (Factor 1) The offeror’s written proposal shall include a statement indicating its capability to comply with Section 508 requirements throughout its performance of this acquisition in accordance with Section 7.6.11.7.2 Key Personnel (Factor 2) The offeror shall describe and document its Key Personnel. While contractors are not required to be cleared by the Government at the time proposals are submitted, Offerors shall ensure all Key Personnel proposed will be able to successfully complete the Governments clearance process.a. The offeror shall describe the rationale for choosing its proposed Key Personnel.b. The offeror shall provide resumes, certifications, and a letter of commitment for", "chunk_id": 47, "page_no": 49}, {"chunk": "each Key Personnel.---The offeror shall submit a Key Personnel Qualification Matrix (KPQM) (see Section 9.1, Attachment F) for each Key Person proposed relating the certifications identified in Section 7.1 of this RFQ and the qualifications of the person or persons being proposed for that position. Each KPQM shall be limited to three pages.11.7.3 Similar Experience (Factor 3) The Similar Experience Template (Section 9.1, Attachment G) shall be used to cite up to five (5) project references. The submission for each project cited shall not exceed four (4) pages.Solicitation Number ID11190022 Page 48 of 53---The similar experience shall present evidence of the Offeror’s Similar Experience up to five (5) contracts performed in the past five (5) years. Contracts (commercial, Federal, state, and local government) of similar work and complexity related to Section 2 of this RFQ. If the Offeror has no single contract experience that encompasses all types of experience as outlined in Section 2 of this RFQ, the Offeror may show relevant experience through a combination of contracts which together show that work has been accomplished which is consistent in size, scope and complexity. The Offeror’s documentation of relevant experience shall include a description of the specific project that also addresses each project’s characteristics, such as size, scope and complexity.11.8 Technical Assumptions No Assumptions, Conditions, Exceptions are permitted. Any response containing Assumptions, Conditions, or Exceptions will be rejected and ineligible for award.11.9 Delivery Instructions Proposals must be submitted electronically via eBuy on or before the solicitation closing date.", "chunk_id": 48, "page_no": 50}, {"chunk": "Solicitation Number ID11190022 Page 49 of 53---Section 12 – Evaluation Factors for Award---12.1 Method of Award The government intends to issue multiple BPA awards as a result of this RFQ. Awards will be made to multiple small and large businesses. Awards will be made to the lowest priced technically acceptable offerors. Quotes will initially be screened for business size. Then will be placed in order of price (lowest price to highest price). GSA will then evaluate the technical factors of the lowest priced quote. GSA intends to make multiple awards to both large and small business firms based on lowest price technical acceptability. Accordingly, under this methodology, the technical factors of some quotes may not be evaluated by GSA. If discussions are deemed necessary by the CO, all quotes will be evaluated (both technical and price).An unacceptable rating for any of the evaluation criteria will result in the quotes being rendered technically unacceptable.This acquisition is being conducted under FAR 8.4. Selection of Offerors for BPA awards will be based on a comparative evaluation of quotes against the factors identified in this section. Principles and procedures of Subpart 15.3 do not apply. The Government reserves the right to make an award based on initial offers received, without discussion of such offers in accordance with FAR clause 52.215-1, or the Government may make award after clarifications of some aspects of the proposal or discussions relative to price only. Accordingly, the Government reserves the right to do any or all of the following:", "chunk_id": 49, "page_no": 51}, {"chunk": "a. Award on initial proposals, without discussion.---b. Ask clarifying questions during the question and answer period if needed. Clarification questions may include asking offerors to clarify their written technical proposals. As a result, the Government may have communications with some, but not all, offerors; these communications, however, will be clarifications and not discussions. In these situations, the Government will consider the offeror’s clarifying response(s) without allowing proposal revisions.c. Have communications; ask clarifying questions, request corrections relative to minorerrors in the price proposal, or request price substantiating documentation to facilitate the Government’s final evaluation of cost proposals with one or some offerors. These communications, clarifications, or requests for corrections or substantiating documentation will not materially change the offeror's proposal in terms of conformance to RFQ requirements, constitute discussions such as the removal of an unacceptable assumption, or materially change pricing.Proposals shall set forth full, accurate, and complete information as required by this solicitation package (including Attachments). The penalty for making false statements in proposals is prescribed in 18 U.S.C. 1001.Solicitation Number ID11190022 Page 50 of 53---12.2 Price Proposal Evaluation GSA will evaluate the reasonableness of quoted rates submitted in response to the labor categories as outlined within Attachment H to determine the overall best value. GSA will confirm that the rates quoted do not exceed the IT Schedule 70 rates. Quotes containing inaccurate pricing information will be deemed ineligible for a BPA and will not be further evaluated.GSA will evaluate the Offerors provided GSA labor rate discounts on Attachment H. The indicated discount(s) will be utilized for all GSA labor rates, unless otherwise stated as an exception, and for the awarded agreements (base period and option periods). For the purpose of pricing evaluation, the Offeror shall complete all labor rates, and every applicable cell (all yellow filled cells) on the attached Pricing Schedule (Attachment H). The pricing schedule includes estimated hours for each labor category. The estimated hours listed in the Pricing Schedule are for evaluation purposes only. Failure to do so may result in the quote being rejected without further consideration.GSA will evaluate all rates which must be firm fixed price and fully loaded to include all direct, indirect cost and profit. The attached Pricing Schedule and complete GSA labor rates must be submitted in an electronic editable soft copy. The Excel sheet contains formulas for ease and use; however, the Offeror must verify (and is responsible for) the accuracy of their submitted quote. For the purpose of the evaluation, estimated hours for the base and each option have been included in the Pricing Schedule, and the total cost estimate calculated from the estimated hours and proposed labor rates will be used for the Government's price analysis.The six-month extension period, authorized by FAR clause 52.217-8, will not be included in the total evaluated price; however, it will be evaluated to ensure that the option is available for the unilateral exercise of the Government should an extension become necessary. The offeror shall not propose a price for the six-month extension.12.2.1 Organizational Conflict of Interest (OCI) Tab F will be evaluated to assess whether or not an actual or potential OCI exists as defined by FAR Part 9.5. If an actual or potential conflict of interest is identified that cannot be feasibly mitigated, avoided, or resolved in accordance with FAR Part 9.5, that offeror may be ineligible for award.12.2.2 Price Assumptions No Assumptions, Conditions, Exceptions are permitted. Any response containing Assumptions, Conditions, or Exceptions will be rejected and ineligible for award.12.2.3 Overtime and Extended Billing Hour Practices The Government reserves the right to reject any proposal that includes overtime or extended hours billing practices.12.3 Technical Evaluation Factors The Government will evaluate technical proposals based on the following factors:", "chunk_id": 50, "page_no": 52}, {"chunk": "Solicitation Number ID11190022 Page 51 of 53---Factor 1: 508 Compliance Factor 2: Key Personnel Factor 3: Similar Experience---12.3.1 Rating Methodology The Government will assign one of the following ratings for each technical factor:Rating---Definition---Acceptable---The proposal clearly meets the requirements of the solicitation.Unacceptable---The proposal does not clearly meet the requirements of the solicitation.Factor 1: 508 Compliance (Acceptable/ Unacceptable) The offeror’s proposal will be evaluated to determine whether it includes a statement indicating its capability to comply with Section 508 requirements throughout its performance of this TO. Any proposal that does not include a statement indicating the offeror’s capability to comply with Section 508 requirements throughout its performance of this TO shall be eliminated from further consideration for award.Factor 2: Key Personnel (Acceptable/ Unacceptable) The offeror’s Key Personnel will be evaluated based on its adherence to the instructions identified in Sections 7.1 and 11.7.2. The Government will evaluate, at a minimum, information submitted with the quote for the proposed Key Personnel. Evaluation will be based on the extent to which personnel submitted by the Offeror meets the desired experience and education specified in Section 7.1.The Government reserves the right to verify the performance on other contracts of Key Personnel identified by the Offeror in their proposal. The Government reserves the right to utilize other information available to evaluate Key Personnel. For example, the Government may query contract references and other end user representatives regarding the experience of proposed Key Personnel and the quality of their performance.The offeror’s Key Personnel Qualification Metrix (KPQM) will be evaluated on its clarity, relevance, and adherence to the KPQM identified in Section 9.1, Attachment F; and its adherence to the instructions and requirements identified in Section 11.7.2.a. The Government will reject any quote that does not provide a name for each Key Personnel proposed at the quote submission due date. A quote that states, “To Be Determined” or TBD for a proposed Key Person, or omits a Key Person, will be rejected by the Government.", "chunk_id": 51, "page_no": 53}, {"chunk": "Solicitation Number ID11190022 Page 53 of 53---", "chunk_id": 53, "page_no": 54}, {"chunk": "Solicitation Number ID11190022 Page 53 of 53---", "chunk_id": 53, "page_no": 54}]